[Killed] ConditionalExpression
auth/domain/authDomain.js:24:38
  */
 class UserCodeValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (typeof value !== 'string' || false) {
       throw new DomainError('userCode es requerido');
     }
killedBy: AuthController.iniciarSesion returns 400 on DomainError (empty userCode)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] StringLiteral
auth/domain/authDomain.js:25:29
 class UserCodeValueObject {
   constructor(value) {
     if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('userCode es requerido');
+      throw new DomainError("");
     }
     this.value = value.trim();
killedBy: UserCodeValueObject invariantes — lanza DomainError null → lanza "userCode es requerido"
statusReason: expected [Function] to throw error including 'userCode es requerido' but got ''

[Killed] BlockStatement
auth/domain/authDomain.js:36:22
  * Value Object: Password (no vacío)
  */
 class PasswordValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.length === 0) {
-      throw new DomainError('password es requerido');
-    }
-    this.value = value;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: PasswordValueObject camino feliz acepta contraseña válida
statusReason: expected undefined to be 'secret123' // Object.is equality

[Killed] LogicalOperator
auth/domain/authDomain.js:37:9
  */
 class PasswordValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.length === 0) {
+    if (typeof value !== 'string' && value.length === 0) {
       throw new DomainError('password es requerido');
     }
killedBy: PasswordValueObject invariantes — lanza DomainError null → lanza "password es requerido"
statusReason: expected [Function] to throw error including 'password es requerido' but got 'Cannot read properties of null (readi…'

[Killed] EqualityOperator
auth/domain/authDomain.js:37:38
  */
 class PasswordValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.length === 0) {
+    if (typeof value !== 'string' || value.length !== 0) {
       throw new DomainError('password es requerido');
     }
killedBy: AuthController.iniciarSesion returns 200 with user on successful login
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
auth/domain/authDomain.js:50:48
  * Protege invariantes y expone parámetros posicionales para la capa de infraestructura.
  */
 class AuthAggregate {
-  constructor({ userCodeVO, passwordVO } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
-      throw new DomainError('userCodeVO inválido');
-    }
-    if (!(passwordVO instanceof PasswordValueObject)) {
-      throw new DomainError('passwordVO inválido');
-    }
-    this._userCode = userCodeVO;
-    this._password = passwordVO;
-    Object.freeze(this);
-  }
+  constructor({ userCodeVO, passwordVO } = {}) {}
 
   /**
killedBy: AuthAggregate obtenerParametros() — orden y valores exactos devuelve [userCode] — 1 parámetro
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BooleanLiteral
auth/domain/authDomain.js:51:9
  */
 class AuthAggregate {
   constructor({ userCodeVO, passwordVO } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
+    if (userCodeVO instanceof UserCodeValueObject) {
       throw new DomainError('userCodeVO inválido');
     }
killedBy: AuthAggregate construcción válida construye con VOs válidos
statusReason: userCodeVO inválido

[Killed] ConditionalExpression
auth/domain/authDomain.js:51:9
  */
 class AuthAggregate {
   constructor({ userCodeVO, passwordVO } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
+    if (true) {
       throw new DomainError('userCodeVO inválido');
     }
killedBy: AuthAggregate construcción válida construye con VOs válidos
statusReason: userCodeVO inválido

[Killed] BooleanLiteral
auth/domain/authDomain.js:54:9
     if (!(userCodeVO instanceof UserCodeValueObject)) {
       throw new DomainError('userCodeVO inválido');
     }
-    if (!(passwordVO instanceof PasswordValueObject)) {
+    if (passwordVO instanceof PasswordValueObject) {
       throw new DomainError('passwordVO inválido');
     }
killedBy: AuthAggregate construcción válida construye con VOs válidos
statusReason: passwordVO inválido

[Killed] ConditionalExpression
auth/domain/authDomain.js:54:9
     if (!(userCodeVO instanceof UserCodeValueObject)) {
       throw new DomainError('userCodeVO inválido');
     }
-    if (!(passwordVO instanceof PasswordValueObject)) {
+    if (false) {
       throw new DomainError('passwordVO inválido');
     }
killedBy: AuthAggregate propagación de errores lanza DomainError si passwordVO no es instancia correcta
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
auth/domain/authDomain.js:55:29
       throw new DomainError('userCodeVO inválido');
     }
     if (!(passwordVO instanceof PasswordValueObject)) {
-      throw new DomainError('passwordVO inválido');
+      throw new DomainError("");
     }
     this._userCode = userCodeVO;

[Killed] BlockStatement
auth/domain/authDomain.js:66:23
    * Parámetros posicionales para la consulta de login (userCode)
    * @returns {Array}
    */
-  obtenerParametros() {
-    return [this._userCode.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: AuthAggregate obtenerParametros() — orden y valores exactos devuelve [userCode] — 1 parámetro
statusReason: expected undefined to deeply equal [ 'USR001' ]

[NoCoverage] BlockStatement
auth/domain/authDomain.js:85:46
    * @returns {Promise<Object|null>} Fila cruda del usuario o null si no existe.
    * @abstract
    */
-  async obtenerUsuarioPorUserCode(_agregado) {
-    throw new Error('IAuthRepository.obtenerUsuarioPorUserCode() no implementado');
-  }
+  async obtenerUsuarioPorUserCode(_agregado) {}
 }
 
