[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:8:24
   /**
    * @param {string} message Mensaje de error de dominio.
    */
-  constructor(message) {
-    super(message);
-    this.name = 'DomainError';
-    Object.freeze(this);
-  }
+  constructor(message) {}
 }
 
killedBy: DomainError es instancia de Error
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:22:22
   /**
    * @param {string} value UUID de historia clinica.
    */
-  constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('El identificador clinico debe ser un UUID valido');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!uuidV4Pattern.test(normalizedValue)) {
-      throw new DomainError('El identificador clinico debe ser un UUID valido');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:23:9
    * @param {string} value UUID de historia clinica.
    */
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (false) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
killedBy: IdHistoriaClinicaVO (antecedente) invariantes — lanza DomainError null → lanza (no es string)
statusReason: expected [Function] to throw error including 'El identificador clinico debe ser un …' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:23:9
    * @param {string} value UUID de historia clinica.
    */
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (false || value.trim().length === 0) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
killedBy: IdHistoriaClinicaVO (antecedente) invariantes — lanza DomainError null → lanza (no es string)
statusReason: expected [Function] to throw error including 'El identificador clinico debe ser un …' but got 'Cannot read properties of null (readi…'

[Killed] MethodExpression
antecedente/domain/antecedenteDomain.js:27:29
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
 
-    const normalizedValue = value.trim().toLowerCase();
+    const normalizedValue = value.trim().toUpperCase();
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: expected '550E8400-E29B-41D4-A716-446655440000' to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] MethodExpression
antecedente/domain/antecedenteDomain.js:27:29
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
 
-    const normalizedValue = value.trim().toLowerCase();
+    const normalizedValue = value.toLowerCase();
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz elimina espacios al inicio/final
statusReason: El identificador clinico debe ser un UUID valido

[Killed] Regex
antecedente/domain/antecedenteDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[^0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!uuidV4Pattern.test(normalizedValue)) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: El identificador clinico debe ser un UUID valido

[Killed] Regex
antecedente/domain/antecedenteDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!uuidV4Pattern.test(normalizedValue)) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: El identificador clinico debe ser un UUID valido

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:30:9
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!uuidV4Pattern.test(normalizedValue)) {
+    if (true) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: El identificador clinico debe ser un UUID valido

[Killed] BooleanLiteral
antecedente/domain/antecedenteDomain.js:30:9
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!uuidV4Pattern.test(normalizedValue)) {
+    if (uuidV4Pattern.test(normalizedValue)) {
       throw new DomainError('El identificador clinico debe ser un UUID valido');
     }
killedBy: IdHistoriaClinicaVO (antecedente) camino feliz acepta UUID v4 en minúsculas
statusReason: El identificador clinico debe ser un UUID valido

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:47:36
    * @param {number|string|null|undefined} value Valor de entrada.
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
-  constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const parsedValue = Number(value);
-    if (!Number.isInteger(parsedValue) || parsedValue < 0) {
-      throw new DomainError(mensajeError);
-    }
-
-    this.value = parsedValue;
-    Object.freeze(this);
-  }
+  constructor(value, mensajeError) {}
 }
 
killedBy: EnteroNoNegativoVO nulos y vacíos → null null → value === null
statusReason: expected undefined to be null

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:48:9
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if (true) {
       this.value = null;
       Object.freeze(this);
killedBy: EnteroNoNegativoVO valores límite (BVA) min-1 = -1 → lanza DomainError
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
antecedente/domain/antecedenteDomain.js:48:9
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null && value === undefined || value === '') {
       this.value = null;
       Object.freeze(this);
killedBy: EnteroNoNegativoVO nulos y vacíos → null null → value === null
statusReason: expected +0 to be null

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:55:43
     }
 
     const parsedValue = Number(value);
-    if (!Number.isInteger(parsedValue) || parsedValue < 0) {
+    if (!Number.isInteger(parsedValue) || false) {
       throw new DomainError(mensajeError);
     }
killedBy: EnteroNoNegativoVO valores límite (BVA) min-1 = -1 → lanza DomainError
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:55:60
     }
 
     const parsedValue = Number(value);
-    if (!Number.isInteger(parsedValue) || parsedValue < 0) {
-      throw new DomainError(mensajeError);
-    }
+    if (!Number.isInteger(parsedValue) || parsedValue < 0) {}
 
     this.value = parsedValue;
killedBy: EnteroNoNegativoVO valores límite (BVA) min-1 = -1 → lanza DomainError
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:72:36
    * @param {string|null|undefined} value Fecha de entrada.
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
-  constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const fecha = new Date(value);
-    if (Number.isNaN(fecha.getTime())) {
-      throw new DomainError(mensajeError);
-    }
-
-    this.value = fecha.toISOString();
-    Object.freeze(this);
-  }
+  constructor(value, mensajeError) {}
 }
 
killedBy: FechaClinicaVO (antecedente) nulos y vacíos → null null → value === null
statusReason: expected undefined to be null

[Killed] EqualityOperator
antecedente/domain/antecedenteDomain.js:73:50
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || value === undefined || value !== '') {
       this.value = null;
       Object.freeze(this);
killedBy: FechaClinicaVO (antecedente) nulos y vacíos → null '' → value === null
statusReason: La fecha de consentimiento no tiene un formato valido

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:73:27
    * @param {string} mensajeError Mensaje cuando no cumple la regla.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || false || value === '') {
       this.value = null;
       Object.freeze(this);
killedBy: FechaClinicaVO (antecedente) nulos y vacíos → null undefined → value === null
statusReason: La fecha de consentimiento no tiene un formato valido

[Killed] ConditionalExpression
antecedente/domain/antecedenteDomain.js:80:9
     }
 
     const fecha = new Date(value);
-    if (Number.isNaN(fecha.getTime())) {
+    if (true) {
       throw new DomainError(mensajeError);
     }
killedBy: FechaClinicaVO (antecedente) camino feliz acepta ISO 8601 y devuelve toISOString()
statusReason: La fecha de consentimiento no tiene un formato valido

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:80:40
     }
 
     const fecha = new Date(value);
-    if (Number.isNaN(fecha.getTime())) {
-      throw new DomainError(mensajeError);
-    }
+    if (Number.isNaN(fecha.getTime())) {}
 
     this.value = fecha.toISOString();
killedBy: FechaClinicaVO (antecedente) invariantes — lanza DomainError cadena inválida → lanza con el mensaje recibido
statusReason: expected [Function] to throw error including 'La fecha de consentimiento no tiene u…' but got 'Invalid time value'

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:89:39
   }
 }
 
-const normalizePrimitive = (value) => {
-  if (value === null || value === undefined || value === '') {
-    return null;
-  }
-  return value;
-};
+const normalizePrimitive = (value) => {};
 
 /**
killedBy: AntecedentePersonalAggregate obtenerParametros() — estructura todos los campos opcionales ausentes son null
statusReason: expected undefined to be null

[Killed] EqualityOperator
antecedente/domain/antecedenteDomain.js:90:25
 }
 
 const normalizePrimitive = (value) => {
-  if (value === null || value === undefined || value === '') {
+  if (value === null || value !== undefined || value === '') {
     return null;
   }
killedBy: AntecedentePersonalAggregate obtenerParametros() — estructura [8] = fuma, [9] = cigarrillos_dia en posición exacta
statusReason: expected null to be 'SI' // Object.is equality

[Killed] EqualityOperator
antecedente/domain/antecedenteDomain.js:90:48
 }
 
 const normalizePrimitive = (value) => {
-  if (value === null || value === undefined || value === '') {
+  if (value === null || value === undefined || value !== '') {
     return null;
   }
killedBy: AntecedentePersonalAggregate obtenerParametros() — estructura [8] = fuma, [9] = cigarrillos_dia en posición exacta
statusReason: expected null to be 'SI' // Object.is equality

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:219:20
     ];
   }
 
-  get idHistoria() {
-    return this.#idHistoria.value;
-  }
+  get idHistoria() {}
 }
 
killedBy: AntecedentePersonalAggregate construcción válida construye con solo id_historia (todos los campos opcionales)
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:332:57
 
   #descripcion;
 
-  constructor({ id_historia, descripcion = null } = {}) {
-    this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
-    this.#descripcion = normalizePrimitive(descripcion);
-    Object.freeze(this);
-  }
+  constructor({ id_historia, descripcion = null } = {}) {}
 
   obtenerParametros() {
killedBy: AntecedenteFamiliarAggregate construcción válida construye con id_historia y descripcion
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:338:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [this.#idHistoria.value, this.#descripcion];
-  }
+  obtenerParametros() {}
 
   get idHistoria() {
killedBy: AntecedenteFamiliarAggregate obtenerParametros() — orden exacto devuelve [id_historia, descripcion] exactamente
statusReason: expected undefined to deeply equal [ …(2) ]

[Killed] StringLiteral
antecedente/domain/antecedenteDomain.js:383:7
     );
     this.#frecuenciaLimpiezaMeses = new EnteroNoNegativoVO(
       frecuencia_limpieza_meses,
-      'La frecuencia de limpieza debe ser un entero no negativo'
+      ""
     );
     this.#fechaConsentimiento = new FechaClinicaVO(
killedBy: SeguimientoDelTratamientoAggregate EnteroNoNegativoVO — invariantes en frecuencias (BVA) frecuencia_limpieza_meses = -2 → lanza con mensaje de limpieza
statusReason: expected [Function] to throw error including 'La frecuencia de limpieza debe ser un…' but got ''

[Killed] StringLiteral
antecedente/domain/antecedenteDomain.js:387:7
     );
     this.#fechaConsentimiento = new FechaClinicaVO(
       fecha_consentimiento,
-      'La fecha de consentimiento no tiene un formato valido'
+      ""
     );
     this.#campos = Object.freeze({
killedBy: SeguimientoDelTratamientoAggregate FechaClinicaVO — invariante fecha_consentimiento fecha inválida → lanza con mensaje de consentimiento
statusReason: expected [Function] to throw error including 'La fecha de consentimiento no tiene u…' but got ''

[Killed] BlockStatement
antecedente/domain/antecedenteDomain.js:404:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [
-      this.#idHistoria.value,
-      this.#campos.motivoDolor,
-      this.#campos.motivoControl,
-      this.#frecuenciaControlMeses.value,
-      this.#campos.motivoLimpieza,
-      this.#frecuenciaLimpiezaMeses.value,
-      this.#campos.actitudTranquilo,
-      this.#campos.actitudAprensivo,
-      this.#campos.actitudPanico,
-      this.#campos.desagradoAtencion,
-      this.#fechaConsentimiento.value,
-      this.#campos.firmaNombre,
-      this.#campos.historiaElaboradaPor,
-    ];
-  }
+  obtenerParametros() {}
 
   get idHistoria() {
killedBy: SeguimientoDelTratamientoAggregate construcción válida construye con frecuencias y fecha válidas
statusReason: Cannot read properties of undefined (reading '3')

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:437:46
  */
 export class IAntecedenteRepository {
   /** @abstract @param {AntecedentePersonalAggregate} _agregado @returns {Promise<boolean>} */
-  async createAntecedentePersonal(_agregado) {
-    throw new Error('IAntecedenteRepository.createAntecedentePersonal() no implementado');
-  }
+  async createAntecedentePersonal(_agregado) {}
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
   async getAntecedentePersonalByHistoria(_idHistoria) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:441:55
     throw new Error('IAntecedenteRepository.createAntecedentePersonal() no implementado');
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
-  async getAntecedentePersonalByHistoria(_idHistoria) {
-    throw new Error('IAntecedenteRepository.getAntecedentePersonalByHistoria() no implementado');
-  }
+  async getAntecedentePersonalByHistoria(_idHistoria) {}
   /** @abstract @param {AntecedentePersonalAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedentePersonal(_agregado) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:445:46
     throw new Error('IAntecedenteRepository.getAntecedentePersonalByHistoria() no implementado');
   }
   /** @abstract @param {AntecedentePersonalAggregate} _agregado @returns {Promise<boolean>} */
-  async updateAntecedentePersonal(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedentePersonal() no implementado');
-  }
+  async updateAntecedentePersonal(_agregado) {}
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */
   async createAntecedenteMedico(_agregado) {

[NoCoverage] StringLiteral
antecedente/domain/antecedenteDomain.js:446:21
   }
   /** @abstract @param {AntecedentePersonalAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedentePersonal(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedentePersonal() no implementado');
+    throw new Error("");
   }
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:449:44
     throw new Error('IAntecedenteRepository.updateAntecedentePersonal() no implementado');
   }
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */
-  async createAntecedenteMedico(_agregado) {
-    throw new Error('IAntecedenteRepository.createAntecedenteMedico() no implementado');
-  }
+  async createAntecedenteMedico(_agregado) {}
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
   async getAntecedenteMedicoByHistoria(_idHistoria) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:453:53
     throw new Error('IAntecedenteRepository.createAntecedenteMedico() no implementado');
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
-  async getAntecedenteMedicoByHistoria(_idHistoria) {
-    throw new Error('IAntecedenteRepository.getAntecedenteMedicoByHistoria() no implementado');
-  }
+  async getAntecedenteMedicoByHistoria(_idHistoria) {}
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedenteMedico(_agregado) {

[NoCoverage] StringLiteral
antecedente/domain/antecedenteDomain.js:454:21
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
   async getAntecedenteMedicoByHistoria(_idHistoria) {
-    throw new Error('IAntecedenteRepository.getAntecedenteMedicoByHistoria() no implementado');
+    throw new Error("");
   }
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:457:44
     throw new Error('IAntecedenteRepository.getAntecedenteMedicoByHistoria() no implementado');
   }
   /** @abstract @param {AntecedenteMedicoAggregate} _agregado @returns {Promise<boolean>} */
-  async updateAntecedenteMedico(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedenteMedico() no implementado');
-  }
+  async updateAntecedenteMedico(_agregado) {}
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
   async createAntecedenteFamiliar(_agregado) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:461:46
     throw new Error('IAntecedenteRepository.updateAntecedenteMedico() no implementado');
   }
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
-  async createAntecedenteFamiliar(_agregado) {
-    throw new Error('IAntecedenteRepository.createAntecedenteFamiliar() no implementado');
-  }
+  async createAntecedenteFamiliar(_agregado) {}
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
   async getAntecedenteFamiliarByHistoria(_idHistoria) {

[NoCoverage] StringLiteral
antecedente/domain/antecedenteDomain.js:462:21
   }
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
   async createAntecedenteFamiliar(_agregado) {
-    throw new Error('IAntecedenteRepository.createAntecedenteFamiliar() no implementado');
+    throw new Error("");
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:465:55
     throw new Error('IAntecedenteRepository.createAntecedenteFamiliar() no implementado');
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
-  async getAntecedenteFamiliarByHistoria(_idHistoria) {
-    throw new Error('IAntecedenteRepository.getAntecedenteFamiliarByHistoria() no implementado');
-  }
+  async getAntecedenteFamiliarByHistoria(_idHistoria) {}
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedenteFamiliar(_agregado) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:469:46
     throw new Error('IAntecedenteRepository.getAntecedenteFamiliarByHistoria() no implementado');
   }
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
-  async updateAntecedenteFamiliar(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedenteFamiliar() no implementado');
-  }
+  async updateAntecedenteFamiliar(_agregado) {}
   /** @abstract @param {SeguimientoDelTratamientoAggregate} _agregado @returns {Promise<boolean>} */
   async createAntecedenteCumplimiento(_agregado) {

[NoCoverage] StringLiteral
antecedente/domain/antecedenteDomain.js:470:21
   }
   /** @abstract @param {AntecedenteFamiliarAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedenteFamiliar(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedenteFamiliar() no implementado');
+    throw new Error("");
   }
   /** @abstract @param {SeguimientoDelTratamientoAggregate} _agregado @returns {Promise<boolean>} */

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:473:50
     throw new Error('IAntecedenteRepository.updateAntecedenteFamiliar() no implementado');
   }
   /** @abstract @param {SeguimientoDelTratamientoAggregate} _agregado @returns {Promise<boolean>} */
-  async createAntecedenteCumplimiento(_agregado) {
-    throw new Error('IAntecedenteRepository.createAntecedenteCumplimiento() no implementado');
-  }
+  async createAntecedenteCumplimiento(_agregado) {}
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
   async getAntecedenteCumplimientoByHistoria(_idHistoria) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:477:59
     throw new Error('IAntecedenteRepository.createAntecedenteCumplimiento() no implementado');
   }
   /** @abstract @param {string} _idHistoria @returns {Promise<Object|undefined>} */
-  async getAntecedenteCumplimientoByHistoria(_idHistoria) {
-    throw new Error('IAntecedenteRepository.getAntecedenteCumplimientoByHistoria() no implementado');
-  }
+  async getAntecedenteCumplimientoByHistoria(_idHistoria) {}
   /** @abstract @param {SeguimientoDelTratamientoAggregate} _agregado @returns {Promise<boolean>} */
   async updateAntecedenteCumplimiento(_agregado) {

[NoCoverage] BlockStatement
antecedente/domain/antecedenteDomain.js:481:50
     throw new Error('IAntecedenteRepository.getAntecedenteCumplimientoByHistoria() no implementado');
   }
   /** @abstract @param {SeguimientoDelTratamientoAggregate} _agregado @returns {Promise<boolean>} */
-  async updateAntecedenteCumplimiento(_agregado) {
-    throw new Error('IAntecedenteRepository.updateAntecedenteCumplimiento() no implementado');
-  }
+  async updateAntecedenteCumplimiento(_agregado) {}
 }
 
