[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:2:24
 class DomainError extends Error {
-  constructor(message) {
-    super(message);
-    this.name = 'DomainError';
-  }
+  constructor(message) {}
 }
 
killedBy: DomainError es instancia de Error
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] Regex
derivacionClinicas/domain/derivacionClinicasDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][^0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] Regex
derivacionClinicas/domain/derivacionClinicasDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[^0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:11:28
 const UUID_V4_REGEX =
   /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-function stripHCPrefix(id) {
-  if (!id) {
-    return id;
-  }
-  return id.startsWith('HC-') ? id.slice(3) : id;
-}
+function stripHCPrefix(id) {}
 
 class IdHistoriaValueObject {
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:12:7
   /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
-  if (!id) {
+  if (true) {
     return id;
   }
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: id_historia inválido

[Killed] BooleanLiteral
derivacionClinicas/domain/derivacionClinicasDomain.js:12:7
   /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
-  if (!id) {
+  if (id) {
     return id;
   }
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: id_historia inválido

[Killed] MethodExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:15:33
   if (!id) {
     return id;
   }
-  return id.startsWith('HC-') ? id.slice(3) : id;
+  return id.startsWith('HC-') ? id : id;
 }
 
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: id_historia inválido

[Killed] MethodExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:15:10
   if (!id) {
     return id;
   }
-  return id.startsWith('HC-') ? id.slice(3) : id;
+  return id.endsWith('HC-') ? id.slice(3) : id;
 }
 
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: id_historia inválido

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:19:22
 }
 
 class IdHistoriaValueObject {
-  constructor(value) {
-    const normalized = stripHCPrefix(String(value || '')).trim();
-    if (!normalized) {
-      throw new DomainError('id_historia es requerido');
-    }
-    if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('id_historia inválido');
-    }
-    this.value = normalized;
-  }
+  constructor(value) {}
   toString() {
     return this.value;
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:20:45
 
 class IdHistoriaValueObject {
   constructor(value) {
-    const normalized = stripHCPrefix(String(value || '')).trim();
+    const normalized = stripHCPrefix(String(false)).trim();
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:20:45
 
 class IdHistoriaValueObject {
   constructor(value) {
-    const normalized = stripHCPrefix(String(value || '')).trim();
+    const normalized = stripHCPrefix(String(true)).trim();
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:21:9
 class IdHistoriaValueObject {
   constructor(value) {
     const normalized = stripHCPrefix(String(value || '')).trim();
-    if (!normalized) {
+    if (false) {
       throw new DomainError('id_historia es requerido');
     }
killedBy: IdHistoriaValueObject (derivacion) — mensajes exactos (mata StringLiteral) idHistory nulo → mensaje "id_historia es requerido"
statusReason: expected [Function] to throw error including 'id_historia es requerido' but got 'id_historia inválido'

[Killed] BooleanLiteral
derivacionClinicas/domain/derivacionClinicasDomain.js:21:9
 class IdHistoriaValueObject {
   constructor(value) {
     const normalized = stripHCPrefix(String(value || '')).trim();
-    if (!normalized) {
+    if (normalized) {
       throw new DomainError('id_historia es requerido');
     }
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia es requerido

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:24:9
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
     }
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (false) {
       throw new DomainError('id_historia inválido');
     }
killedBy: DerivacionClinicasAggregate invariantes — lanza DomainError idHistory inválido → lanza
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:24:9
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
     }
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (true) {
       throw new DomainError('id_historia inválido');
     }
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:29:14
     }
     this.value = normalized;
   }
-  toString() {
-    return this.value;
-  }
+  toString() {}
 }
 
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:35:22
 }
 
 class IdUsuarioValueObject {
-  constructor(value) {
-    if (!value) {
-      throw new DomainError('idUsuario es requerido');
-    }
-    const normalized = String(value).trim();
-    if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('idUsuario inválido');
-    }
-    this.value = normalized;
-  }
+  constructor(value) {}
   toString() {
     return this.value;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected undefined to be '660f9500-f39c-41d4-b827-557766551111' // Object.is equality

[Killed] BooleanLiteral
derivacionClinicas/domain/derivacionClinicasDomain.js:36:9
 
 class IdUsuarioValueObject {
   constructor(value) {
-    if (!value) {
+    if (value) {
       throw new DomainError('idUsuario es requerido');
     }
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: idUsuario es requerido

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:36:9
 
 class IdUsuarioValueObject {
   constructor(value) {
-    if (!value) {
+    if (true) {
       throw new DomainError('idUsuario es requerido');
     }
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: idUsuario es requerido

[Survived] MethodExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:39:24
     if (!value) {
       throw new DomainError('idUsuario es requerido');
     }
-    const normalized = String(value).trim();
+    const normalized = String(value);
     if (!UUID_V4_REGEX.test(normalized)) {
       throw new DomainError('idUsuario inválido');

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:40:42
       throw new DomainError('idUsuario es requerido');
     }
     const normalized = String(value).trim();
-    if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('idUsuario inválido');
-    }
+    if (!UUID_V4_REGEX.test(normalized)) {}
     this.value = normalized;
   }
killedBy: DerivacionClinicasAggregate invariantes — lanza DomainError idUsuario formato inválido → lanza
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:40:9
       throw new DomainError('idUsuario es requerido');
     }
     const normalized = String(value).trim();
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (true) {
       throw new DomainError('idUsuario inválido');
     }
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: idUsuario inválido

[Killed] StringLiteral
derivacionClinicas/domain/derivacionClinicasDomain.js:41:29
     }
     const normalized = String(value).trim();
     if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('idUsuario inválido');
+      throw new DomainError("");
     }
     this.value = normalized;
killedBy: IdHistoriaValueObject (derivacion) — mensajes exactos (mata StringLiteral) idUsuario formato incorrecto → mensaje "idUsuario inválido"
statusReason: expected [Function] to throw error including 'idUsuario inválido' but got ''

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:51:22
 }
 
 class DestinosValueObject {
-  constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = {};
-      return;
-    }
-    if (typeof value === 'string') {
-      try {
-        this.value = JSON.parse(value);
-        return;
-      } catch (e) {
-        throw new DomainError('destinos inválidos');
-      }
-    }
-    if (typeof value === 'object') {
-      this.value = value;
-      return;
-    }
-    throw new DomainError('destinos inválidos');
-  }
+  constructor(value) {}
   toJSON() {
     return this.value;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: "undefined" is not valid JSON

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:52:64
 
 class DestinosValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = {};
-      return;
-    }
+    if (value === null || value === undefined || value === '') {}
     if (typeof value === 'string') {
       try {
killedBy: DerivacionClinicasAggregate construcción válida construye con destinos cadena vacía (→ {})
statusReason: destinos inválidos

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:52:9
 
 class DestinosValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value !== null || value === undefined || value === '') {
       this.value = {};
       return;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected {} to deeply equal { cirugia: true, periodoncia: false }

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:56:36
       this.value = {};
       return;
     }
-    if (typeof value === 'string') {
-      try {
-        this.value = JSON.parse(value);
-        return;
-      } catch (e) {
-        throw new DomainError('destinos inválidos');
-      }
-    }
+    if (typeof value === 'string') {}
     if (typeof value === 'object') {
       this.value = value;
killedBy: DerivacionClinicasAggregate construcción válida construye con destinos como string JSON
statusReason: destinos inválidos

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:56:9
       this.value = {};
       return;
     }
-    if (typeof value === 'string') {
+    if (false) {
       try {
         this.value = JSON.parse(value);
killedBy: DerivacionClinicasAggregate construcción válida construye con destinos como string JSON
statusReason: destinos inválidos

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:57:11
       return;
     }
     if (typeof value === 'string') {
-      try {
-        this.value = JSON.parse(value);
-        return;
-      } catch (e) {
+      try {} catch (e) {
         throw new DomainError('destinos inválidos');
       }
killedBy: DerivacionClinicasAggregate construcción válida construye con destinos como string JSON
statusReason: destinos inválidos

[Survived] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:60:19
       try {
         this.value = JSON.parse(value);
         return;
-      } catch (e) {
-        throw new DomainError('destinos inválidos');
-      }
+      } catch (e) {}
     }
     if (typeof value === 'object') {

[Killed] StringLiteral
derivacionClinicas/domain/derivacionClinicasDomain.js:61:31
         this.value = JSON.parse(value);
         return;
       } catch (e) {
-        throw new DomainError('destinos inválidos');
+        throw new DomainError("");
       }
     }
killedBy: DerivacionClinicasAggregate DestinosValueObject — validaciones de JSON string JSON inválido → lanza "destinos inválidos"
statusReason: expected [Function] to throw error including 'destinos inválidos' but got ''

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:64:9
         throw new DomainError('destinos inválidos');
       }
     }
-    if (typeof value === 'object') {
+    if (false) {
       this.value = value;
       return;
killedBy: DerivacionClinicasAggregate construcción válida construye con todos los campos
statusReason: destinos inválidos

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:64:9
         throw new DomainError('destinos inválidos');
       }
     }
-    if (typeof value === 'object') {
+    if (typeof value !== 'object') {
       this.value = value;
       return;
killedBy: DerivacionClinicasController.actualizarDerivacionClinicas returns 200 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:70:12
     }
     throw new DomainError('destinos inválidos');
   }
-  toJSON() {
-    return this.value;
-  }
+  toJSON() {}
 }
 
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: "undefined" is not valid JSON

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:76:22
 }
 
 class TextoValueObject {
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      return;
-    }
-    const normalized = String(value).trim();
-    this.value = normalized === '' ? null : normalized;
-  }
+  constructor(value) {}
   toString() {
     return this.value;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:77:9
 
 class TextoValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (false) {
       this.value = null;
       return;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos observaciones null produce null en params[2]
statusReason: expected 'null' to be null

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:77:9
 
 class TextoValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (false || value === undefined) {
       this.value = null;
       return;
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos observaciones null produce null en params[2]
statusReason: expected 'null' to be null

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:82:18
       return;
     }
     const normalized = String(value).trim();
-    this.value = normalized === '' ? null : normalized;
+    this.value = normalized !== '' ? null : normalized;
   }
   toString() {
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:82:18
       return;
     }
     const normalized = String(value).trim();
-    this.value = normalized === '' ? null : normalized;
+    this.value = true ? null : normalized;
   }
   toString() {
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:124:30
         : new IdUsuarioValueObject(idUsuario);
   }
 
-  _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
-      return null;
-    }
-    if (typeof value === 'object') {
-      return value;
-    }
-    const s = String(value).trim();
-    return s === '' ? null : s;
-  }
+  _normalizePrimitive(value) {}
 
   obtenerParametros() {
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected undefined to be 'Derivar con urgencia' // Object.is equality

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:125:27
   }
 
   _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
+    if (value === null || value !== undefined) {
       return null;
     }
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:125:9
   }
 
   _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
+    if (value !== null || value === undefined) {
       return null;
     }
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Survived] MethodExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:131:15
     if (typeof value === 'object') {
       return value;
     }
-    const s = String(value).trim();
+    const s = String(value);
     return s === '' ? null : s;
   }

[Killed] ConditionalExpression
derivacionClinicas/domain/derivacionClinicasDomain.js:132:12
       return value;
     }
     const s = String(value).trim();
-    return s === '' ? null : s;
+    return true ? null : s;
   }
 
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] EqualityOperator
derivacionClinicas/domain/derivacionClinicasDomain.js:132:12
       return value;
     }
     const s = String(value).trim();
-    return s === '' ? null : s;
+    return s !== '' ? null : s;
   }
 
killedBy: DerivacionClinicasAggregate obtenerParametros() — orden y valores exactos devuelve 6 parámetros: [idHistory, destinos_json, observaciones, alumno, docente, idUsuario]
statusReason: expected null to be 'Derivar con urgencia' // Object.is equality

[Killed] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:135:23
     return s === '' ? null : s;
   }
 
-  obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      JSON.stringify(this._destinos.toJSON()),
-      this._normalizePrimitive(this._observaciones.value),
-      this._normalizePrimitive(this._alumno.value),
-      this._normalizePrimitive(this._docente.value),
-      this._idUsuario.toString(),
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: DerivacionClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading '0')

[NoCoverage] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:161:42
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async consultarPorHistoria(_idHistory) {
-    throw new Error('IDerivacionClinicasRepository.consultarPorHistoria() no implementado');
-  }
+  async consultarPorHistoria(_idHistory) {}
 
   /**

[NoCoverage] BlockStatement
derivacionClinicas/domain/derivacionClinicasDomain.js:171:49
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async actualizarDerivacionClinicas(_agregado) {
-    throw new Error('IDerivacionClinicasRepository.actualizarDerivacionClinicas() no implementado');
-  }
+  async actualizarDerivacionClinicas(_agregado) {}
 }
 
