[Killed] ArrayDeclaration
catalogo/domain/catalogoDomain.js:18:34
  * Allowed catalog table names (explicit whitelist).
  * Keep in sync with DB schema to avoid SQL injection risk.
  */
-const ALLOWED_CATALOGS = new Set([
-  'catalogo_estado_civil',
-  'catalogo_grado_instruccion',
-  'catalogo_ocupacion',
-  'catalogo_grupo_sanguineo',
-  'catalogo_sexo',
-  'catalogo_enfermedad',
-  'catalogo_habito',
-  'catalogo_examen_auxiliar',
-  'catalogo_clinica',
-  'catalogo_estado_revision',
-  'catalogo_posicion',
-  'catalogo_medida_regional',
-  'catalogo_atm_trayectoria',
-  'catalogo_dolor_grado',
-  'catalogo_movimiento_mandibular',
-]);
+const ALLOWED_CATALOGS = new Set([]);
 
 /**
killedBy: CatalogoController.listarOpcionesCatalogoClinico returns 200 with rows on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] StringLiteral
catalogo/domain/catalogoDomain.js:20:3
  */
 const ALLOWED_CATALOGS = new Set([
   'catalogo_estado_civil',
-  'catalogo_grado_instruccion',
+  "",
   'catalogo_ocupacion',
   'catalogo_grupo_sanguineo',
killedBy: CatalogNameValueObject camino feliz — nombres permitidos acepta "catalogo_grado_instruccion"
statusReason: catalog name not allowed

[Killed] StringLiteral
catalogo/domain/catalogoDomain.js:26:3
   'catalogo_sexo',
   'catalogo_enfermedad',
   'catalogo_habito',
-  'catalogo_examen_auxiliar',
+  "",
   'catalogo_clinica',
   'catalogo_estado_revision',
killedBy: CatalogNameValueObject camino feliz — nombres permitidos acepta "catalogo_examen_auxiliar"
statusReason: catalog name not allowed

[Killed] StringLiteral
catalogo/domain/catalogoDomain.js:29:3
   'catalogo_examen_auxiliar',
   'catalogo_clinica',
   'catalogo_estado_revision',
-  'catalogo_posicion',
+  "",
   'catalogo_medida_regional',
   'catalogo_atm_trayectoria',
killedBy: CatalogNameValueObject camino feliz — nombres permitidos acepta "catalogo_posicion"
statusReason: catalog name not allowed

[Killed] StringLiteral
catalogo/domain/catalogoDomain.js:33:3
   'catalogo_medida_regional',
   'catalogo_atm_trayectoria',
   'catalogo_dolor_grado',
-  'catalogo_movimiento_mandibular',
+  "",
 ]);
 
killedBy: CatalogNameValueObject camino feliz — nombres permitidos acepta "catalogo_movimiento_mandibular"
statusReason: catalog name not allowed

[Killed] BlockStatement
catalogo/domain/catalogoDomain.js:41:22
  * @class CatalogNameValueObject
  */
 class CatalogNameValueObject {
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('catalog name must be a string');
-    }
-    const s = value.trim();
-    if (!ALLOWED_CATALOGS.has(s)) {
-      throw new DomainError('catalog name not allowed');
-    }
-    this.value = s;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: CatalogoController.listarOpcionesCatalogoClinico returns 400 on DomainError (invalid catalog name)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] MethodExpression
catalogo/domain/catalogoDomain.js:45:15
     if (typeof value !== 'string') {
       throw new DomainError('catalog name must be a string');
     }
-    const s = value.trim();
+    const s = value;
     if (!ALLOWED_CATALOGS.has(s)) {
       throw new DomainError('catalog name not allowed');
killedBy: CatalogNameValueObject camino feliz — nombres permitidos trimea espacios al inicio y al final
statusReason: catalog name not allowed

[Killed] ConditionalExpression
catalogo/domain/catalogoDomain.js:46:9
       throw new DomainError('catalog name must be a string');
     }
     const s = value.trim();
-    if (!ALLOWED_CATALOGS.has(s)) {
+    if (true) {
       throw new DomainError('catalog name not allowed');
     }
killedBy: CatalogoController.listarOpcionesCatalogoClinico returns 200 with rows on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] ConditionalExpression
catalogo/domain/catalogoDomain.js:46:9
       throw new DomainError('catalog name must be a string');
     }
     const s = value.trim();
-    if (!ALLOWED_CATALOGS.has(s)) {
+    if (false) {
       throw new DomainError('catalog name not allowed');
     }
killedBy: CatalogoController.listarOpcionesCatalogoClinico returns 400 on DomainError (invalid catalog name)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] BlockStatement
catalogo/domain/catalogoDomain.js:58:22
  * IdPositive Value Object — ensures a positive integer id.
  */
 class IdPositiveValueObject {
-  constructor(value) {
-    const n = Number(value);
-    if (!Number.isInteger(n) || n <= 0) {
-      throw new DomainError('id must be a positive integer');
-    }
-    this.value = n;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdPositiveValueObject camino feliz acepta entero positivo
statusReason: expected undefined to be 1 // Object.is equality

[Killed] ConditionalExpression
catalogo/domain/catalogoDomain.js:60:9
 class IdPositiveValueObject {
   constructor(value) {
     const n = Number(value);
-    if (!Number.isInteger(n) || n <= 0) {
+    if (false) {
       throw new DomainError('id must be a positive integer');
     }
killedBy: IdPositiveValueObject invariantes — lanza DomainError — BVA 0 → lanza "id must be a positive integer"
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
catalogo/domain/catalogoDomain.js:60:9
 class IdPositiveValueObject {
   constructor(value) {
     const n = Number(value);
-    if (!Number.isInteger(n) || n <= 0) {
+    if (true) {
       throw new DomainError('id must be a positive integer');
     }
killedBy: CatalogoController.obtenerNombreOpcionCatalogoClinico returns 200 with nombre on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
catalogo/domain/catalogoDomain.js:72:39
  * Aggregate root for catalog operations. Holds validated VOs.
  */
 class CatalogoAggregate {
-  constructor({ catalogNameVO } = {}) {
-    if (!(catalogNameVO instanceof CatalogNameValueObject)) {
-      throw new DomainError(
-        'catalogNameVO is required and must be a CatalogNameValueObject'
-      );
-    }
-    this._catalogName = catalogNameVO;
-    Object.freeze(this);
-  }
+  constructor({ catalogNameVO } = {}) {}
 
   /**
killedBy: CatalogoAggregate obtenerParametros() — orden y valores exactos devuelve [catalogName] — 1 parámetro
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
catalogo/domain/catalogoDomain.js:73:9
  */
 class CatalogoAggregate {
   constructor({ catalogNameVO } = {}) {
-    if (!(catalogNameVO instanceof CatalogNameValueObject)) {
+    if (true) {
       throw new DomainError(
         'catalogNameVO is required and must be a CatalogNameValueObject'
killedBy: CatalogoController.listarOpcionesCatalogoClinico returns 200 with rows on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
catalogo/domain/catalogoDomain.js:73:61
  */
 class CatalogoAggregate {
   constructor({ catalogNameVO } = {}) {
-    if (!(catalogNameVO instanceof CatalogNameValueObject)) {
-      throw new DomainError(
-        'catalogNameVO is required and must be a CatalogNameValueObject'
-      );
-    }
+    if (!(catalogNameVO instanceof CatalogNameValueObject)) {}
     this._catalogName = catalogNameVO;
     Object.freeze(this);
killedBy: CatalogoAggregate propagación de errores lanza DomainError si catalogNameVO no es instancia de CatalogNameValueObject
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
catalogo/domain/catalogoDomain.js:86:23
    * Positional parameters for repository calls that expect [catalogName]
    * @returns {Array}
    */
-  obtenerParametros() {
-    return [this._catalogName.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: CatalogoAggregate obtenerParametros() — orden y valores exactos devuelve [catalogName] — 1 parámetro
statusReason: expected undefined to deeply equal [ 'catalogo_sexo' ]

[Killed] ArrayDeclaration
catalogo/domain/catalogoDomain.js:87:12
    * @returns {Array}
    */
   obtenerParametros() {
-    return [this._catalogName.value];
+    return [];
   }
 }
killedBy: CatalogoAggregate obtenerParametros() — orden y valores exactos devuelve [catalogName] — 1 parámetro
statusReason: expected [] to deeply equal [ 'catalogo_sexo' ]

[NoCoverage] BlockStatement
catalogo/domain/catalogoDomain.js:105:28
    * @returns {Promise<Array>}
    * @abstract
    */
-  async listar(_aggregate) {
-    throw new Error('ICatalogoRepository.listar() no implementado');
-  }
+  async listar(_aggregate) {}
 
   /**

[NoCoverage] BlockStatement
catalogo/domain/catalogoDomain.js:116:42
    * @returns {Promise<string|null>}
    * @abstract
    */
-  async obtenerNombre(_aggregate, _idVO) {
-    throw new Error('ICatalogoRepository.obtenerNombre() no implementado');
-  }
+  async obtenerNombre(_aggregate, _idVO) {}
 }
 
