[Killed] StringLiteral
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:4:17
 class DomainError extends Error {
   constructor(message) {
     super(message);
-    this.name = 'DomainError';
+    this.name = "";
   }
 }
killedBy: DomainError name === "DomainError"
statusReason: expected '' to be 'DomainError' // Object.is equality

[Killed] Regex
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]$/i;
 function stripHCPrefix(id) {
   if (!id) {
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] Regex
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[^0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 function stripHCPrefix(id) {
   if (!id) {
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:10:28
 
 const UUID_V4_REGEX =
   /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-function stripHCPrefix(id) {
-  if (!id) {
-    return id;
-  }
-  return id.startsWith('HC-') ? id.slice(3) : id;
-}
+function stripHCPrefix(id) {}
 
 class IdHistoriaValueObject {
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] LogicalOperator
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:19:45
 
 class IdHistoriaValueObject {
   constructor(value) {
-    const normalized = stripHCPrefix(String(value || '')).trim();
+    const normalized = stripHCPrefix(String(value && '')).trim();
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia es requerido

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:20:9
 class IdHistoriaValueObject {
   constructor(value) {
     const normalized = stripHCPrefix(String(value || '')).trim();
-    if (!normalized) {
+    if (true) {
       throw new DomainError('id_historia es requerido');
     }
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: id_historia es requerido

[Killed] BooleanLiteral
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:23:9
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
     }
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (UUID_V4_REGEX.test(normalized)) {
       throw new DomainError('id_historia inválido');
     }
killedBy: DiagnosticoClinicasController.actualizarDiagnosticoClinico returns 200 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BooleanLiteral
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:39:9
       throw new DomainError('idUsuario es requerido');
     }
     const normalized = String(value).trim();
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (UUID_V4_REGEX.test(normalized)) {
       throw new DomainError('idUsuario inválido');
     }
killedBy: DiagnosticoClinicasController.actualizarDiagnosticoClinico returns 200 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:50:22
 }
 
 class FechaValueObject {
-  constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      return;
-    }
-    const d = new Date(value);
-    if (Number.isNaN(d.getTime())) {
-      throw new DomainError('fecha inválida');
-    }
-    this.value = d.toISOString().slice(0, 10);
-  }
+  constructor(value) {}
 }
 
killedBy: DiagnosticoClinicasAggregate obtenerParametros() — orden y valores exactos params[1] es fechaRespuesta normalizada a YYYY-MM-DD
statusReason: expected undefined to be '2024-06-01' // Object.is equality

[Killed] LogicalOperator
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:51:9
 
 class FechaValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if ((value === null || value === undefined) && value === '') {
       this.value = null;
       return;
killedBy: DiagnosticoClinicasAggregate construcción válida construye con data vacía (todos null)
statusReason: fecha inválida

[Killed] EqualityOperator
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:51:27
 
 class FechaValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || value !== undefined || value === '') {
       this.value = null;
       return;
killedBy: DiagnosticoClinicasController.actualizarDiagnosticoClinico returns 200 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:56:9
       return;
     }
     const d = new Date(value);
-    if (Number.isNaN(d.getTime())) {
+    if (true) {
       throw new DomainError('fecha inválida');
     }
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: fecha inválida

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:56:9
       return;
     }
     const d = new Date(value);
-    if (Number.isNaN(d.getTime())) {
+    if (false) {
       throw new DomainError('fecha inválida');
     }
killedBy: DiagnosticoClinicasAggregate FechaValueObject — validaciones fecha inválida en fechaRespuesta → lanza "fecha inválida"
statusReason: expected [Function] to throw error including 'fecha inválida' but got 'Invalid time value'

[Killed] MethodExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:59:18
     if (Number.isNaN(d.getTime())) {
       throw new DomainError('fecha inválida');
     }
-    this.value = d.toISOString().slice(0, 10);
+    this.value = d.toISOString();
   }
 }
killedBy: DiagnosticoClinicasAggregate obtenerParametros() — orden y valores exactos params[1] es fechaRespuesta normalizada a YYYY-MM-DD
statusReason: expected '2024-06-01T00:00:00.000Z' to be '2024-06-01' // Object.is equality

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:70:18
       return;
     }
     const normalized = String(value).trim();
-    this.value = normalized === '' ? null : normalized;
+    this.value = false ? null : normalized;
   }
 }
killedBy: DiagnosticoClinicasAggregate obtenerParametros() — orden y valores exactos campos de texto vacíos producen null
statusReason: expected '' to be null

[Killed] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:75:22
 }
 
 class JSONValueObject {
-  constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = {};
-      return;
-    }
-    if (typeof value === 'string') {
-      try {
-        this.value = JSON.parse(value);
-        return;
-      } catch (e) {
-        throw new DomainError('JSON inválido');
-      }
-    }
-    if (typeof value === 'object') {
-      this.value = value;
-      return;
-    }
-    throw new DomainError('JSON inválido');
-  }
+  constructor(value) {}
   toJSON() {
     return this.value;
killedBy: DiagnosticoClinicasAggregate obtenerParametros() — orden y valores exactos params[4] es examenes serializado como string JSON
statusReason: expected 'undefined' to be 'string' // Object.is equality

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:76:27
 
 class JSONValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || false || value === '') {
       this.value = {};
       return;
killedBy: DiagnosticoClinicasAggregate construcción válida construye con data vacía (todos null)
statusReason: JSON inválido

[Killed] ConditionalExpression
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:76:9
 
 class JSONValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if (false) {
       this.value = {};
       return;
killedBy: DiagnosticoClinicasAggregate construcción válida construye con data vacía (todos null)
statusReason: JSON inválido

[Killed] EqualityOperator
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:80:9
       this.value = {};
       return;
     }
-    if (typeof value === 'string') {
+    if (typeof value !== 'string') {
       try {
         this.value = JSON.parse(value);
killedBy: DiagnosticoClinicasAggregate construcción válida construye con todos los campos
statusReason: JSON inválido

[Survived] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:84:19
       try {
         this.value = JSON.parse(value);
         return;
-      } catch (e) {
-        throw new DomainError('JSON inválido');
-      }
+      } catch (e) {}
     }
     if (typeof value === 'object') {

[Killed] StringLiteral
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:92:27
       this.value = value;
       return;
     }
-    throw new DomainError('JSON inválido');
+    throw new DomainError("");
   }
   toJSON() {
killedBy: DiagnosticoClinicasAggregate JSONValueObject — validaciones de examenes examenes como número → lanza "JSON inválido"
statusReason: expected [Function] to throw error including 'JSON inválido' but got ''

[Killed] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:154:23
         ? idUsuario
         : new IdUsuarioValueObject(idUsuario);
   }
-  obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      this._fechaRespuesta.value,
-      this._clinicaRespuesta.value,
-      this._descripcionRespuesta.value,
-      JSON.stringify(this._examenes.toJSON()),
-      this._interconsultaTipo.value,
-      this._interconsultaFecha.value,
-      this._interconsultaClinica.value,
-      this._diagnosticoDefinitivo.value,
-      this._tratamiento.value,
-      this._pronostico.value,
-      this._alumnoTratante.value,
-      this._idUsuario.toString(),
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: DiagnosticoClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:155:12
         : new IdUsuarioValueObject(idUsuario);
   }
   obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      this._fechaRespuesta.value,
-      this._clinicaRespuesta.value,
-      this._descripcionRespuesta.value,
-      JSON.stringify(this._examenes.toJSON()),
-      this._interconsultaTipo.value,
-      this._interconsultaFecha.value,
-      this._interconsultaClinica.value,
-      this._diagnosticoDefinitivo.value,
-      this._tratamiento.value,
-      this._pronostico.value,
-      this._alumnoTratante.value,
-      this._idUsuario.toString(),
-    ];
+    return [];
   }
 }
killedBy: DiagnosticoClinicasAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[NoCoverage] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:187:42
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async consultarPorHistoria(_idHistory) {
-    throw new Error('IDiagnosticoClinicasRepository.consultarPorHistoria() no implementado');
-  }
+  async consultarPorHistoria(_idHistory) {}
 
   /**

[NoCoverage] StringLiteral
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:188:21
    * @abstract
    */
   async consultarPorHistoria(_idHistory) {
-    throw new Error('IDiagnosticoClinicasRepository.consultarPorHistoria() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
diagnosticoClinicas/domain/diagnosticoClinicasDomain.js:197:50
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async actualizarDiagnosticoClinicas(_agregado) {
-    throw new Error('IDiagnosticoClinicasRepository.actualizarDiagnosticoClinicas() no implementado');
-  }
+  async actualizarDiagnosticoClinicas(_agregado) {}
 }
 
