[Killed] Regex
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[0-9a-f]-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
killedBy: DiagnosticoPresuntivoAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] Regex
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:9:3
 }
 
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[^89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 function stripHCPrefix(id) {
killedBy: DiagnosticoPresuntivoAggregate construcción válida construye con todos los campos
statusReason: id_historia inválido

[Killed] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:24:42
     if (!normalized) {
       throw new DomainError('id_historia es requerido');
     }
-    if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('id_historia inválido');
-    }
+    if (!UUID_V4_REGEX.test(normalized)) {}
     this.value = normalized;
   }
killedBy: DiagnosticoPresuntivoAggregate invariantes — lanza DomainError idHistory formato no UUID → lanza "id_historia inválido"
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:25:29
       throw new DomainError('id_historia es requerido');
     }
     if (!UUID_V4_REGEX.test(normalized)) {
-      throw new DomainError('id_historia inválido');
+      throw new DomainError("");
     }
     this.value = normalized;
killedBy: DiagnosticoPresuntivoAggregate invariantes — lanza DomainError idHistory formato no UUID → lanza "id_historia inválido"
statusReason: expected [Function] to throw error including 'id_historia inválido' but got ''

[Killed] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:36:17
 
 class IdUsuarioValueObject {
   constructor(value) {
-    if (!value) {
-      throw new DomainError('idUsuario es requerido');
-    }
+    if (!value) {}
     const normalized = String(value).trim();
     if (!UUID_V4_REGEX.test(normalized)) {
killedBy: DiagnosticoPresuntivoAggregate invariantes — lanza DomainError idUsuario null → lanza "idUsuario es requerido"
statusReason: expected [Function] to throw error including 'idUsuario es requerido' but got 'idUsuario inválido'

[Killed] StringLiteral
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:37:29
 class IdUsuarioValueObject {
   constructor(value) {
     if (!value) {
-      throw new DomainError('idUsuario es requerido');
+      throw new DomainError("");
     }
     const normalized = String(value).trim();
killedBy: DiagnosticoPresuntivoAggregate invariantes — lanza DomainError idUsuario null → lanza "idUsuario es requerido"
statusReason: expected [Function] to throw error including 'idUsuario es requerido' but got ''

[Killed] ConditionalExpression
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:40:9
       throw new DomainError('idUsuario es requerido');
     }
     const normalized = String(value).trim();
-    if (!UUID_V4_REGEX.test(normalized)) {
+    if (false) {
       throw new DomainError('idUsuario inválido');
     }
killedBy: DiagnosticoPresuntivoAggregate invariantes — lanza DomainError idUsuario formato inválido → lanza "idUsuario inválido"
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:52:48
 
 class TextoValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      return;
-    }
+    if (value === null || value === undefined) {}
     const normalized = String(value).trim();
     this.value = normalized === '' ? null : normalized;
killedBy: DiagnosticoPresuntivoAggregate obtenerParametros() — orden y valores exactos descripcion null produce null en params[1]
statusReason: expected 'null' to be null

[Killed] ConditionalExpression
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:52:9
 
 class TextoValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (true) {
       this.value = null;
       return;
killedBy: DiagnosticoPresuntivoAggregate obtenerParametros() — orden y valores exactos devuelve 3 parámetros: [idHistory, descripcion, idUsuario]
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:62:59
 }
 
 class DiagnosticoPresuntivoAggregate {
-  constructor({ idHistory, descripcion, idUsuario } = {}) {
-    this._idHistory =
-      idHistory instanceof IdHistoriaValueObject
-        ? idHistory
-        : new IdHistoriaValueObject(idHistory);
-    this._descripcion =
-      descripcion instanceof TextoValueObject
-        ? descripcion
-        : new TextoValueObject(descripcion);
-    this._idUsuario =
-      idUsuario instanceof IdUsuarioValueObject
-        ? idUsuario
-        : new IdUsuarioValueObject(idUsuario);
-  }
+  constructor({ idHistory, descripcion, idUsuario } = {}) {}
   obtenerParametros() {
     return [
killedBy: DiagnosticoPresuntivoAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:76:23
         ? idUsuario
         : new IdUsuarioValueObject(idUsuario);
   }
-  obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      this._descripcion.value,
-      this._idUsuario.toString(),
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: DiagnosticoPresuntivoAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading '0')

[NoCoverage] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:99:42
    * @returns {Promise<{descripcion: string}>}
    * @abstract
    */
-  async consultarPorHistoria(_idHistory) {
-    throw new Error('IDiagnosticoPresuntivoRepository.consultarPorHistoria() no implementado');
-  }
+  async consultarPorHistoria(_idHistory) {}
 
   /**

[NoCoverage] StringLiteral
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:100:21
    * @abstract
    */
   async consultarPorHistoria(_idHistory) {
-    throw new Error('IDiagnosticoPresuntivoRepository.consultarPorHistoria() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
diagnosticoPresuntivo/domain/diagnosticoPresuntivoDomain.js:109:52
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async actualizarDiagnosticoPresuntivo(_agregado) {
-    throw new Error('IDiagnosticoPresuntivoRepository.actualizarDiagnosticoPresuntivo() no implementado');
-  }
+  async actualizarDiagnosticoPresuntivo(_agregado) {}
 }
 
