[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:22:22
   /**
    * @param {string} value UUID v4 de la historia clinica.
    */
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-
-    if (!uuidV4Pattern.test(normalizedValue)) {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (enfermedadActual) camino feliz acepta UUID v4 en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:23:36
    * @param {string} value UUID v4 de la historia clinica.
    */
   constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
-    }
+    if (typeof value !== 'string') {}
 
     const normalizedValue = value.trim().toLowerCase();
killedBy: IdHistoriaClinicaVO (enfermedadActual) invariantes — lanza DomainError null → lanza (no es string)
statusReason: expected [Function] to throw error including 'La historia clinica debe ser un UUID …' but got 'Cannot read properties of null (readi…'

[Killed] ConditionalExpression
enfermedadActual/domain/enfermedadActualDomain.js:23:9
    * @param {string} value UUID v4 de la historia clinica.
    */
   constructor(value) {
-    if (typeof value !== 'string') {
+    if (true) {
       throw new DomainError('La historia clinica debe ser un UUID v4 valido');
     }
killedBy: IdHistoriaClinicaVO (enfermedadActual) camino feliz acepta UUID v4 en minúsculas
statusReason: La historia clinica debe ser un UUID v4 valido

[Killed] Regex
enfermedadActual/domain/enfermedadActualDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO (enfermedadActual) camino feliz acepta UUID v4 en minúsculas
statusReason: La historia clinica debe ser un UUID v4 valido

[Killed] BooleanLiteral
enfermedadActual/domain/enfermedadActualDomain.js:31:9
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!uuidV4Pattern.test(normalizedValue)) {
+    if (uuidV4Pattern.test(normalizedValue)) {
       throw new DomainError('La historia clinica debe ser un UUID v4 valido');
     }
killedBy: IdHistoriaClinicaVO (enfermedadActual) camino feliz acepta UUID v4 en minúsculas
statusReason: La historia clinica debe ser un UUID v4 valido

[Killed] ConditionalExpression
enfermedadActual/domain/enfermedadActualDomain.js:31:9
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!uuidV4Pattern.test(normalizedValue)) {
+    if (false) {
       throw new DomainError('La historia clinica debe ser un UUID v4 valido');
     }
killedBy: IdHistoriaClinicaVO (enfermedadActual) invariantes — lanza DomainError cadena vacía → lanza (no pasa regex)
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
enfermedadActual/domain/enfermedadActualDomain.js:32:29
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
+      throw new DomainError("");
     }
 
killedBy: IdHistoriaClinicaVO (enfermedadActual) invariantes — lanza DomainError cadena vacía → lanza (no pasa regex)
statusReason: expected [Function] to throw error including 'La historia clinica debe ser un UUID …' but got ''

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:48:31
    * @param {unknown} value Valor textual.
    * @param {string} message Mensaje de validacion.
    */
-  constructor(value, message) {
-    if (value === null || value === undefined || value === '') {
-      throw new DomainError(message);
-    }
-
-    const normalizedValue = String(value).trim();
-    if (normalizedValue.length === 0) {
-      throw new DomainError(message);
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value, message) {}
 }
 
killedBy: TextoClinicoObligatorioVO camino feliz acepta texto no vacío
statusReason: expected undefined to be 'dolor de muelas' // Object.is equality

[Killed] ConditionalExpression
enfermedadActual/domain/enfermedadActualDomain.js:49:27
    * @param {string} message Mensaje de validacion.
    */
   constructor(value, message) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || false || value === '') {
       throw new DomainError(message);
     }
killedBy: TextoClinicoObligatorioVO invariantes — lanza DomainError undefined → lanza
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
enfermedadActual/domain/enfermedadActualDomain.js:49:50
    * @param {string} message Mensaje de validacion.
    */
   constructor(value, message) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || value === undefined || value !== '') {
       throw new DomainError(message);
     }
killedBy: TextoClinicoObligatorioVO camino feliz acepta texto no vacío
statusReason: El sintoma principal es obligatorio

[Killed] MethodExpression
enfermedadActual/domain/enfermedadActualDomain.js:53:29
       throw new DomainError(message);
     }
 
-    const normalizedValue = String(value).trim();
+    const normalizedValue = String(value);
     if (normalizedValue.length === 0) {
       throw new DomainError(message);
killedBy: TextoClinicoObligatorioVO camino feliz trimea los espacios del texto
statusReason: expected '  fiebre  ' to be 'fiebre' // Object.is equality

[Killed] ConditionalExpression
enfermedadActual/domain/enfermedadActualDomain.js:54:9
     }
 
     const normalizedValue = String(value).trim();
-    if (normalizedValue.length === 0) {
+    if (false) {
       throw new DomainError(message);
     }
killedBy: TextoClinicoObligatorioVO invariantes — lanza DomainError cadena solo espacios → lanza (trimmed === "")
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:54:39
     }
 
     const normalizedValue = String(value).trim();
-    if (normalizedValue.length === 0) {
-      throw new DomainError(message);
-    }
+    if (normalizedValue.length === 0) {}
 
     this.value = normalizedValue;
killedBy: TextoClinicoObligatorioVO invariantes — lanza DomainError cadena solo espacios → lanza (trimmed === "")
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:92:11
     curso = null,
     relato = null,
     tratamiento_prev = null,
-  } = {}) {
-    this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
-    this.#sintomaPrincipal = new TextoClinicoObligatorioVO(
-      sintoma_principal,
-      'El sintoma principal es obligatorio'
-    );
-    this.#tiempoEnfermedad = this.#normalizeTextOptional(tiempo_enfermedad);
-    this.#formaInicio = this.#normalizeTextOptional(forma_inicio);
-    this.#curso = this.#normalizeTextOptional(curso);
-    this.#relato = this.#normalizeTextOptional(relato);
-    this.#tratamientoPrev = this.#normalizeTextOptional(tratamiento_prev);
-
-    Object.freeze(this);
-  }
+  } = {}) {}
 
   /**
killedBy: EnfermedadActualAggregate construcción válida construye con todos los campos
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] StringLiteral
enfermedadActual/domain/enfermedadActualDomain.js:96:7
     this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
     this.#sintomaPrincipal = new TextoClinicoObligatorioVO(
       sintoma_principal,
-      'El sintoma principal es obligatorio'
+      ""
     );
     this.#tiempoEnfermedad = this.#normalizeTextOptional(tiempo_enfermedad);
killedBy: EnfermedadActualAggregate propagación de errores de VOs lanza con mensaje exacto si sintoma_principal es vacío
statusReason: expected [Function] to throw error including 'El sintoma principal es obligatorio' but got ''

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:111:33
    * @param {unknown} value Valor textual opcional.
    * @returns {string|null}
    */
-  #normalizeTextOptional(value) {
-    if (value === null || value === undefined || value === '') {
-      return null;
-    }
-
-    const normalizedValue = String(value).trim();
-    return normalizedValue.length === 0 ? null : normalizedValue;
-  }
+  #normalizeTextOptional(value) {}
 
   /**
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] EqualityOperator
enfermedadActual/domain/enfermedadActualDomain.js:112:27
    * @returns {string|null}
    */
   #normalizeTextOptional(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null || value !== undefined || value === '') {
       return null;
     }
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] LogicalOperator
enfermedadActual/domain/enfermedadActualDomain.js:112:9
    * @returns {string|null}
    */
   #normalizeTextOptional(value) {
-    if (value === null || value === undefined || value === '') {
+    if ((value === null || value === undefined) && value === '') {
       return null;
     }
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos opcionales ausentes son null
statusReason: expected 'null' to be null

[Killed] EqualityOperator
enfermedadActual/domain/enfermedadActualDomain.js:117:12
     }
 
     const normalizedValue = String(value).trim();
-    return normalizedValue.length === 0 ? null : normalizedValue;
+    return normalizedValue.length !== 0 ? null : normalizedValue;
   }
 
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ …(7) ] to deeply equal [ …(7) ]

[Killed] ConditionalExpression
enfermedadActual/domain/enfermedadActualDomain.js:117:12
     }
 
     const normalizedValue = String(value).trim();
-    return normalizedValue.length === 0 ? null : normalizedValue;
+    return false ? null : normalizedValue;
   }
 
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos string de espacios en opcionales se normaliza a null
statusReason: expected '' to be null

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:124:23
    * Devuelve los parametros en orden posicional para procedimientos SQL.
    * @returns {Array<unknown>}
    */
-  obtenerParametros() {
-    return [
-      this.#idHistoria.value,
-      this.#sintomaPrincipal.value,
-      this.#tiempoEnfermedad,
-      this.#formaInicio,
-      this.#curso,
-      this.#relato,
-      this.#tratamientoPrev,
-    ];
-  }
+  obtenerParametros() {}
 
   /**
killedBy: EnfermedadActualAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected undefined to deeply equal [ …(7) ]

[Killed] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:139:20
   /**
    * @returns {string}
    */
-  get idHistoria() {
-    return this.#idHistoria.value;
-  }
+  get idHistoria() {}
 }
 
killedBy: EnfermedadActualAggregate construcción válida construye con todos los campos
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[NoCoverage] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:158:27
    * @returns {Promise<{success: boolean, id_historia: string}>}
    * @abstract
    */
-  async create(_agregado) {
-    throw new Error('IEnfermedadActualRepository.create() no implementado');
-  }
+  async create(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:168:37
    * @returns {Promise<Object|undefined>}
    * @abstract
    */
-  async getByHistoria(_id_historia) {
-    throw new Error('IEnfermedadActualRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_id_historia) {}
 
   /**

[NoCoverage] BlockStatement
enfermedadActual/domain/enfermedadActualDomain.js:178:27
    * @returns {Promise<{success: boolean, id_historia: string}>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IEnfermedadActualRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 
