[Killed] BlockStatement
evolucion/domain/evolucionDomain.js:50:22
 }
 
 class FechaValueObject {
-  constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      return;
-    }
-    const fecha = new Date(value);
-    if (Number.isNaN(fecha.getTime())) {
-      throw new DomainError('fecha inválida');
-    }
-    this.value = fecha.toISOString().slice(0, 10);
-  }
+  constructor(value) {}
 }
 
killedBy: EvolucionAggregate obtenerParametros() — orden y valores exactos devuelve 5 parámetros en el orden correcto
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] BlockStatement
evolucion/domain/evolucionDomain.js:51:64
 
 class FechaValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      return;
-    }
+    if (value === null || value === undefined || value === '') {}
     const fecha = new Date(value);
     if (Number.isNaN(fecha.getTime())) {
killedBy: EvolucionAggregate construcción válida construye sin fecha (opcional → null)
statusReason: fecha inválida

[Killed] LogicalOperator
evolucion/domain/evolucionDomain.js:51:9
 
 class FechaValueObject {
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null && value === undefined || value === '') {
       this.value = null;
       return;
killedBy: EvolucionAggregate construcción válida construye sin fecha (opcional → null)
statusReason: fecha inválida

[Killed] ConditionalExpression
evolucion/domain/evolucionDomain.js:56:9
       return;
     }
     const fecha = new Date(value);
-    if (Number.isNaN(fecha.getTime())) {
+    if (false) {
       throw new DomainError('fecha inválida');
     }
killedBy: EvolucionAggregate FechaValueObject — validaciones fecha string inválida → lanza "fecha inválida"
statusReason: expected [Function] to throw error including 'fecha inválida' but got 'Invalid time value'

[Killed] MethodExpression
evolucion/domain/evolucionDomain.js:59:18
     if (Number.isNaN(fecha.getTime())) {
       throw new DomainError('fecha inválida');
     }
-    this.value = fecha.toISOString().slice(0, 10);
+    this.value = fecha.toISOString();
   }
 }
killedBy: EvolucionAggregate obtenerParametros() — orden y valores exactos devuelve 5 parámetros en el orden correcto
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] EqualityOperator
evolucion/domain/evolucionDomain.js:65:27
 
 class TextoValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (value === null || value !== undefined) {
       this.value = null;
       return;
killedBy: EvolucionAggregate obtenerParametros() — orden y valores exactos devuelve 5 parámetros en el orden correcto
statusReason: expected [ …(5) ] to deeply equal [ …(5) ]

[Killed] BlockStatement
evolucion/domain/evolucionDomain.js:75:72
 }
 
 class EvolucionAggregate {
-  constructor({ idHistory, fecha, actividad, alumno, idUsuario } = {}) {
-    this._idHistory =
-      idHistory instanceof IdHistoriaValueObject
-        ? idHistory
-        : new IdHistoriaValueObject(idHistory);
-    this._fecha =
-      fecha instanceof FechaValueObject ? fecha : new FechaValueObject(fecha);
-    this._actividad =
-      actividad instanceof TextoValueObject
-        ? actividad
-        : new TextoValueObject(actividad);
-    this._alumno =
-      alumno instanceof TextoValueObject
-        ? alumno
-        : new TextoValueObject(alumno);
-    this._idUsuario =
-      idUsuario instanceof IdUsuarioValueObject
-        ? idUsuario
-        : new IdUsuarioValueObject(idUsuario);
-  }
+  constructor({ idHistory, fecha, actividad, alumno, idUsuario } = {}) {}
   obtenerParametros() {
     return [
killedBy: EvolucionAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading 'toString')

[Killed] BlockStatement
evolucion/domain/evolucionDomain.js:95:23
         ? idUsuario
         : new IdUsuarioValueObject(idUsuario);
   }
-  obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      this._fecha.value,
-      this._actividad.value,
-      this._alumno.value,
-      this._idUsuario.toString(),
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: EvolucionAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ArrayDeclaration
evolucion/domain/evolucionDomain.js:96:12
         : new IdUsuarioValueObject(idUsuario);
   }
   obtenerParametros() {
-    return [
-      this._idHistory.toString(),
-      this._fecha.value,
-      this._actividad.value,
-      this._alumno.value,
-      this._idUsuario.toString(),
-    ];
+    return [];
   }
 }
killedBy: EvolucionAggregate construcción válida acepta prefijo HC- en idHistory
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[NoCoverage] BlockStatement
evolucion/domain/evolucionDomain.js:120:42
    * @returns {Promise<Array>}
    * @abstract
    */
-  async consultarEvoluciones(_idHistory) {
-    throw new Error('IEvolucionRepository.consultarEvoluciones() no implementado');
-  }
+  async consultarEvoluciones(_idHistory) {}
 
   /**

[NoCoverage] StringLiteral
evolucion/domain/evolucionDomain.js:121:21
    * @abstract
    */
   async consultarEvoluciones(_idHistory) {
-    throw new Error('IEvolucionRepository.consultarEvoluciones() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
evolucion/domain/evolucionDomain.js:130:39
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async registrarEvolucion(_agregado) {
-    throw new Error('IEvolucionRepository.registrarEvolucion() no implementado');
-  }
+  async registrarEvolucion(_agregado) {}
 }
 
