[Killed] BlockStatement
examenBoca/domain/examenBocaDomain.js:22:22
   /**
    * @param {string} value UUID v4.
    */
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('id_historia invalido: debe ser UUIDv4');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (examenBoca) camino feliz acepta UUID v4 en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] EqualityOperator
examenBoca/domain/examenBocaDomain.js:23:9
    * @param {string} value UUID v4.
    */
   constructor(value) {
-    if (typeof value !== 'string') {
+    if (typeof value === 'string') {
       throw new DomainError('id_historia invalido: debe ser UUIDv4');
     }
killedBy: IdHistoriaClinicaVO (examenBoca) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia invalido: debe ser UUIDv4

[Killed] Regex
examenBoca/domain/examenBocaDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[^89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(normalizedValue)) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
killedBy: IdHistoriaClinicaVO (examenBoca) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] Regex
examenBoca/domain/examenBocaDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][^0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(normalizedValue)) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
killedBy: IdHistoriaClinicaVO (examenBoca) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] BlockStatement
examenBoca/domain/examenBocaDomain.js:30:36
     const normalizedValue = value.trim().toLowerCase();
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
-    }
+    if (!re.test(normalizedValue)) {}
 
     this.value = normalizedValue;
killedBy: IdHistoriaClinicaVO (examenBoca) invariantes — lanza DomainError cadena no UUID → lanza "id_historia invalido: formato UUIDv4 esperado"
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
examenBoca/domain/examenBocaDomain.js:30:9
     const normalizedValue = value.trim().toLowerCase();
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(normalizedValue)) {
+    if (re.test(normalizedValue)) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
     }
killedBy: IdHistoriaClinicaVO (examenBoca) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] StringLiteral
examenBoca/domain/examenBocaDomain.js:31:29
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
+      throw new DomainError("");
     }
 
killedBy: IdHistoriaClinicaVO (examenBoca) invariantes — lanza DomainError cadena no UUID → lanza "id_historia invalido: formato UUIDv4 esperado"
statusReason: expected [Function] to throw error including 'id_historia invalido: formato UUIDv4 …' but got ''

[Killed] BlockStatement
examenBoca/domain/examenBocaDomain.js:46:22
   /**
    * @param {unknown} value Valor del campo.
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const text = String(value).trim();
-    this.value = text === '' ? null : text;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: TextoClinicoOpcionalVO camino feliz acepta texto no vacío
statusReason: expected undefined to be 'Normal' // Object.is equality

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:47:9
    * @param {unknown} value Valor del campo.
    */
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (value === null && value === undefined) {
       this.value = null;
       Object.freeze(this);
killedBy: TextoClinicoOpcionalVO normalización silenciosa → null null → value = null
statusReason: expected 'null' to be null

[Killed] MethodExpression
examenBoca/domain/examenBocaDomain.js:53:18
       return;
     }
 
-    const text = String(value).trim();
+    const text = String(value);
     this.value = text === '' ? null : text;
     Object.freeze(this);
killedBy: TextoClinicoOpcionalVO camino feliz trimea los espacios
statusReason: expected '  Clase I  ' to be 'Clase I' // Object.is equality

[Killed] EqualityOperator
examenBoca/domain/examenBocaDomain.js:54:18
     }
 
     const text = String(value).trim();
-    this.value = text === '' ? null : text;
+    this.value = text !== '' ? null : text;
     Object.freeze(this);
   }
killedBy: TextoClinicoOpcionalVO camino feliz acepta texto no vacío
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:54:18
     }
 
     const text = String(value).trim();
-    this.value = text === '' ? null : text;
+    this.value = true ? null : text;
     Object.freeze(this);
   }
killedBy: TextoClinicoOpcionalVO camino feliz acepta texto no vacío
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] BlockStatement
examenBoca/domain/examenBocaDomain.js:59:39
   }
 }
 
-const normalizePrimitive = (value) => {
-  if (value === undefined || value === null) {
-    return null;
-  }
-  if (typeof value === 'string') {
-    const t = value.trim();
-    return t === '' ? null : t;
-  }
-  return value;
-};
+const normalizePrimitive = (value) => {};
 
 /**
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected undefined to be null

[Killed] EqualityOperator
examenBoca/domain/examenBocaDomain.js:60:30
 }
 
 const normalizePrimitive = (value) => {
-  if (value === undefined || value === null) {
+  if (value === undefined || value !== null) {
     return null;
   }
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros params[1] corresponde a labiosSin
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] EqualityOperator
examenBoca/domain/examenBocaDomain.js:60:7
 }
 
 const normalizePrimitive = (value) => {
-  if (value === undefined || value === null) {
+  if (value !== undefined || value === null) {
     return null;
   }
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected undefined to be null

[Killed] BlockStatement
examenBoca/domain/examenBocaDomain.js:63:34
   if (value === undefined || value === null) {
     return null;
   }
-  if (typeof value === 'string') {
-    const t = value.trim();
-    return t === '' ? null : t;
-  }
+  if (typeof value === 'string') {}
   return value;
 };
killedBy: normalizePrimitive — ConditionalExpression y LogicalOperator labiosSin = "  " (solo espacios) → params[1] es null (mata t === "")
statusReason: expected '   ' to be null

[Killed] MethodExpression
examenBoca/domain/examenBocaDomain.js:64:15
     return null;
   }
   if (typeof value === 'string') {
-    const t = value.trim();
+    const t = value;
     return t === '' ? null : t;
   }
killedBy: normalizePrimitive — ConditionalExpression y LogicalOperator labiosSin = "  " (solo espacios) → params[1] es null (mata t === "")
statusReason: expected '   ' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:65:12
   }
   if (typeof value === 'string') {
     const t = value.trim();
-    return t === '' ? null : t;
+    return false ? null : t;
   }
   return value;
killedBy: normalizePrimitive — ConditionalExpression y LogicalOperator labiosSin = "  " (solo espacios) → params[1] es null (mata t === "")
statusReason: expected '' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:65:12
   }
   if (typeof value === 'string') {
     const t = value.trim();
-    return t === '' ? null : t;
+    return true ? null : t;
   }
   return value;
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros params[1] corresponde a labiosSin
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:97:37
     this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
 
     this.#campos = Object.freeze({
-      labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
+      labiosSin: normalizePrimitive(true),
       labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
       vestibuloSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:97:37
     this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
 
     this.#campos = Object.freeze({
-      labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
+      labiosSin: normalizePrimitive(false),
       labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
       vestibuloSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:98:37
 
     this.#campos = Object.freeze({
       labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
-      labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
+      labiosCon: normalizePrimitive(body.labiosCon && body.labios_con_lesiones),
       vestibuloSin: normalizePrimitive(
         body.vestibuloSin || body.vestibulo_sin_lesiones
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros params[2] corresponde a labiosCon
statusReason: expected null to be 'Lesión presente' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:98:37
 
     this.#campos = Object.freeze({
       labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
-      labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
+      labiosCon: normalizePrimitive(true),
       vestibuloSin: normalizePrimitive(
         body.vestibuloSin || body.vestibulo_sin_lesiones
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:100:9
       labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
       labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
       vestibuloSin: normalizePrimitive(
-        body.vestibuloSin || body.vestibulo_sin_lesiones
+        body.vestibuloSin && body.vestibulo_sin_lesiones
       ),
       vestibuloCon: normalizePrimitive(
killedBy: ExamenBocaAggregate alias camelCase / snake_case — kills || → && mutants vestibulo_sin_lesiones → params[3]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:100:9
       labiosSin: normalizePrimitive(body.labiosSin || body.labios_sin_lesiones),
       labiosCon: normalizePrimitive(body.labiosCon || body.labios_con_lesiones),
       vestibuloSin: normalizePrimitive(
-        body.vestibuloSin || body.vestibulo_sin_lesiones
+        false
       ),
       vestibuloCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:103:9
         body.vestibuloSin || body.vestibulo_sin_lesiones
       ),
       vestibuloCon: normalizePrimitive(
-        body.vestibuloCon || body.vestibulo_con_lesiones
+        body.vestibuloCon && body.vestibulo_con_lesiones
       ),
       carrillosSin: normalizePrimitive(
killedBy: ExamenBocaAggregate alias camelCase / snake_case — kills || → && mutants vestibulo_con_lesiones → params[4]
statusReason: expected null to be 'Úlcera' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:103:9
         body.vestibuloSin || body.vestibulo_sin_lesiones
       ),
       vestibuloCon: normalizePrimitive(
-        body.vestibuloCon || body.vestibulo_con_lesiones
+        true
       ),
       carrillosSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:106:9
         body.vestibuloCon || body.vestibulo_con_lesiones
       ),
       carrillosSin: normalizePrimitive(
-        body.carrillosSin || body.carrillos_retromolar_sin_lesiones
+        false
       ),
       carrillosCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:106:9
         body.vestibuloCon || body.vestibulo_con_lesiones
       ),
       carrillosSin: normalizePrimitive(
-        body.carrillosSin || body.carrillos_retromolar_sin_lesiones
+        true
       ),
       carrillosCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:109:9
         body.carrillosSin || body.carrillos_retromolar_sin_lesiones
       ),
       carrillosCon: normalizePrimitive(
-        body.carrillosCon || body.carrillos_retromolar_con_lesiones
+        body.carrillosCon && body.carrillos_retromolar_con_lesiones
       ),
       paladarSin: normalizePrimitive(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) carrillos_retromolar_con_lesiones → params[6]
statusReason: expected null to be 'Lesión' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:109:9
         body.carrillosSin || body.carrillos_retromolar_sin_lesiones
       ),
       carrillosCon: normalizePrimitive(
-        body.carrillosCon || body.carrillos_retromolar_con_lesiones
+        false
       ),
       paladarSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:112:9
         body.carrillosCon || body.carrillos_retromolar_con_lesiones
       ),
       paladarSin: normalizePrimitive(
-        body.paladarSin || body.paladar_sin_lesiones
+        false
       ),
       paladarCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:112:9
         body.carrillosCon || body.carrillos_retromolar_con_lesiones
       ),
       paladarSin: normalizePrimitive(
-        body.paladarSin || body.paladar_sin_lesiones
+        true
       ),
       paladarCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:115:9
         body.paladarSin || body.paladar_sin_lesiones
       ),
       paladarCon: normalizePrimitive(
-        body.paladarCon || body.paladar_con_lesiones
+        body.paladarCon && body.paladar_con_lesiones
       ),
       orofaringeSin: normalizePrimitive(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) paladar_con_lesiones → params[8]
statusReason: expected null to be 'Inflamado' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:115:9
         body.paladarSin || body.paladar_sin_lesiones
       ),
       paladarCon: normalizePrimitive(
-        body.paladarCon || body.paladar_con_lesiones
+        false
       ),
       orofaringeSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:118:9
         body.paladarCon || body.paladar_con_lesiones
       ),
       orofaringeSin: normalizePrimitive(
-        body.orofaringeSin || body.orofaringe_sin_lesiones
+        true
       ),
       orofaringeCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:118:9
         body.paladarCon || body.paladar_con_lesiones
       ),
       orofaringeSin: normalizePrimitive(
-        body.orofaringeSin || body.orofaringe_sin_lesiones
+        false
       ),
       orofaringeCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:121:9
         body.orofaringeSin || body.orofaringe_sin_lesiones
       ),
       orofaringeCon: normalizePrimitive(
-        body.orofaringeCon || body.orofaringe_con_lesiones
+        body.orofaringeCon && body.orofaringe_con_lesiones
       ),
       pisoBocaSin: normalizePrimitive(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) orofaringe_con_lesiones → params[10]
statusReason: expected null to be 'Eritema' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:121:9
         body.orofaringeSin || body.orofaringe_sin_lesiones
       ),
       orofaringeCon: normalizePrimitive(
-        body.orofaringeCon || body.orofaringe_con_lesiones
+        false
       ),
       pisoBocaSin: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:124:9
         body.orofaringeCon || body.orofaringe_con_lesiones
       ),
       pisoBocaSin: normalizePrimitive(
-        body.pisoBocaSin || body.piso_boca_sin_lesiones
+        false
       ),
       pisoBocaCon: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:124:9
         body.orofaringeCon || body.orofaringe_con_lesiones
       ),
       pisoBocaSin: normalizePrimitive(
-        body.pisoBocaSin || body.piso_boca_sin_lesiones
+        body.pisoBocaSin && body.piso_boca_sin_lesiones
       ),
       pisoBocaCon: normalizePrimitive(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) piso_boca_sin_lesiones → params[11]
statusReason: expected null to be 'Sin alteraciones' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:127:9
         body.pisoBocaSin || body.piso_boca_sin_lesiones
       ),
       pisoBocaCon: normalizePrimitive(
-        body.pisoBocaCon || body.piso_boca_con_lesiones
+        false
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:127:9
         body.pisoBocaSin || body.piso_boca_sin_lesiones
       ),
       pisoBocaCon: normalizePrimitive(
-        body.pisoBocaCon || body.piso_boca_con_lesiones
+        true
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:129:37
       pisoBocaCon: normalizePrimitive(
         body.pisoBocaCon || body.piso_boca_con_lesiones
       ),
-      lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
+      lenguaSin: normalizePrimitive(false),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:129:37
       pisoBocaCon: normalizePrimitive(
         body.pisoBocaCon || body.piso_boca_con_lesiones
       ),
-      lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
+      lenguaSin: normalizePrimitive(body.lenguaSin && body.lengua_sin_lesiones),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) lengua_sin_lesiones → params[13]
statusReason: expected null to be 'Sin lesiones' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:130:37
         body.pisoBocaCon || body.piso_boca_con_lesiones
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
-      lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
+      lenguaCon: normalizePrimitive(false),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:130:37
         body.pisoBocaCon || body.piso_boca_con_lesiones
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
-      lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
+      lenguaCon: normalizePrimitive(body.lenguaCon && body.lengua_con_lesiones),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) lengua_con_lesiones → params[14]
statusReason: expected null to be 'Úlcera' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:131:36
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
-      enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
+      enciaSin: normalizePrimitive(false),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
       oclusionMordidaCruzada: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:131:36
       ),
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
-      enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
+      enciaSin: normalizePrimitive(body.enciaSin && body.encia_sin_lesiones),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
       oclusionMordidaCruzada: normalizePrimitive(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) encia_sin_lesiones → params[15]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:132:36
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
-      enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
+      enciaCon: normalizePrimitive(false),
       oclusionMordidaCruzada: normalizePrimitive(
         body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:132:36
       lenguaSin: normalizePrimitive(body.lenguaSin || body.lengua_sin_lesiones),
       lenguaCon: normalizePrimitive(body.lenguaCon || body.lengua_con_lesiones),
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
-      enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
+      enciaCon: normalizePrimitive(body.enciaCon && body.encia_con_lesiones),
       oclusionMordidaCruzada: normalizePrimitive(
         body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) encia_con_lesiones → params[16]
statusReason: expected null to be 'Hiperplasia' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:134:9
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
       oclusionMordidaCruzada: normalizePrimitive(
-        body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
+        true
       ),
       oclusionVestibuloclusion: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:134:9
       enciaSin: normalizePrimitive(body.enciaSin || body.encia_sin_lesiones),
       enciaCon: normalizePrimitive(body.enciaCon || body.encia_con_lesiones),
       oclusionMordidaCruzada: normalizePrimitive(
-        body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
+        false
       ),
       oclusionVestibuloclusion: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:137:9
         body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
       ),
       oclusionVestibuloclusion: normalizePrimitive(
-        body.oclusionVestibuloclusion || body.oclusion_vestibuloclusion
+        false
       ),
       oclusionMordidaAbierta: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:137:9
         body.oclusionMordidaCruzada || body.oclusion_mordida_cruzada
       ),
       oclusionVestibuloclusion: normalizePrimitive(
-        body.oclusionVestibuloclusion || body.oclusion_vestibuloclusion
+        true
       ),
       oclusionMordidaAbierta: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null
