[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:140:9
         body.oclusionVestibuloclusion || body.oclusion_vestibuloclusion
       ),
       oclusionMordidaAbierta: normalizePrimitive(
-        body.oclusionMordidaAbierta || body.oclusion_mordida_abierta
+        true
       ),
       oclusionSobremordida: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:140:9
         body.oclusionVestibuloclusion || body.oclusion_vestibuloclusion
       ),
       oclusionMordidaAbierta: normalizePrimitive(
-        body.oclusionMordidaAbierta || body.oclusion_mordida_abierta
+        false
       ),
       oclusionSobremordida: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:143:9
         body.oclusionMordidaAbierta || body.oclusion_mordida_abierta
       ),
       oclusionSobremordida: normalizePrimitive(
-        body.oclusionSobremordida || body.oclusion_sobremordida
+        true
       ),
       oclusionVerticalOtros: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:143:9
         body.oclusionMordidaAbierta || body.oclusion_mordida_abierta
       ),
       oclusionSobremordida: normalizePrimitive(
-        body.oclusionSobremordida || body.oclusion_sobremordida
+        false
       ),
       oclusionVerticalOtros: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:146:9
         body.oclusionSobremordida || body.oclusion_sobremordida
       ),
       oclusionVerticalOtros: normalizePrimitive(
-        body.oclusionVerticalOtros || body.oclusion_relacion_vertical_otros
+        true
       ),
       oclusionProtrusion: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:146:9
         body.oclusionSobremordida || body.oclusion_sobremordida
       ),
       oclusionVerticalOtros: normalizePrimitive(
-        body.oclusionVerticalOtros || body.oclusion_relacion_vertical_otros
+        false
       ),
       oclusionProtrusion: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:149:9
         body.oclusionVerticalOtros || body.oclusion_relacion_vertical_otros
       ),
       oclusionProtrusion: normalizePrimitive(
-        body.oclusionProtrusion || body.oclusion_protrusion
+        false
       ),
       oclusionGuiaIncisiva: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:149:9
         body.oclusionVerticalOtros || body.oclusion_relacion_vertical_otros
       ),
       oclusionProtrusion: normalizePrimitive(
-        body.oclusionProtrusion || body.oclusion_protrusion
+        true
       ),
       oclusionGuiaIncisiva: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:152:9
         body.oclusionProtrusion || body.oclusion_protrusion
       ),
       oclusionGuiaIncisiva: normalizePrimitive(
-        body.oclusionGuiaIncisiva || body.oclusion_guia_incisiva
+        true
       ),
       oclusionContactoPosterior: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:152:9
         body.oclusionProtrusion || body.oclusion_protrusion
       ),
       oclusionGuiaIncisiva: normalizePrimitive(
-        body.oclusionGuiaIncisiva || body.oclusion_guia_incisiva
+        false
       ),
       oclusionContactoPosterior: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:155:9
         body.oclusionGuiaIncisiva || body.oclusion_guia_incisiva
       ),
       oclusionContactoPosterior: normalizePrimitive(
-        body.oclusionContactoPosterior || body.oclusion_contacto_posterior
+        true
       ),
       latDerGuiaCanina: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:155:9
         body.oclusionGuiaIncisiva || body.oclusion_guia_incisiva
       ),
       oclusionContactoPosterior: normalizePrimitive(
-        body.oclusionContactoPosterior || body.oclusion_contacto_posterior
+        false
       ),
       latDerGuiaCanina: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:158:9
         body.oclusionContactoPosterior || body.oclusion_contacto_posterior
       ),
       latDerGuiaCanina: normalizePrimitive(
-        body.latDerGuiaCanina || body.lat_der_guia_canina
+        true
       ),
       latDerFuncionGrupo: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:158:9
         body.oclusionContactoPosterior || body.oclusion_contacto_posterior
       ),
       latDerGuiaCanina: normalizePrimitive(
-        body.latDerGuiaCanina || body.lat_der_guia_canina
+        false
       ),
       latDerFuncionGrupo: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:161:9
         body.latDerGuiaCanina || body.lat_der_guia_canina
       ),
       latDerFuncionGrupo: normalizePrimitive(
-        body.latDerFuncionGrupo || body.lat_der_funcion_grupo
+        false
       ),
       latDerContactoBalance: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:161:9
         body.latDerGuiaCanina || body.lat_der_guia_canina
       ),
       latDerFuncionGrupo: normalizePrimitive(
-        body.latDerFuncionGrupo || body.lat_der_funcion_grupo
+        true
       ),
       latDerContactoBalance: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:164:9
         body.latDerFuncionGrupo || body.lat_der_funcion_grupo
       ),
       latDerContactoBalance: normalizePrimitive(
-        body.latDerContactoBalance || body.lat_der_contacto_balance
+        true
       ),
       latDerDescriba: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:164:9
         body.latDerFuncionGrupo || body.lat_der_funcion_grupo
       ),
       latDerContactoBalance: normalizePrimitive(
-        body.latDerContactoBalance || body.lat_der_contacto_balance
+        false
       ),
       latDerDescriba: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:167:9
         body.latDerContactoBalance || body.lat_der_contacto_balance
       ),
       latDerDescriba: normalizePrimitive(
-        body.latDerDescriba || body.lat_der_describa
+        true
       ),
       latIzqGuiaCanina: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:167:9
         body.latDerContactoBalance || body.lat_der_contacto_balance
       ),
       latDerDescriba: normalizePrimitive(
-        body.latDerDescriba || body.lat_der_describa
+        false
       ),
       latIzqGuiaCanina: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:170:9
         body.latDerDescriba || body.lat_der_describa
       ),
       latIzqGuiaCanina: normalizePrimitive(
-        body.latIzqGuiaCanina || body.lat_izq_guia_canina
+        true
       ),
       latIzqFuncionGrupo: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:170:9
         body.latDerDescriba || body.lat_der_describa
       ),
       latIzqGuiaCanina: normalizePrimitive(
-        body.latIzqGuiaCanina || body.lat_izq_guia_canina
+        false
       ),
       latIzqFuncionGrupo: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:173:9
         body.latIzqGuiaCanina || body.lat_izq_guia_canina
       ),
       latIzqFuncionGrupo: normalizePrimitive(
-        body.latIzqFuncionGrupo || body.lat_izq_funcion_grupo
+        true
       ),
       latIzqContactoBalance: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:173:9
         body.latIzqGuiaCanina || body.lat_izq_guia_canina
       ),
       latIzqFuncionGrupo: normalizePrimitive(
-        body.latIzqFuncionGrupo || body.lat_izq_funcion_grupo
+        false
       ),
       latIzqContactoBalance: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:176:9
         body.latIzqFuncionGrupo || body.lat_izq_funcion_grupo
       ),
       latIzqContactoBalance: normalizePrimitive(
-        body.latIzqContactoBalance || body.lat_izq_contacto_balance
+        false
       ),
       latIzqDescriba: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:176:9
         body.latIzqFuncionGrupo || body.lat_izq_funcion_grupo
       ),
       latIzqContactoBalance: normalizePrimitive(
-        body.latIzqContactoBalance || body.lat_izq_contacto_balance
+        true
       ),
       latIzqDescriba: normalizePrimitive(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:179:9
         body.latIzqContactoBalance || body.lat_izq_contacto_balance
       ),
       latIzqDescriba: normalizePrimitive(
-        body.latIzqDescriba || body.lat_izq_describa
+        false
       ),
     });
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:179:9
         body.latIzqContactoBalance || body.lat_izq_contacto_balance
       ),
       latIzqDescriba: normalizePrimitive(
-        body.latIzqDescriba || body.lat_izq_describa
+        true
       ),
     });
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:184:7
     });
 
     this.#oclusionMolarDer = new TextoClinicoOpcionalVO(
-      body.oclusionMolarDer || body.oclusion_molar_der
+      body.oclusionMolarDer && body.oclusion_molar_der
     );
     this.#oclusionMolarIzq = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate alias camelCase / snake_case — kills || → && mutants oclusion_molar_der (snake_case) → mismo índice que oclusionMolarDer (params[17])
statusReason: expected null to be 'Clase I' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:184:7
     });
 
     this.#oclusionMolarDer = new TextoClinicoOpcionalVO(
-      body.oclusionMolarDer || body.oclusion_molar_der
+      false
     );
     this.#oclusionMolarIzq = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:187:7
       body.oclusionMolarDer || body.oclusion_molar_der
     );
     this.#oclusionMolarIzq = new TextoClinicoOpcionalVO(
-      body.oclusionMolarIzq || body.oclusion_molar_izq
+      true
     );
     this.#oclusionCaninaDer = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'true' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:187:7
       body.oclusionMolarDer || body.oclusion_molar_der
     );
     this.#oclusionMolarIzq = new TextoClinicoOpcionalVO(
-      body.oclusionMolarIzq || body.oclusion_molar_izq
+      false
     );
     this.#oclusionCaninaDer = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:190:7
       body.oclusionMolarIzq || body.oclusion_molar_izq
     );
     this.#oclusionCaninaDer = new TextoClinicoOpcionalVO(
-      body.oclusionCaninaDer || body.oclusion_canina_der
+      false
     );
     this.#oclusionCaninaIzq = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:190:7
       body.oclusionMolarIzq || body.oclusion_molar_izq
     );
     this.#oclusionCaninaDer = new TextoClinicoOpcionalVO(
-      body.oclusionCaninaDer || body.oclusion_canina_der
+      body.oclusionCaninaDer && body.oclusion_canina_der
     );
     this.#oclusionCaninaIzq = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate alias camelCase / snake_case — kills || → && mutants oclusion_canina_der → params[19]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] LogicalOperator
examenBoca/domain/examenBocaDomain.js:193:7
       body.oclusionCaninaDer || body.oclusion_canina_der
     );
     this.#oclusionCaninaIzq = new TextoClinicoOpcionalVO(
-      body.oclusionCaninaIzq || body.oclusion_canina_izq
+      body.oclusionCaninaIzq && body.oclusion_canina_izq
     );
     this.#oclusionOverbite = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate — alias snake_case sin camelCase (mata || → &&) oclusion_canina_izq → params[20]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:193:7
       body.oclusionCaninaDer || body.oclusion_canina_der
     );
     this.#oclusionCaninaIzq = new TextoClinicoOpcionalVO(
-      body.oclusionCaninaIzq || body.oclusion_canina_izq
+      false
     );
     this.#oclusionOverbite = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:196:7
       body.oclusionCaninaIzq || body.oclusion_canina_izq
     );
     this.#oclusionOverbite = new TextoClinicoOpcionalVO(
-      body.oclusionOverbite || body.oclusion_overbite
+      false
     );
     this.#oclusionOverjet = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:196:7
       body.oclusionCaninaIzq || body.oclusion_canina_izq
     );
     this.#oclusionOverbite = new TextoClinicoOpcionalVO(
-      body.oclusionOverbite || body.oclusion_overbite
+      true
     );
     this.#oclusionOverjet = new TextoClinicoOpcionalVO(
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'true' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:199:7
       body.oclusionOverbite || body.oclusion_overbite
     );
     this.#oclusionOverjet = new TextoClinicoOpcionalVO(
-      body.oclusionOverjet || body.oclusion_overjet
+      false
     );
 
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'false' to be null

[Killed] ConditionalExpression
examenBoca/domain/examenBocaDomain.js:199:7
       body.oclusionOverbite || body.oclusion_overbite
     );
     this.#oclusionOverjet = new TextoClinicoOpcionalVO(
-      body.oclusionOverjet || body.oclusion_overjet
+      true
     );
 
killedBy: ExamenBocaAggregate obtenerParametros() — 39 parámetros todos los campos vacíos producen null (excepto params[0])
statusReason: expected 'true' to be null

[NoCoverage] BlockStatement
examenBoca/domain/examenBocaDomain.js:271:36
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async getByHistoria(_idHistoria) {
-    throw new Error('IExamenBocaRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_idHistoria) {}
 
   /**

[NoCoverage] StringLiteral
examenBoca/domain/examenBocaDomain.js:272:21
    * @abstract
    */
   async getByHistoria(_idHistoria) {
-    throw new Error('IExamenBocaRepository.getByHistoria() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
examenBoca/domain/examenBocaDomain.js:281:27
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IExamenBocaRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 

[NoCoverage] StringLiteral
examenBoca/domain/examenBocaDomain.js:282:21
    * @abstract
    */
   async update(_agregado) {
-    throw new Error('IExamenBocaRepository.update() no implementado');
+    throw new Error("");
   }
 }
