[Killed] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:22:22
   /**
    * @param {number|string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const num = Number(value);
-    if (Number.isNaN(num) || num < 30 || num > 45) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = num;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: TemperaturaVO normalización silenciosa → null (nunca lanza) null → value === null
statusReason: expected undefined to be null

[Killed] EqualityOperator
examenGeneral/domain/examenGeneralDomain.js:30:42
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 30 || num > 45) {
+    if (Number.isNaN(num) || num < 30 || num <= 45) {
       this.value = null;
       Object.freeze(this);
killedBy: TemperaturaVO valores límite — fuera de rango → null max+ε: 45.1 → null
statusReason: expected 45.1 to be null

[Killed] EqualityOperator
examenGeneral/domain/examenGeneralDomain.js:30:30
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 30 || num > 45) {
+    if (Number.isNaN(num) || num <= 30 || num > 45) {
       this.value = null;
       Object.freeze(this);
killedBy: TemperaturaVO valores límite — dentro del rango → value preservado min = 30 → 30
statusReason: expected null to be 30 // Object.is equality

[Killed] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:48:22
   /**
    * @param {number|string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 500) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = num;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: PesoVO normalización silenciosa → null null → value === null
statusReason: expected undefined to be null

[Killed] EqualityOperator
examenGeneral/domain/examenGeneralDomain.js:49:9
    * @param {number|string|null|undefined} value
    */
   constructor(value) {
-    if (value === null || value === undefined) {
+    if (value !== null || value === undefined) {
       this.value = null;
       Object.freeze(this);
killedBy: PesoVO valores límite — en rango → value preservado min válido (~0): 0.1 → 0.1
statusReason: expected null to be 0.1 // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:56:30
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 500) {
+    if (Number.isNaN(num) || false || num > 500) {
       this.value = null;
       Object.freeze(this);
killedBy: PesoVO valores límite — fuera de rango → null límite inferior exacto: 0 → null (<=0 no permitido)
statusReason: expected +0 to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:56:9
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 500) {
+    if (Number.isNaN(num) && num <= 0 || num > 500) {
       this.value = null;
       Object.freeze(this);
killedBy: PesoVO normalización silenciosa → null texto no numérico → null
statusReason: expected NaN to be null

[Killed] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:74:22
   /**
    * @param {string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const text = String(value).trim();
-    const re = /^\d{2,3}\/\d{2,3}$/;
-    if (!re.test(text)) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = text;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: PresionArterialVO normalización silenciosa → null null → value === null
statusReason: expected undefined to be null

[Killed] Regex
examenGeneral/domain/examenGeneralDomain.js:82:16
     }
 
     const text = String(value).trim();
-    const re = /^\d{2,3}\/\d{2,3}$/;
+    const re = /^\d\/\d{2,3}$/;
     if (!re.test(text)) {
       this.value = null;
killedBy: PresionArterialVO normalización silenciosa → null un dígito "9/80" → null (regex exige 2-3 dígitos)
statusReason: expected '9/80' to be null

[Survived] Regex
examenGeneral/domain/examenGeneralDomain.js:82:16
     }
 
     const text = String(value).trim();
-    const re = /^\d{2,3}\/\d{2,3}$/;
+    const re = /^\d{2,3}\/\d{2,3}/;
     if (!re.test(text)) {
       this.value = null;

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:83:9
 
     const text = String(value).trim();
     const re = /^\d{2,3}\/\d{2,3}$/;
-    if (!re.test(text)) {
+    if (true) {
       this.value = null;
       Object.freeze(this);
killedBy: PresionArterialVO camino feliz — formatos válidos 2d/2d "12/80" → "12/80"
statusReason: expected null to be '12/80' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:83:9
 
     const text = String(value).trim();
     const re = /^\d{2,3}\/\d{2,3}$/;
-    if (!re.test(text)) {
+    if (false) {
       this.value = null;
       Object.freeze(this);
killedBy: PresionArterialVO normalización silenciosa → null texto libre "alta" → null
statusReason: expected 'alta' to be null

[Killed] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:101:22
   /**
    * @param {string} value
    */
-  constructor(value) {
-    if (!value || typeof value !== 'string') {
-      throw new DomainError('id_historia invalido: debe ser UUIDv4');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (examenGeneral) camino feliz acepta UUID v4 y lo normaliza en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BooleanLiteral
examenGeneral/domain/examenGeneralDomain.js:102:9
    * @param {string} value
    */
   constructor(value) {
-    if (!value || typeof value !== 'string') {
+    if (value || typeof value !== 'string') {
       throw new DomainError('id_historia invalido: debe ser UUIDv4');
     }
killedBy: IdHistoriaClinicaVO (examenGeneral) camino feliz acepta UUID v4 y lo normaliza en minúsculas
statusReason: id_historia invalido: debe ser UUIDv4

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:102:9
    * @param {string} value
    */
   constructor(value) {
-    if (!value || typeof value !== 'string') {
+    if (false) {
       throw new DomainError('id_historia invalido: debe ser UUIDv4');
     }
killedBy: IdHistoriaClinicaVO (examenGeneral) invariante 1 — falsy/no-string → MSG_NULL null → primer mensaje
statusReason: expected [Function] to throw error including 'id_historia invalido: debe ser UUIDv4' but got 'Cannot read properties of null (readi…'

[Killed] Regex
examenGeneral/domain/examenGeneralDomain.js:108:7
 
     const normalizedValue = value.trim().toLowerCase();
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[^0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(normalizedValue)) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
killedBy: IdHistoriaClinicaVO (examenGeneral) camino feliz acepta UUID v4 y lo normaliza en minúsculas
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] Regex
examenGeneral/domain/examenGeneralDomain.js:108:7
 
     const normalizedValue = value.trim().toLowerCase();
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}/i;
     if (!re.test(normalizedValue)) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
killedBy: IdHistoriaClinicaVO (examenGeneral) invariante 2 — string truthy sin formato UUID → MSG_FMT UUID con carácter extra al final → segundo mensaje (kills $ mutant)
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:119:7
 }
 
 const normalizePrimitive = (value) => {
-  if (value === undefined || value === null) {
+  if (true) {
     return null;
   }
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — campos normales [1] posicion y [2] actitud en posición correcta
statusReason: expected null to be 'sedente' // Object.is equality

[Killed] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:119:46
 }
 
 const normalizePrimitive = (value) => {
-  if (value === undefined || value === null) {
-    return null;
-  }
+  if (value === undefined || value === null) {}
   if (typeof value === 'string') {
     const t = value.trim();
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected undefined to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:122:7
   if (value === undefined || value === null) {
     return null;
   }
-  if (typeof value === 'string') {
+  if (true) {
     const t = value.trim();
     return t === '' ? null : t;
killedBy: ExamenGeneralController.registrarExamenFisicoGeneral returns 201 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] EqualityOperator
examenGeneral/domain/examenGeneralDomain.js:124:12
   }
   if (typeof value === 'string') {
     const t = value.trim();
-    return t === '' ? null : t;
+    return t !== '' ? null : t;
   }
   return value;
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — campos normales [1] posicion y [2] actitud en posición correcta
statusReason: expected null to be 'sedente' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:154:37
       actitud: normalizePrimitive(body.actitud),
       deambulacion: normalizePrimitive(body.deambulacion),
       facies: normalizePrimitive(body.facies),
-      faciesObs: normalizePrimitive(body.faciesObs || body.facies_obs),
+      faciesObs: normalizePrimitive(true),
       conciencia: normalizePrimitive(body.conciencia),
       constitucion: normalizePrimitive(body.constitucion),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:154:37
       actitud: normalizePrimitive(body.actitud),
       deambulacion: normalizePrimitive(body.deambulacion),
       facies: normalizePrimitive(body.facies),
-      faciesObs: normalizePrimitive(body.faciesObs || body.facies_obs),
+      faciesObs: normalizePrimitive(false),
       conciencia: normalizePrimitive(body.conciencia),
       constitucion: normalizePrimitive(body.constitucion),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:158:9
       conciencia: normalizePrimitive(body.conciencia),
       constitucion: normalizePrimitive(body.constitucion),
       estadoNutritivo: normalizePrimitive(
-        body.estadoNutritivo || body.estado_nutritivo
+        body.estadoNutritivo && body.estado_nutritivo
       ),
       frecuenciaRespiratoria: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [8] estado_nutritivo snake_case → se almacena en params[8]
statusReason: expected null to be 'bueno' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:158:9
       conciencia: normalizePrimitive(body.conciencia),
       constitucion: normalizePrimitive(body.constitucion),
       estadoNutritivo: normalizePrimitive(
-        body.estadoNutritivo || body.estado_nutritivo
+        true
       ),
       frecuenciaRespiratoria: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:161:9
         body.estadoNutritivo || body.estado_nutritivo
       ),
       frecuenciaRespiratoria: normalizePrimitive(
-        body.frecuenciaRespiratoria || body.frecuencia_respiratoria
+        body.frecuenciaRespiratoria && body.frecuencia_respiratoria
       ),
       pulso: normalizePrimitive(body.pulso),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [11] frecuencia_respiratoria snake_case → se almacena en params[11]
statusReason: expected null to be '16 rpm' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:161:9
         body.estadoNutritivo || body.estado_nutritivo
       ),
       frecuenciaRespiratoria: normalizePrimitive(
-        body.frecuenciaRespiratoria || body.frecuencia_respiratoria
+        false
       ),
       pulso: normalizePrimitive(body.pulso),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:165:37
       ),
       pulso: normalizePrimitive(body.pulso),
       talla: normalizePrimitive(body.talla),
-      pielColor: normalizePrimitive(body.pielColor || body.piel_color),
+      pielColor: normalizePrimitive(false),
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:165:37
       ),
       pulso: normalizePrimitive(body.pulso),
       talla: normalizePrimitive(body.talla),
-      pielColor: normalizePrimitive(body.pielColor || body.piel_color),
+      pielColor: normalizePrimitive(true),
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:166:39
       pulso: normalizePrimitive(body.pulso),
       talla: normalizePrimitive(body.talla),
       pielColor: normalizePrimitive(body.pielColor || body.piel_color),
-      pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
+      pielHumedad: normalizePrimitive(true),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
       pielLesionesObs: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:166:39
       pulso: normalizePrimitive(body.pulso),
       talla: normalizePrimitive(body.talla),
       pielColor: normalizePrimitive(body.pielColor || body.piel_color),
-      pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
+      pielHumedad: normalizePrimitive(false),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
       pielLesionesObs: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:167:40
       talla: normalizePrimitive(body.talla),
       pielColor: normalizePrimitive(body.pielColor || body.piel_color),
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
-      pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
+      pielLesiones: normalizePrimitive(false),
       pielLesionesObs: normalizePrimitive(
         body.pielLesionesObs || body.piel_lesiones_obs
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:167:40
       talla: normalizePrimitive(body.talla),
       pielColor: normalizePrimitive(body.pielColor || body.piel_color),
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
-      pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
+      pielLesiones: normalizePrimitive(true),
       pielLesionesObs: normalizePrimitive(
         body.pielLesionesObs || body.piel_lesiones_obs
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:169:9
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
       pielLesionesObs: normalizePrimitive(
-        body.pielLesionesObs || body.piel_lesiones_obs
+        false
       ),
       pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:169:9
       pielHumedad: normalizePrimitive(body.pielHumedad || body.piel_humedad),
       pielLesiones: normalizePrimitive(body.pielLesiones || body.piel_lesiones),
       pielLesionesObs: normalizePrimitive(
-        body.pielLesionesObs || body.piel_lesiones_obs
+        body.pielLesionesObs && body.piel_lesiones_obs
       ),
       pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [18] piel_lesiones_obs snake_case → se almacena en params[18]
statusReason: expected null to be 'ninguna' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:171:38
       pielLesionesObs: normalizePrimitive(
         body.pielLesionesObs || body.piel_lesiones_obs
       ),
-      pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
+      pielAnexos: normalizePrimitive(false),
       pielAnexosObs: normalizePrimitive(
         body.pielAnexosObs || body.piel_anexos_obs
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:171:38
       pielLesionesObs: normalizePrimitive(
         body.pielLesionesObs || body.piel_lesiones_obs
       ),
-      pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
+      pielAnexos: normalizePrimitive(body.pielAnexos && body.piel_anexos),
       pielAnexosObs: normalizePrimitive(
         body.pielAnexosObs || body.piel_anexos_obs
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [19] piel_anexos snake_case → se almacena en params[19]
statusReason: expected null to be 'normales' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:173:9
       ),
       pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
       pielAnexosObs: normalizePrimitive(
-        body.pielAnexosObs || body.piel_anexos_obs
+        false
       ),
       tcsDistribucion: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:173:9
       ),
       pielAnexos: normalizePrimitive(body.pielAnexos || body.piel_anexos),
       pielAnexosObs: normalizePrimitive(
-        body.pielAnexosObs || body.piel_anexos_obs
+        true
       ),
       tcsDistribucion: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:176:9
         body.pielAnexosObs || body.piel_anexos_obs
       ),
       tcsDistribucion: normalizePrimitive(
-        body.tcsDistribucion || body.tcs_distribucion
+        body.tcsDistribucion && body.tcs_distribucion
       ),
       tcsDistribucionObs: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [21] tcs_distribucion snake_case → se almacena en params[21]
statusReason: expected null to be 'uniforme' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:176:9
         body.pielAnexosObs || body.piel_anexos_obs
       ),
       tcsDistribucion: normalizePrimitive(
-        body.tcsDistribucion || body.tcs_distribucion
+        false
       ),
       tcsDistribucionObs: normalizePrimitive(
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:179:9
         body.tcsDistribucion || body.tcs_distribucion
       ),
       tcsDistribucionObs: normalizePrimitive(
-        body.tcsDistribucionObs || body.tcs_distribucion_obs
+        false
       ),
       tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:179:9
         body.tcsDistribucion || body.tcs_distribucion
       ),
       tcsDistribucionObs: normalizePrimitive(
-        body.tcsDistribucionObs || body.tcs_distribucion_obs
+        true
       ),
       tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:181:39
       tcsDistribucionObs: normalizePrimitive(
         body.tcsDistribucionObs || body.tcs_distribucion_obs
       ),
-      tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
+      tcsCantidad: normalizePrimitive(false),
       ganglios: normalizePrimitive(body.ganglios),
       gangliosObs: normalizePrimitive(body.gangliosObs || body.ganglios_obs),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected false to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:181:39
       tcsDistribucionObs: normalizePrimitive(
         body.tcsDistribucionObs || body.tcs_distribucion_obs
       ),
-      tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
+      tcsCantidad: normalizePrimitive(body.tcsCantidad && body.tcs_cantidad),
       ganglios: normalizePrimitive(body.ganglios),
       gangliosObs: normalizePrimitive(body.gangliosObs || body.ganglios_obs),
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — alias snake_case (kills || → && mutants) [23] tcs_cantidad snake_case → se almacena en params[23]
statusReason: expected null to be 'moderada' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:183:39
       ),
       tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
       ganglios: normalizePrimitive(body.ganglios),
-      gangliosObs: normalizePrimitive(body.gangliosObs || body.ganglios_obs),
+      gangliosObs: normalizePrimitive(true),
     });
 
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — estructura (26 params) todos null cuando body está vacío
statusReason: expected true to be null

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:183:39
       ),
       tcsCantidad: normalizePrimitive(body.tcsCantidad || body.tcs_cantidad),
       ganglios: normalizePrimitive(body.ganglios),
-      gangliosObs: normalizePrimitive(body.gangliosObs || body.ganglios_obs),
+      gangliosObs: normalizePrimitive(body.gangliosObs && body.ganglios_obs),
     });
 
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — campos normales [25] gangliosObs (último parámetro)
statusReason: expected null to be 'sin alteraciones' // Object.is equality

[Killed] LogicalOperator
examenGeneral/domain/examenGeneralDomain.js:188:7
 
     this.#temperatura = new TemperaturaVO(body.temperatura);
     this.#presionArterial = new PresionArterialVO(
-      body.presionArterial || body.presion_arterial
+      body.presionArterial && body.presion_arterial
     );
     this.#peso = new PesoVO(body.peso);
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — posiciones de VOs críticos [10] presion_arterial válida ("120/80") se almacena
statusReason: expected null to be '120/80' // Object.is equality

[Killed] ConditionalExpression
examenGeneral/domain/examenGeneralDomain.js:188:7
 
     this.#temperatura = new TemperaturaVO(body.temperatura);
     this.#presionArterial = new PresionArterialVO(
-      body.presionArterial || body.presion_arterial
+      false
     );
     this.#peso = new PesoVO(body.peso);
killedBy: ExamenFisicoGeneralAggregate obtenerParametros() — posiciones de VOs críticos [10] presion_arterial válida ("120/80") se almacena
statusReason: expected null to be '120/80' // Object.is equality

[NoCoverage] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:249:27
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async create(_agregado) {
-    throw new Error('IExamenGeneralRepository.create() no implementado');
-  }
+  async create(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:259:36
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async getByHistoria(_idHistoria) {
-    throw new Error('IExamenGeneralRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_idHistoria) {}
 
   /**

[NoCoverage] BlockStatement
examenGeneral/domain/examenGeneralDomain.js:269:27
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IExamenGeneralRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 
