[Killed] BlockStatement
examenRegional/domain/examenRegionalDomain.js:22:22
   /**
    * @param {string} value UUID v4.
    */
-  constructor(value) {
-    if (!value || typeof value !== 'string') {
-      throw new DomainError('id_historia invalido: debe ser UUIDv4');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-
-    if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (examenRegional) camino feliz acepta UUID v4 válido
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:23:19
    * @param {string} value UUID v4.
    */
   constructor(value) {
-    if (!value || typeof value !== 'string') {
+    if (!value || false) {
       throw new DomainError('id_historia invalido: debe ser UUIDv4');
     }
killedBy: IdHistoriaClinicaVO (examenRegional) — mutantes LogicalOperator número 123 → lanza con mensaje "debe ser UUIDv4" (mata ConditionalExpression)
statusReason: expected [Function] to throw error including 'id_historia invalido: debe ser UUIDv4' but got 'value.trim is not a function'

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:23:9
    * @param {string} value UUID v4.
    */
   constructor(value) {
-    if (!value || typeof value !== 'string') {
+    if (true) {
       throw new DomainError('id_historia invalido: debe ser UUIDv4');
     }
killedBy: IdHistoriaClinicaVO (examenRegional) camino feliz acepta UUID v4 válido
statusReason: id_historia invalido: debe ser UUIDv4

[Killed] StringLiteral
examenRegional/domain/examenRegionalDomain.js:24:29
    */
   constructor(value) {
     if (!value || typeof value !== 'string') {
-      throw new DomainError('id_historia invalido: debe ser UUIDv4');
+      throw new DomainError("");
     }
 
killedBy: IdHistoriaClinicaVO (examenRegional) invariantes — lanza DomainError null o falsy → lanza "id_historia invalido: debe ser UUIDv4"
statusReason: expected [Function] to throw error including 'id_historia invalido: debe ser UUIDv4' but got ''

[Killed] Regex
examenRegional/domain/examenRegionalDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[^0-9a-f]{12}$/i;
 
     if (!re.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO (examenRegional) camino feliz acepta UUID v4 válido
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] BlockStatement
examenRegional/domain/examenRegionalDomain.js:31:36
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!re.test(normalizedValue)) {
-      throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
-    }
+    if (!re.test(normalizedValue)) {}
 
     this.value = normalizedValue;
killedBy: IdHistoriaClinicaVO (examenRegional) invariantes — lanza DomainError cadena no UUID → lanza "id_historia invalido: formato UUIDv4 esperado"
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:31:9
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!re.test(normalizedValue)) {
+    if (true) {
       throw new DomainError('id_historia invalido: formato UUIDv4 esperado');
     }
killedBy: IdHistoriaClinicaVO (examenRegional) camino feliz acepta UUID v4 válido
statusReason: id_historia invalido: formato UUIDv4 esperado

[Killed] BlockStatement
examenRegional/domain/examenRegionalDomain.js:47:22
   /**
    * @param {number|string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 10) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = num;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: AgudezaVisualVO normalización silenciosa — rango (0, 10] null → value = null
statusReason: expected undefined to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:55:9
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 10) {
+    if (Number.isNaN(num) && num <= 0 || num > 10) {
       this.value = null;
       Object.freeze(this);
killedBy: AgudezaVisualVO normalización silenciosa — rango (0, 10] 0 → null (no positivo)
statusReason: expected +0 to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:55:42
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num <= 0 || num > 10) {
+    if (Number.isNaN(num) || num <= 0 || false) {
       this.value = null;
       Object.freeze(this);
killedBy: AgudezaVisualVO normalización silenciosa — rango (0, 10] mayor que 10 → null
statusReason: expected 10.1 to be null

[Killed] BlockStatement
examenRegional/domain/examenRegionalDomain.js:73:22
   /**
    * @param {number|string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 100) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = num;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: AperturaMaximaVO normalización silenciosa — rango [0, 100] null → value = null
statusReason: expected undefined to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:81:9
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 100) {
+    if (true) {
       this.value = null;
       Object.freeze(this);
killedBy: AperturaMaximaVO normalización silenciosa — rango [0, 100] 0 → value = 0 (incluye cero, BVA límite inferior)
statusReason: expected null to be +0 // Object.is equality

[Killed] EqualityOperator
examenRegional/domain/examenRegionalDomain.js:81:30
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 100) {
+    if (Number.isNaN(num) || num >= 0 || num > 100) {
       this.value = null;
       Object.freeze(this);
killedBy: AperturaMaximaVO normalización silenciosa — rango [0, 100] 0 → value = 0 (incluye cero, BVA límite inferior)
statusReason: expected null to be +0 // Object.is equality

[Killed] BlockStatement
examenRegional/domain/examenRegionalDomain.js:99:22
   /**
    * @param {number|string|null|undefined} value
    */
-  constructor(value) {
-    if (value === null || value === undefined) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 10) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    this.value = num;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: MusculosDolorGradoVO normalización silenciosa — rango [0, 10] null → value = null
statusReason: expected undefined to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:107:30
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 10) {
+    if (Number.isNaN(num) || false || num > 10) {
       this.value = null;
       Object.freeze(this);
killedBy: MusculosDolorGradoVO normalización silenciosa — rango [0, 10] -1 → null (BVA justo debajo)
statusReason: expected -1 to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:107:9
     }
 
     const num = Number(value);
-    if (Number.isNaN(num) || num < 0 || num > 10) {
+    if ((Number.isNaN(num) || num < 0) && num > 10) {
       this.value = null;
       Object.freeze(this);
killedBy: MusculosDolorGradoVO normalización silenciosa — rango [0, 10] -1 → null (BVA justo debajo)
statusReason: expected -1 to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:151:9
 
     this.#campos = Object.freeze({
       cabezaPosicion: normalizePrimitive(
-        body.cabezaPosicion || body.cabeza_posicion
+        true
       ),
       cabezaMovimientos: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:151:9
 
     this.#campos = Object.freeze({
       cabezaPosicion: normalizePrimitive(
-        body.cabezaPosicion || body.cabeza_posicion
+        body.cabezaPosicion && body.cabeza_posicion
       ),
       cabezaMovimientos: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros params[1] corresponde a cabezaPosicion
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:154:9
         body.cabezaPosicion || body.cabeza_posicion
       ),
       cabezaMovimientos: normalizePrimitive(
-        body.cabezaMovimientos || body.cabeza_movimientos
+        true
       ),
       cabezaMovimientosObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:154:9
         body.cabezaPosicion || body.cabeza_posicion
       ),
       cabezaMovimientos: normalizePrimitive(
-        body.cabezaMovimientos || body.cabeza_movimientos
+        body.cabezaMovimientos && body.cabeza_movimientos
       ),
       cabezaMovimientosObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cabeza_movimientos → params[2]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:157:9
         body.cabezaMovimientos || body.cabeza_movimientos
       ),
       cabezaMovimientosObs: normalizePrimitive(
-        body.cabezaMovimientosObs || body.cabeza_movimientos_obs
+        body.cabezaMovimientosObs && body.cabeza_movimientos_obs
       ),
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cabeza_movimientos_obs → params[3]
statusReason: expected null to be 'Sin obs' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:157:9
         body.cabezaMovimientos || body.cabeza_movimientos
       ),
       cabezaMovimientosObs: normalizePrimitive(
-        body.cabezaMovimientosObs || body.cabeza_movimientos_obs
+        false
       ),
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:159:40
       cabezaMovimientosObs: normalizePrimitive(
         body.cabezaMovimientosObs || body.cabeza_movimientos_obs
       ),
-      craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
+      craneoTamano: normalizePrimitive(false),
       craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
       caraFormaFrente: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:159:40
       cabezaMovimientosObs: normalizePrimitive(
         body.cabezaMovimientosObs || body.cabeza_movimientos_obs
       ),
-      craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
+      craneoTamano: normalizePrimitive(body.craneoTamano && body.craneo_tamano),
       craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
       caraFormaFrente: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase craneo_tamano → params[4]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:160:39
         body.cabezaMovimientosObs || body.cabeza_movimientos_obs
       ),
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
-      craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
+      craneoForma: normalizePrimitive(false),
       caraFormaFrente: normalizePrimitive(
         body.caraFormaFrente || body.cara_forma_frente
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:160:39
         body.cabezaMovimientosObs || body.cabeza_movimientos_obs
       ),
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
-      craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
+      craneoForma: normalizePrimitive(body.craneoForma && body.craneo_forma),
       caraFormaFrente: normalizePrimitive(
         body.caraFormaFrente || body.cara_forma_frente
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase craneo_forma → params[5]
statusReason: expected null to be 'Redonda' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:162:9
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
       craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
       caraFormaFrente: normalizePrimitive(
-        body.caraFormaFrente || body.cara_forma_frente
+        true
       ),
       caraFormaPerfil: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:162:9
       craneoTamano: normalizePrimitive(body.craneoTamano || body.craneo_tamano),
       craneoForma: normalizePrimitive(body.craneoForma || body.craneo_forma),
       caraFormaFrente: normalizePrimitive(
-        body.caraFormaFrente || body.cara_forma_frente
+        body.caraFormaFrente && body.cara_forma_frente
       ),
       caraFormaPerfil: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cara_forma_frente → params[6]
statusReason: expected null to be 'Ovalada' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:165:9
         body.caraFormaFrente || body.cara_forma_frente
       ),
       caraFormaPerfil: normalizePrimitive(
-        body.caraFormaPerfil || body.cara_forma_perfil
+        body.caraFormaPerfil && body.cara_forma_perfil
       ),
       ojosCejasAdecuada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cara_forma_perfil → params[7]
statusReason: expected null to be 'Recto' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:165:9
         body.caraFormaFrente || body.cara_forma_frente
       ),
       caraFormaPerfil: normalizePrimitive(
-        body.caraFormaPerfil || body.cara_forma_perfil
+        true
       ),
       ojosCejasAdecuada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:168:9
         body.caraFormaPerfil || body.cara_forma_perfil
       ),
       ojosCejasAdecuada: normalizePrimitive(
-        body.ojosCejasAdecuada || body.ojos_cejas_adecuada
+        true
       ),
       ojosImplantacionObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:168:9
         body.caraFormaPerfil || body.cara_forma_perfil
       ),
       ojosCejasAdecuada: normalizePrimitive(
-        body.ojosCejasAdecuada || body.ojos_cejas_adecuada
+        body.ojosCejasAdecuada && body.ojos_cejas_adecuada
       ),
       ojosImplantacionObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase ojos_cejas_adecuada → params[8]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:171:9
         body.ojosCejasAdecuada || body.ojos_cejas_adecuada
       ),
       ojosImplantacionObs: normalizePrimitive(
-        body.ojosImplantacionObs || body.ojos_implantacion_obs
+        true
       ),
       ojosEscleroticas: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:171:9
         body.ojosCejasAdecuada || body.ojos_cejas_adecuada
       ),
       ojosImplantacionObs: normalizePrimitive(
-        body.ojosImplantacionObs || body.ojos_implantacion_obs
+        body.ojosImplantacionObs && body.ojos_implantacion_obs
       ),
       ojosEscleroticas: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase ojos_implantacion_obs → params[9]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:174:9
         body.ojosImplantacionObs || body.ojos_implantacion_obs
       ),
       ojosEscleroticas: normalizePrimitive(
-        body.ojosEscleroticas || body.ojos_escleroticas
+        false
       ),
       ojosIrisColor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:174:9
         body.ojosImplantacionObs || body.ojos_implantacion_obs
       ),
       ojosEscleroticas: normalizePrimitive(
-        body.ojosEscleroticas || body.ojos_escleroticas
+        body.ojosEscleroticas && body.ojos_escleroticas
       ),
       ojosIrisColor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase ojos_escleroticas → params[10]
statusReason: expected null to be 'Blancas' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:177:9
         body.ojosEscleroticas || body.ojos_escleroticas
       ),
       ojosIrisColor: normalizePrimitive(
-        body.ojosIrisColor || body.ojos_iris_color
+        body.ojosIrisColor && body.ojos_iris_color
       ),
       ojosArcoSenil: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase ojos_iris_color → params[12]
statusReason: expected null to be 'Café' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:177:9
         body.ojosEscleroticas || body.ojos_escleroticas
       ),
       ojosIrisColor: normalizePrimitive(
-        body.ojosIrisColor || body.ojos_iris_color
+        false
       ),
       ojosArcoSenil: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:180:9
         body.ojosIrisColor || body.ojos_iris_color
       ),
       ojosArcoSenil: normalizePrimitive(
-        body.ojosArcoSenil || body.ojos_arco_senil
+        false
       ),
       narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:180:9
         body.ojosIrisColor || body.ojos_iris_color
       ),
       ojosArcoSenil: normalizePrimitive(
-        body.ojosArcoSenil || body.ojos_arco_senil
+        true
       ),
       narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:182:38
       ojosArcoSenil: normalizePrimitive(
         body.ojosArcoSenil || body.ojos_arco_senil
       ),
-      narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
+      narizForma: normalizePrimitive(true),
       narizPermeables: normalizePrimitive(
         body.narizPermeables || body.nariz_permeables
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:182:38
       ojosArcoSenil: normalizePrimitive(
         body.ojosArcoSenil || body.ojos_arco_senil
       ),
-      narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
+      narizForma: normalizePrimitive(body.narizForma && body.nariz_forma),
       narizPermeables: normalizePrimitive(
         body.narizPermeables || body.nariz_permeables
killedBy: ExamenFisicoRegionalAggregate alias camelCase / snake_case — kills || → && mutants nariz_forma → params[14]
statusReason: expected null to be 'Recta' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:184:9
       ),
       narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
       narizPermeables: normalizePrimitive(
-        body.narizPermeables || body.nariz_permeables
+        body.narizPermeables && body.nariz_permeables
       ),
       narizSecreciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase nariz_permeables → params[15]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:184:9
       ),
       narizForma: normalizePrimitive(body.narizForma || body.nariz_forma),
       narizPermeables: normalizePrimitive(
-        body.narizPermeables || body.nariz_permeables
+        true
       ),
       narizSecreciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:187:9
         body.narizPermeables || body.nariz_permeables
       ),
       narizSecreciones: normalizePrimitive(
-        body.narizSecreciones || body.nariz_secreciones
+        false
       ),
       narizSenosDolorosos: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:187:9
         body.narizPermeables || body.nariz_permeables
       ),
       narizSecreciones: normalizePrimitive(
-        body.narizSecreciones || body.nariz_secreciones
+        body.narizSecreciones && body.nariz_secreciones
       ),
       narizSenosDolorosos: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase nariz_secreciones → params[16]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:190:9
         body.narizSecreciones || body.nariz_secreciones
       ),
       narizSenosDolorosos: normalizePrimitive(
-        body.narizSenosDolorosos || body.nariz_senos_dolorosos
+        true
       ),
       oidosAnomaliasMorfologicas: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:190:9
         body.narizSecreciones || body.nariz_secreciones
       ),
       narizSenosDolorosos: normalizePrimitive(
-        body.narizSenosDolorosos || body.nariz_senos_dolorosos
+        body.narizSenosDolorosos && body.nariz_senos_dolorosos
       ),
       oidosAnomaliasMorfologicas: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase nariz_senos_dolorosos → params[17]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:193:9
         body.narizSenosDolorosos || body.nariz_senos_dolorosos
       ),
       oidosAnomaliasMorfologicas: normalizePrimitive(
-        body.oidosAnomaliasMorfologicas || body.oidos_anomalias_morfologicas
+        false
       ),
       oidosAnomaliasObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:193:9
         body.narizSenosDolorosos || body.nariz_senos_dolorosos
       ),
       oidosAnomaliasMorfologicas: normalizePrimitive(
-        body.oidosAnomaliasMorfologicas || body.oidos_anomalias_morfologicas
+        body.oidosAnomaliasMorfologicas && body.oidos_anomalias_morfologicas
       ),
       oidosAnomaliasObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase oidos_anomalias_morfologicas → params[18]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:196:9
         body.oidosAnomaliasMorfologicas || body.oidos_anomalias_morfologicas
       ),
       oidosAnomaliasObs: normalizePrimitive(
-        body.oidosAnomaliasObs || body.oidos_anomalias_obs
+        false
       ),
       oidosSecreciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:196:9
         body.oidosAnomaliasMorfologicas || body.oidos_anomalias_morfologicas
       ),
       oidosAnomaliasObs: normalizePrimitive(
-        body.oidosAnomaliasObs || body.oidos_anomalias_obs
+        true
       ),
       oidosSecreciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:199:9
         body.oidosAnomaliasObs || body.oidos_anomalias_obs
       ),
       oidosSecreciones: normalizePrimitive(
-        body.oidosSecreciones || body.oidos_secreciones
+        true
       ),
       oidosAudicionConservada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:199:9
         body.oidosAnomaliasObs || body.oidos_anomalias_obs
       ),
       oidosSecreciones: normalizePrimitive(
-        body.oidosSecreciones || body.oidos_secreciones
+        false
       ),
       oidosAudicionConservada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:202:9
         body.oidosSecreciones || body.oidos_secreciones
       ),
       oidosAudicionConservada: normalizePrimitive(
-        body.oidosAudicionConservada || body.oidos_audicion_conservada
+        body.oidosAudicionConservada && body.oidos_audicion_conservada
       ),
       atmTrayectoria: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase oidos_audicion_conservada → params[21]
statusReason: expected null to be 'Sí' // Object.is equality
