[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:202:9
         body.oidosSecreciones || body.oidos_secreciones
       ),
       oidosAudicionConservada: normalizePrimitive(
-        body.oidosAudicionConservada || body.oidos_audicion_conservada
+        false
       ),
       atmTrayectoria: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:205:9
         body.oidosAudicionConservada || body.oidos_audicion_conservada
       ),
       atmTrayectoria: normalizePrimitive(
-        body.atmTrayectoria || body.atm_trayectoria
+        true
       ),
       atmLatIzqDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:205:9
         body.oidosAudicionConservada || body.oidos_audicion_conservada
       ),
       atmTrayectoria: normalizePrimitive(
-        body.atmTrayectoria || body.atm_trayectoria
+        false
       ),
       atmLatIzqDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:208:9
         body.atmTrayectoria || body.atm_trayectoria
       ),
       atmLatIzqDolor: normalizePrimitive(
-        body.atmLatIzqDolor || body.atm_lat_izq_dolor
+        body.atmLatIzqDolor && body.atm_lat_izq_dolor
       ),
       atmLatIzqRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_lat_izq_dolor → params[23]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:208:9
         body.atmTrayectoria || body.atm_trayectoria
       ),
       atmLatIzqDolor: normalizePrimitive(
-        body.atmLatIzqDolor || body.atm_lat_izq_dolor
+        false
       ),
       atmLatIzqRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:211:9
         body.atmLatIzqDolor || body.atm_lat_izq_dolor
       ),
       atmLatIzqRuido: normalizePrimitive(
-        body.atmLatIzqRuido || body.atm_lat_izq_ruido
+        true
       ),
       atmLatIzqSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:211:9
         body.atmLatIzqDolor || body.atm_lat_izq_dolor
       ),
       atmLatIzqRuido: normalizePrimitive(
-        body.atmLatIzqRuido || body.atm_lat_izq_ruido
+        false
       ),
       atmLatIzqSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:214:9
         body.atmLatIzqRuido || body.atm_lat_izq_ruido
       ),
       atmLatIzqSalto: normalizePrimitive(
-        body.atmLatIzqSalto || body.atm_lat_izq_salto
+        true
       ),
       atmLatDerDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:214:9
         body.atmLatIzqRuido || body.atm_lat_izq_ruido
       ),
       atmLatIzqSalto: normalizePrimitive(
-        body.atmLatIzqSalto || body.atm_lat_izq_salto
+        body.atmLatIzqSalto && body.atm_lat_izq_salto
       ),
       atmLatDerDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_lat_izq_salto → params[25]
statusReason: expected null to be 'No' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:217:9
         body.atmLatIzqSalto || body.atm_lat_izq_salto
       ),
       atmLatDerDolor: normalizePrimitive(
-        body.atmLatDerDolor || body.atm_lat_der_dolor
+        body.atmLatDerDolor && body.atm_lat_der_dolor
       ),
       atmLatDerRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_lat_der_dolor → params[26]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:217:9
         body.atmLatIzqSalto || body.atm_lat_izq_salto
       ),
       atmLatDerDolor: normalizePrimitive(
-        body.atmLatDerDolor || body.atm_lat_der_dolor
+        false
       ),
       atmLatDerRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:220:9
         body.atmLatDerDolor || body.atm_lat_der_dolor
       ),
       atmLatDerRuido: normalizePrimitive(
-        body.atmLatDerRuido || body.atm_lat_der_ruido
+        false
       ),
       atmLatDerSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:220:9
         body.atmLatDerDolor || body.atm_lat_der_dolor
       ),
       atmLatDerRuido: normalizePrimitive(
-        body.atmLatDerRuido || body.atm_lat_der_ruido
+        body.atmLatDerRuido && body.atm_lat_der_ruido
       ),
       atmLatDerSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_lat_der_ruido → params[27]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:223:9
         body.atmLatDerRuido || body.atm_lat_der_ruido
       ),
       atmLatDerSalto: normalizePrimitive(
-        body.atmLatDerSalto || body.atm_lat_der_salto
+        false
       ),
       atmProtDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:223:9
         body.atmLatDerRuido || body.atm_lat_der_ruido
       ),
       atmLatDerSalto: normalizePrimitive(
-        body.atmLatDerSalto || body.atm_lat_der_salto
+        true
       ),
       atmProtDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:226:9
         body.atmLatDerSalto || body.atm_lat_der_salto
       ),
       atmProtDolor: normalizePrimitive(
-        body.atmProtDolor || body.atm_prot_dolor
+        false
       ),
       atmProtRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:226:9
         body.atmLatDerSalto || body.atm_lat_der_salto
       ),
       atmProtDolor: normalizePrimitive(
-        body.atmProtDolor || body.atm_prot_dolor
+        body.atmProtDolor && body.atm_prot_dolor
       ),
       atmProtRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_prot_dolor → params[29]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:229:9
         body.atmProtDolor || body.atm_prot_dolor
       ),
       atmProtRuido: normalizePrimitive(
-        body.atmProtRuido || body.atm_prot_ruido
+        true
       ),
       atmProtSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:229:9
         body.atmProtDolor || body.atm_prot_dolor
       ),
       atmProtRuido: normalizePrimitive(
-        body.atmProtRuido || body.atm_prot_ruido
+        body.atmProtRuido && body.atm_prot_ruido
       ),
       atmProtSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_prot_ruido → params[30]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:232:9
         body.atmProtRuido || body.atm_prot_ruido
       ),
       atmProtSalto: normalizePrimitive(
-        body.atmProtSalto || body.atm_prot_salto
+        false
       ),
       atmAperDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:232:9
         body.atmProtRuido || body.atm_prot_ruido
       ),
       atmProtSalto: normalizePrimitive(
-        body.atmProtSalto || body.atm_prot_salto
+        body.atmProtSalto && body.atm_prot_salto
       ),
       atmAperDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_prot_salto → params[31]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:235:9
         body.atmProtSalto || body.atm_prot_salto
       ),
       atmAperDolor: normalizePrimitive(
-        body.atmAperDolor || body.atm_aper_dolor
+        false
       ),
       atmAperRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:235:9
         body.atmProtSalto || body.atm_prot_salto
       ),
       atmAperDolor: normalizePrimitive(
-        body.atmAperDolor || body.atm_aper_dolor
+        body.atmAperDolor && body.atm_aper_dolor
       ),
       atmAperRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_aper_dolor → params[32]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:238:9
         body.atmAperDolor || body.atm_aper_dolor
       ),
       atmAperRuido: normalizePrimitive(
-        body.atmAperRuido || body.atm_aper_ruido
+        false
       ),
       atmAperSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:238:9
         body.atmAperDolor || body.atm_aper_dolor
       ),
       atmAperRuido: normalizePrimitive(
-        body.atmAperRuido || body.atm_aper_ruido
+        body.atmAperRuido && body.atm_aper_ruido
       ),
       atmAperSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_aper_ruido → params[33]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:241:9
         body.atmAperRuido || body.atm_aper_ruido
       ),
       atmAperSalto: normalizePrimitive(
-        body.atmAperSalto || body.atm_aper_salto
+        true
       ),
       atmCierreDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:241:9
         body.atmAperRuido || body.atm_aper_ruido
       ),
       atmAperSalto: normalizePrimitive(
-        body.atmAperSalto || body.atm_aper_salto
+        body.atmAperSalto && body.atm_aper_salto
       ),
       atmCierreDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_aper_salto → params[34]
statusReason: expected null to be 'No' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:244:9
         body.atmAperSalto || body.atm_aper_salto
       ),
       atmCierreDolor: normalizePrimitive(
-        body.atmCierreDolor || body.atm_cierre_dolor
+        body.atmCierreDolor && body.atm_cierre_dolor
       ),
       atmCierreRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_cierre_dolor → params[35]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:244:9
         body.atmAperSalto || body.atm_aper_salto
       ),
       atmCierreDolor: normalizePrimitive(
-        body.atmCierreDolor || body.atm_cierre_dolor
+        true
       ),
       atmCierreRuido: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:247:9
         body.atmCierreDolor || body.atm_cierre_dolor
       ),
       atmCierreRuido: normalizePrimitive(
-        body.atmCierreRuido || body.atm_cierre_ruido
+        body.atmCierreRuido && body.atm_cierre_ruido
       ),
       atmCierreSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_cierre_ruido → params[36]
statusReason: expected null to be 'No' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:247:9
         body.atmCierreDolor || body.atm_cierre_dolor
       ),
       atmCierreRuido: normalizePrimitive(
-        body.atmCierreRuido || body.atm_cierre_ruido
+        true
       ),
       atmCierreSalto: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:250:9
         body.atmCierreRuido || body.atm_cierre_ruido
       ),
       atmCierreSalto: normalizePrimitive(
-        body.atmCierreSalto || body.atm_cierre_salto
+        true
       ),
       atmCoordinacionCondilar: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:250:9
         body.atmCierreRuido || body.atm_cierre_ruido
       ),
       atmCierreSalto: normalizePrimitive(
-        body.atmCierreSalto || body.atm_cierre_salto
+        false
       ),
       atmCoordinacionCondilar: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:253:9
         body.atmCierreSalto || body.atm_cierre_salto
       ),
       atmCoordinacionCondilar: normalizePrimitive(
-        body.atmCoordinacionCondilar || body.atm_coordinacion_condilar
+        body.atmCoordinacionCondilar && body.atm_coordinacion_condilar
       ),
       atmObservaciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_coordinacion_condilar → params[38]
statusReason: expected null to be 'Coordinada' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:253:9
         body.atmCierreSalto || body.atm_cierre_salto
       ),
       atmCoordinacionCondilar: normalizePrimitive(
-        body.atmCoordinacionCondilar || body.atm_coordinacion_condilar
+        false
       ),
       atmObservaciones: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:256:9
         body.atmCoordinacionCondilar || body.atm_coordinacion_condilar
       ),
       atmObservaciones: normalizePrimitive(
-        body.atmObservaciones || body.atm_observaciones
+        body.atmObservaciones && body.atm_observaciones
       ),
       atmMusculosDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_observaciones → params[40]
statusReason: expected null to be 'Sin cambios' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:256:9
         body.atmCoordinacionCondilar || body.atm_coordinacion_condilar
       ),
       atmObservaciones: normalizePrimitive(
-        body.atmObservaciones || body.atm_observaciones
+        false
       ),
       atmMusculosDolor: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:259:9
         body.atmObservaciones || body.atm_observaciones
       ),
       atmMusculosDolor: normalizePrimitive(
-        body.atmMusculosDolor || body.atm_musculos_dolor
+        false
       ),
       atmMusculosDolorZona: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:259:9
         body.atmObservaciones || body.atm_observaciones
       ),
       atmMusculosDolor: normalizePrimitive(
-        body.atmMusculosDolor || body.atm_musculos_dolor
+        true
       ),
       atmMusculosDolorZona: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:262:9
         body.atmMusculosDolor || body.atm_musculos_dolor
       ),
       atmMusculosDolorZona: normalizePrimitive(
-        body.atmMusculosDolorZona || body.atm_musculos_dolor_zona
+        false
       ),
       cuelloSimetrico: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:262:9
         body.atmMusculosDolor || body.atm_musculos_dolor
       ),
       atmMusculosDolorZona: normalizePrimitive(
-        body.atmMusculosDolorZona || body.atm_musculos_dolor_zona
+        body.atmMusculosDolorZona && body.atm_musculos_dolor_zona
       ),
       cuelloSimetrico: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase atm_musculos_dolor_zona → params[43]
statusReason: expected null to be 'Temporal' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:265:9
         body.atmMusculosDolorZona || body.atm_musculos_dolor_zona
       ),
       cuelloSimetrico: normalizePrimitive(
-        body.cuelloSimetrico || body.cuello_simetrico
+        body.cuelloSimetrico && body.cuello_simetrico
       ),
       cuelloSimetricoObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate alias camelCase / snake_case — kills || → && mutants cuello_simetrico → params[44]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:265:9
         body.atmMusculosDolorZona || body.atm_musculos_dolor_zona
       ),
       cuelloSimetrico: normalizePrimitive(
-        body.cuelloSimetrico || body.cuello_simetrico
+        false
       ),
       cuelloSimetricoObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:268:9
         body.cuelloSimetrico || body.cuello_simetrico
       ),
       cuelloSimetricoObs: normalizePrimitive(
-        body.cuelloSimetricoObs || body.cuello_simetrico_obs
+        true
       ),
       cuelloMovilidadConservada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:268:9
         body.cuelloSimetrico || body.cuello_simetrico
       ),
       cuelloSimetricoObs: normalizePrimitive(
-        body.cuelloSimetricoObs || body.cuello_simetrico_obs
+        false
       ),
       cuelloMovilidadConservada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:271:9
         body.cuelloSimetricoObs || body.cuello_simetrico_obs
       ),
       cuelloMovilidadConservada: normalizePrimitive(
-        body.cuelloMovilidadConservada || body.cuello_movilidad_conservada
+        body.cuelloMovilidadConservada && body.cuello_movilidad_conservada
       ),
       cuelloMovilidadObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cuello_movilidad_conservada → params[46]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:271:9
         body.cuelloSimetricoObs || body.cuello_simetrico_obs
       ),
       cuelloMovilidadConservada: normalizePrimitive(
-        body.cuelloMovilidadConservada || body.cuello_movilidad_conservada
+        true
       ),
       cuelloMovilidadObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:274:9
         body.cuelloMovilidadConservada || body.cuello_movilidad_conservada
       ),
       cuelloMovilidadObs: normalizePrimitive(
-        body.cuelloMovilidadObs || body.cuello_movilidad_obs
+        true
       ),
       laringeAlineada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:274:9
         body.cuelloMovilidadConservada || body.cuello_movilidad_conservada
       ),
       cuelloMovilidadObs: normalizePrimitive(
-        body.cuelloMovilidadObs || body.cuello_movilidad_obs
+        false
       ),
       laringeAlineada: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected false to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:277:9
         body.cuelloMovilidadObs || body.cuello_movilidad_obs
       ),
       laringeAlineada: normalizePrimitive(
-        body.laringeAlineada || body.laringe_alineada
+        true
       ),
       laringeAlineadaObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:277:9
         body.cuelloMovilidadObs || body.cuello_movilidad_obs
       ),
       laringeAlineada: normalizePrimitive(
-        body.laringeAlineada || body.laringe_alineada
+        body.laringeAlineada && body.laringe_alineada
       ),
       laringeAlineadaObs: normalizePrimitive(
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase laringe_alineada → params[48]
statusReason: expected null to be 'Sí' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:280:9
         body.laringeAlineada || body.laringe_alineada
       ),
       laringeAlineadaObs: normalizePrimitive(
-        body.laringeAlineadaObs || body.laringe_alineada_obs
+        body.laringeAlineadaObs && body.laringe_alineada_obs
       ),
       cuelloOtros: normalizePrimitive(body.cuelloOtros || body.cuello_otros),
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase laringe_alineada_obs → params[49]
statusReason: expected null to be 'Normal' // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:280:9
         body.laringeAlineada || body.laringe_alineada
       ),
       laringeAlineadaObs: normalizePrimitive(
-        body.laringeAlineadaObs || body.laringe_alineada_obs
+        true
       ),
       cuelloOtros: normalizePrimitive(body.cuelloOtros || body.cuello_otros),
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:282:39
       laringeAlineadaObs: normalizePrimitive(
         body.laringeAlineadaObs || body.laringe_alineada_obs
       ),
-      cuelloOtros: normalizePrimitive(body.cuelloOtros || body.cuello_otros),
+      cuelloOtros: normalizePrimitive(true),
     });
 
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected true to be null

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:282:39
       laringeAlineadaObs: normalizePrimitive(
         body.laringeAlineadaObs || body.laringe_alineada_obs
       ),
-      cuelloOtros: normalizePrimitive(body.cuelloOtros || body.cuello_otros),
+      cuelloOtros: normalizePrimitive(body.cuelloOtros && body.cuello_otros),
     });
 
killedBy: ExamenFisicoRegionalAggregate — alias snake_case sin camelCase cuello_otros → params[50]
statusReason: expected null to be 'Sin hallazgos' // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:286:7
     });
 
     this.#ojosAgudezaVisual = new AgudezaVisualVO(
-      body.ojosAgudezaVisual || body.ojos_agudeza_visual
+      body.ojosAgudezaVisual && body.ojos_agudeza_visual
     );
     this.#atmAperturaMaximaMm = new AperturaMaximaVO(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros AgudezaVisualVO en params[11]
statusReason: expected null to be 8 // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:286:7
     });
 
     this.#ojosAgudezaVisual = new AgudezaVisualVO(
-      body.ojosAgudezaVisual || body.ojos_agudeza_visual
+      false
     );
     this.#atmAperturaMaximaMm = new AperturaMaximaVO(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros AgudezaVisualVO en params[11]
statusReason: expected null to be 8 // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:289:7
       body.ojosAgudezaVisual || body.ojos_agudeza_visual
     );
     this.#atmAperturaMaximaMm = new AperturaMaximaVO(
-      body.atmAperturaMaximaMm || body.atm_apertura_maxima_mm
+      false
     );
     this.#atmMusculosDolorGrado = new MusculosDolorGradoVO(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected +0 to be null
