[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:289:7
       body.ojosAgudezaVisual || body.ojos_agudeza_visual
     );
     this.#atmAperturaMaximaMm = new AperturaMaximaVO(
-      body.atmAperturaMaximaMm || body.atm_apertura_maxima_mm
+      body.atmAperturaMaximaMm && body.atm_apertura_maxima_mm
     );
     this.#atmMusculosDolorGrado = new MusculosDolorGradoVO(
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros AperturaMaximaVO en params[39]
statusReason: expected null to be 45 // Object.is equality

[Killed] LogicalOperator
examenRegional/domain/examenRegionalDomain.js:292:7
       body.atmAperturaMaximaMm || body.atm_apertura_maxima_mm
     );
     this.#atmMusculosDolorGrado = new MusculosDolorGradoVO(
-      body.atmMusculosDolorGrado || body.atm_musculos_dolor_grado
+      body.atmMusculosDolorGrado && body.atm_musculos_dolor_grado
     );
 
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros MusculosDolorGradoVO en params[42]
statusReason: expected null to be 7 // Object.is equality

[Killed] ConditionalExpression
examenRegional/domain/examenRegionalDomain.js:292:7
       body.atmAperturaMaximaMm || body.atm_apertura_maxima_mm
     );
     this.#atmMusculosDolorGrado = new MusculosDolorGradoVO(
-      body.atmMusculosDolorGrado || body.atm_musculos_dolor_grado
+      true
     );
 
killedBy: ExamenFisicoRegionalAggregate obtenerParametros() — 51 parámetros todos los campos vacíos producen null en body (excepto params[0])
statusReason: expected 1 to be null

[NoCoverage] BlockStatement
examenRegional/domain/examenRegionalDomain.js:376:27
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async create(_agregado) {
-    throw new Error('IExamenRegionalRepository.create() no implementado');
-  }
+  async create(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
examenRegional/domain/examenRegionalDomain.js:386:36
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async getByHistoria(_idHistoria) {
-    throw new Error('IExamenRegionalRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_idHistoria) {}
 
   /**

[NoCoverage] BlockStatement
examenRegional/domain/examenRegionalDomain.js:396:27
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IExamenRegionalRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 

[NoCoverage] StringLiteral
examenRegional/domain/examenRegionalDomain.js:397:21
    * @abstract
    */
   async update(_agregado) {
-    throw new Error('IExamenRegionalRepository.update() no implementado');
+    throw new Error("");
   }
 }
