[Killed] ConditionalExpression
filiacion/domain/filiacionDomain.js:23:9
    * @param {string} value UUID v4 de la historia clinica.
    */
   constructor(value) {
-    if (typeof value !== 'string') {
+    if (false) {
       throw new DomainError('La historia clinica debe ser un UUID v4 valido');
     }
killedBy: IdHistoriaClinicaVO valores límite lanza para null
statusReason: expected [Function] to throw error including 'La historia clinica debe ser un UUID …' but got 'Cannot read properties of null (readi…'

[Killed] StringLiteral
filiacion/domain/filiacionDomain.js:24:29
    */
   constructor(value) {
     if (typeof value !== 'string') {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
+      throw new DomainError("");
     }
 
killedBy: IdHistoriaClinicaVO valores límite lanza para null
statusReason: expected [Function] to throw error including 'La historia clinica debe ser un UUID …' but got ''

[Killed] Regex
filiacion/domain/filiacionDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO — anchors de regex (kills ^ y $ mutants) lanza para UUID con carácter extra al final (kills $ anchor)
statusReason: expected [Function] to throw an error

[Killed] Regex
filiacion/domain/filiacionDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[^0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO camino feliz acepta y normaliza UUID v4 con espacios y mayúsculas
statusReason: La historia clinica debe ser un UUID v4 valido

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:31:47
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!uuidV4Pattern.test(normalizedValue)) {
-      throw new DomainError('La historia clinica debe ser un UUID v4 valido');
-    }
+    if (!uuidV4Pattern.test(normalizedValue)) {}
 
     this.value = normalizedValue;
killedBy: IdHistoriaClinicaVO valores límite lanza para cadena vacía
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:47:22
   /**
    * @param {number|string|null|undefined} value Edad del paciente.
    */
-  constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-
-    const parsedValue = Number(value);
-    if (
-      !Number.isInteger(parsedValue) ||
-      parsedValue < 0 ||
-      parsedValue > 130
-    ) {
-      throw new DomainError('La edad clinica debe ser un entero entre 0 y 130');
-    }
-
-    this.value = parsedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: EdadClinicaVO camino feliz acepta entero number
statusReason: expected undefined to be 25 // Object.is equality

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:48:64
    * @param {number|string|null|undefined} value Edad del paciente.
    */
   constructor(value) {
-    if (value === null || value === undefined || value === '') {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
+    if (value === null || value === undefined || value === '') {}
 
     const parsedValue = Number(value);
killedBy: EdadClinicaVO nulos y vacíos (nullable) null -> .value === null
statusReason: expected +0 to be null

[Killed] BooleanLiteral
filiacion/domain/filiacionDomain.js:56:7
 
     const parsedValue = Number(value);
     if (
-      !Number.isInteger(parsedValue) ||
+      Number.isInteger(parsedValue) ||
       parsedValue < 0 ||
       parsedValue > 130
killedBy: EdadClinicaVO camino feliz acepta entero number
statusReason: La edad clinica debe ser un entero entre 0 y 130

[Killed] LogicalOperator
filiacion/domain/filiacionDomain.js:56:7
 
     const parsedValue = Number(value);
     if (
-      !Number.isInteger(parsedValue) ||
-      parsedValue < 0 ||
+      !Number.isInteger(parsedValue) && parsedValue < 0 ||
       parsedValue > 130
     ) {
killedBy: EdadClinicaVO valores límite min-1 (-1) debe fallar
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
filiacion/domain/filiacionDomain.js:57:7
     const parsedValue = Number(value);
     if (
       !Number.isInteger(parsedValue) ||
-      parsedValue < 0 ||
+      parsedValue >= 0 ||
       parsedValue > 130
     ) {
killedBy: EdadClinicaVO camino feliz acepta entero number
statusReason: La edad clinica debe ser un entero entre 0 y 130

[Killed] EqualityOperator
filiacion/domain/filiacionDomain.js:57:7
     const parsedValue = Number(value);
     if (
       !Number.isInteger(parsedValue) ||
-      parsedValue < 0 ||
+      parsedValue <= 0 ||
       parsedValue > 130
     ) {
killedBy: EdadClinicaVO valores límite min (0) debe pasar
statusReason: La edad clinica debe ser un entero entre 0 y 130

[Killed] ConditionalExpression
filiacion/domain/filiacionDomain.js:58:7
     if (
       !Number.isInteger(parsedValue) ||
       parsedValue < 0 ||
-      parsedValue > 130
+      false
     ) {
       throw new DomainError('La edad clinica debe ser un entero entre 0 y 130');
killedBy: EdadClinicaVO valores límite max+1 (131) debe fallar
statusReason: expected [Function] to throw an error

[Killed] EqualityOperator
filiacion/domain/filiacionDomain.js:58:7
     if (
       !Number.isInteger(parsedValue) ||
       parsedValue < 0 ||
-      parsedValue > 130
+      parsedValue >= 130
     ) {
       throw new DomainError('La edad clinica debe ser un entero entre 0 y 130');
killedBy: EdadClinicaVO valores límite max (130) debe pasar
statusReason: La edad clinica debe ser un entero entre 0 y 130

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:59:7
       !Number.isInteger(parsedValue) ||
       parsedValue < 0 ||
       parsedValue > 130
-    ) {
-      throw new DomainError('La edad clinica debe ser un entero entre 0 y 130');
-    }
+    ) {}
 
     this.value = parsedValue;
killedBy: EdadClinicaVO valores límite min-1 (-1) debe fallar
statusReason: expected [Function] to throw an error

[Killed] LogicalOperator
filiacion/domain/filiacionDomain.js:77:9
    * @param {string} mensajeError Mensaje de error de validacion.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if ((value === null || value === undefined) && value === '') {
       this.value = null;
       Object.freeze(this);
killedBy: FechaClinicaVO nulos y vacíos (nullable) null -> .value === null
statusReason: expected '1970-01-01T00:00:00.000Z' to be null

[Killed] EqualityOperator
filiacion/domain/filiacionDomain.js:77:9
    * @param {string} mensajeError Mensaje de error de validacion.
    */
   constructor(value, mensajeError) {
-    if (value === null || value === undefined || value === '') {
+    if (value !== null || value === undefined || value === '') {
       this.value = null;
       Object.freeze(this);
killedBy: FechaClinicaVO camino feliz acepta ISO 8601 y normaliza con toISOString
statusReason: expected null to be '2020-01-02T00:00:00.000Z' // Object.is equality

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:196:25
    * @param {unknown} value Valor textual de entrada.
    * @returns {string|null}
    */
-  #normalizeText(value) {
-    if (value === null || value === undefined || value === '') {
-      return null;
-    }
-    return String(value).trim();
-  }
+  #normalizeText(value) {}
 
   /**
killedBy: FiliacionAggregate construcción válida construye con datos completos y normaliza texto
statusReason: El sexo clinico no tiene un valor permitido

[Killed] LogicalOperator
filiacion/domain/filiacionDomain.js:197:9
    * @returns {string|null}
    */
   #normalizeText(value) {
-    if (value === null || value === undefined || value === '') {
+    if (value === null && value === undefined || value === '') {
       return null;
     }
killedBy: FiliacionAggregate obtenerParametros() devuelve el array exacto y en el orden preciso
statusReason: expected [ …(20) ] to deeply equal [ …(20) ]

[Killed] LogicalOperator
filiacion/domain/filiacionDomain.js:197:9
    * @returns {string|null}
    */
   #normalizeText(value) {
-    if (value === null || value === undefined || value === '') {
+    if ((value === null || value === undefined) && value === '') {
       return null;
     }
killedBy: FiliacionAggregate obtenerParametros() devuelve el array exacto y en el orden preciso
statusReason: expected [ …(20) ] to deeply equal [ …(20) ]

[Killed] MethodExpression
filiacion/domain/filiacionDomain.js:200:12
     if (value === null || value === undefined || value === '') {
       return null;
     }
-    return String(value).trim();
+    return String(value);
   }
 
killedBy: FiliacionAggregate — normalizeText vacío y trim (kills mutants) campo raza con espacios se trimea antes de almacenarse en params[1]
statusReason: expected '  Mestizo  ' to be 'Mestizo' // Object.is equality

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:207:25
    * @param {unknown} value Valor de sexo de entrada.
    * @returns {string|null}
    */
-  #normalizeSexo(value) {
-    const normalizedValue = this.#normalizeText(value);
-    if (normalizedValue === null) {
-      return null;
-    }
-
-    const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
-    if (!allowedValues.includes(normalizedValue)) {
-      throw new DomainError('El sexo clinico no tiene un valor permitido');
-    }
-
-    return normalizedValue;
-  }
+  #normalizeSexo(value) {}
 
   /**
killedBy: FiliacionAggregate obtenerParametros() devuelve el array exacto y en el orden preciso
statusReason: expected [ …(20) ] to deeply equal [ …(20) ]

[Killed] ConditionalExpression
filiacion/domain/filiacionDomain.js:209:9
    */
   #normalizeSexo(value) {
     const normalizedValue = this.#normalizeText(value);
-    if (normalizedValue === null) {
+    if (false) {
       return null;
     }
killedBy: FiliacionAggregate obtenerParametros() cuando edad es null, el parámetro correspondiente es null
statusReason: El sexo clinico no tiene un valor permitido

[Killed] EqualityOperator
filiacion/domain/filiacionDomain.js:209:9
    */
   #normalizeSexo(value) {
     const normalizedValue = this.#normalizeText(value);
-    if (normalizedValue === null) {
+    if (normalizedValue !== null) {
       return null;
     }
killedBy: FiliacionAggregate obtenerParametros() devuelve el array exacto y en el orden preciso
statusReason: expected [ …(20) ] to deeply equal [ …(20) ]

[Killed] StringLiteral
filiacion/domain/filiacionDomain.js:213:33
       return null;
     }
 
-    const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
+    const allowedValues = ['M', "", 'Masculino', 'Femenino', 'O'];
     if (!allowedValues.includes(normalizedValue)) {
       throw new DomainError('El sexo clinico no tiene un valor permitido');
killedBy: Whitelist Sexo (casos permitidos y no permitidos) acepta cada valor permitido individualmente
statusReason: El sexo clinico no tiene un valor permitido

[Killed] StringLiteral
filiacion/domain/filiacionDomain.js:213:63
       return null;
     }
 
-    const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
+    const allowedValues = ['M', 'F', 'Masculino', 'Femenino', ""];
     if (!allowedValues.includes(normalizedValue)) {
       throw new DomainError('El sexo clinico no tiene un valor permitido');
killedBy: Whitelist Sexo (casos permitidos y no permitidos) acepta cada valor permitido individualmente
statusReason: El sexo clinico no tiene un valor permitido

[Killed] ConditionalExpression
filiacion/domain/filiacionDomain.js:214:9
     }
 
     const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
-    if (!allowedValues.includes(normalizedValue)) {
+    if (false) {
       throw new DomainError('El sexo clinico no tiene un valor permitido');
     }
killedBy: FiliacionAggregate propagación de errores de VOs propaga error de sexo no permitido
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
filiacion/domain/filiacionDomain.js:214:9
     }
 
     const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
-    if (!allowedValues.includes(normalizedValue)) {
+    if (allowedValues.includes(normalizedValue)) {
       throw new DomainError('El sexo clinico no tiene un valor permitido');
     }
killedBy: FiliacionAggregate construcción válida construye con datos completos y normaliza texto
statusReason: El sexo clinico no tiene un valor permitido

[Killed] StringLiteral
filiacion/domain/filiacionDomain.js:215:29
 
     const allowedValues = ['M', 'F', 'Masculino', 'Femenino', 'O'];
     if (!allowedValues.includes(normalizedValue)) {
-      throw new DomainError('El sexo clinico no tiene un valor permitido');
+      throw new DomainError("");
     }
 
killedBy: FiliacionAggregate propagación de errores de VOs propaga error de sexo no permitido
statusReason: expected [Function] to throw error including 'El sexo clinico no tiene un valor per…' but got ''

[Killed] BlockStatement
filiacion/domain/filiacionDomain.js:225:23
    * Devuelve los parametros en orden posicional para procedimientos SQL.
    * @returns {Array<unknown>}
    */
-  obtenerParametros() {
-    return [
-      this.#idHistoria.value,
-      this.#raza,
-      this.#fechaNacimiento.value,
-      this.#lugar,
-      this.#estadoCivil,
-      this.#nombreConyuge,
-      this.#ocupacion,
-      this.#lugarProcedencia,
-      this.#tiempoResidenciaTacna,
-      this.#direccion,
-      this.#ultimaVisitaDentista,
-      this.#motivoVisitaDentista,
-      this.#ultimaVisitaMedico,
-      this.#motivoVisitaMedico,
-      this.#contactoEmergencia,
-      this.#telefonoEmergencia,
-      this.#acompaniante,
-      this.#edad.value,
-      this.#sexo,
-      this.#fechaElaboracion.value,
-    ];
-  }
+  obtenerParametros() {}
 
   /**
killedBy: FiliacionAggregate obtenerParametros() devuelve el array exacto y en el orden preciso
statusReason: expected undefined to deeply equal [ …(20) ]

[NoCoverage] BlockStatement
filiacion/domain/filiacionDomain.js:272:27
    * @returns {Promise<{success: boolean, id_historia: string}>}
    * @abstract
    */
-  async create(_agregado) {
-    throw new Error('IFiliacionRepository.create() no implementado');
-  }
+  async create(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
filiacion/domain/filiacionDomain.js:282:37
    * @returns {Promise<Object|undefined>}
    * @abstract
    */
-  async getByHistoria(_id_historia) {
-    throw new Error('IFiliacionRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_id_historia) {}
 
   /**

[NoCoverage] StringLiteral
filiacion/domain/filiacionDomain.js:283:21
    * @abstract
    */
   async getByHistoria(_id_historia) {
-    throw new Error('IFiliacionRepository.getByHistoria() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
filiacion/domain/filiacionDomain.js:292:27
    * @returns {Promise<{success: boolean, id_historia: string}>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IFiliacionRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 

[NoCoverage] StringLiteral
filiacion/domain/filiacionDomain.js:293:21
    * @abstract
    */
   async update(_agregado) {
-    throw new Error('IFiliacionRepository.update() no implementado');
+    throw new Error("");
   }
 }
