[Killed] Regex
hc/domain/hcDomain.js:6:3
  * Value Objects, DomainError y Aggregates. Sin SQL.
  */
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]$/i;
 
 export class DomainError extends Error {
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] Regex
hc/domain/hcDomain.js:6:3
  * Value Objects, DomainError y Aggregates. Sin SQL.
  */
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 export class DomainError extends Error {
killedBy: HistoriaClinicaIdValueObject invariantes — lanza DomainError UUID con carácter extra al inicio → lanza
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
hc/domain/hcDomain.js:9:24
   /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 export class DomainError extends Error {
-  constructor(message) {
-    super(message);
-    this.name = 'DomainError';
-    Object.freeze(this);
-  }
+  constructor(message) {}
 }
 
killedBy: DomainError es instancia de Error
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:17:37
 }
 
 class HcAggregateBase {
-  static _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
-      return null;
-    }
-    if (typeof value !== 'string') {
-      return value;
-    }
-    const text = value.trim();
-    return text === '' ? null : text;
-  }
+  static _normalizePrimitive(value) {}
 
   static _normalizeUuid(value, label) {
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Killed] EqualityOperator
hc/domain/hcDomain.js:18:9
 
 class HcAggregateBase {
   static _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
+    if (value !== null || value === undefined) {
       return null;
     }
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Killed] BlockStatement
hc/domain/hcDomain.js:18:48
 
 class HcAggregateBase {
   static _normalizePrimitive(value) {
-    if (value === null || value === undefined) {
-      return null;
-    }
+    if (value === null || value === undefined) {}
     if (typeof value !== 'string') {
       return value;
killedBy: HcAggregateBase._normalizePrimitive — ConditionalExpression mutants observations undefined → params[3] es null
statusReason: expected undefined to be null

[Killed] EqualityOperator
hc/domain/hcDomain.js:21:9
     if (value === null || value === undefined) {
       return null;
     }
-    if (typeof value !== 'string') {
+    if (typeof value === 'string') {
       return value;
     }
killedBy: HistoriaClinicaIdValueObject camino feliz trimea espacios
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] BlockStatement
hc/domain/hcDomain.js:21:36
     if (value === null || value === undefined) {
       return null;
     }
-    if (typeof value !== 'string') {
-      return value;
-    }
+    if (typeof value !== 'string') {}
     const text = value.trim();
     return text === '' ? null : text;
killedBy: HistoriaClinicaIdValueObject invariantes — lanza DomainError número → lanza
statusReason: expected error to be instance of DomainError

[Killed] MethodExpression
hc/domain/hcDomain.js:24:18
     if (typeof value !== 'string') {
       return value;
     }
-    const text = value.trim();
+    const text = value;
     return text === '' ? null : text;
   }
killedBy: HistoriaClinicaIdValueObject camino feliz trimea espacios
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] EqualityOperator
hc/domain/hcDomain.js:25:12
       return value;
     }
     const text = value.trim();
-    return text === '' ? null : text;
+    return text !== '' ? null : text;
   }
 
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Killed] ConditionalExpression
hc/domain/hcDomain.js:25:12
       return value;
     }
     const text = value.trim();
-    return text === '' ? null : text;
+    return false ? null : text;
   }
 
killedBy: EstadoRevisionValueObject invariantes — BVA longitud máxima 80 cadena vacía → lanza obligatorio
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
hc/domain/hcDomain.js:28:39
     return text === '' ? null : text;
   }
 
-  static _normalizeUuid(value, label) {
-    const normalized = this._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
-      throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
-    }
-    const cleaned = normalized.toUpperCase().startsWith('HC-')
-      ? normalized.slice(3).trim()
-      : normalized;
-    if (!UUID_V4_REGEX.test(cleaned)) {
-      throw new DomainError(`${label} debe ser un UUIDv4 válido`);
-    }
-    return cleaned.toLowerCase();
-  }
+  static _normalizeUuid(value, label) {}
 }
 
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BlockStatement
hc/domain/hcDomain.js:30:41
 
   static _normalizeUuid(value, label) {
     const normalized = this._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
-      throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
-    }
+    if (typeof normalized !== 'string') {}
     const cleaned = normalized.toUpperCase().startsWith('HC-')
       ? normalized.slice(3).trim()
killedBy: HistoriaClinicaIdValueObject invariantes — lanza DomainError null → lanza (no es string)
statusReason: expected error to be instance of DomainError

[Killed] EqualityOperator
hc/domain/hcDomain.js:30:9
 
   static _normalizeUuid(value, label) {
     const normalized = this._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
+    if (typeof normalized === 'string') {
       throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
     }
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Killed] MethodExpression
hc/domain/hcDomain.js:33:21
     if (typeof normalized !== 'string') {
       throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
     }
-    const cleaned = normalized.toUpperCase().startsWith('HC-')
+    const cleaned = normalized.toLowerCase().startsWith('HC-')
       ? normalized.slice(3).trim()
       : normalized;
killedBy: HistoriaClinicaIdValueObject camino feliz elimina prefijo HC- y devuelve UUID limpio
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] MethodExpression
hc/domain/hcDomain.js:33:21
     if (typeof normalized !== 'string') {
       throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
     }
-    const cleaned = normalized.toUpperCase().startsWith('HC-')
+    const cleaned = normalized.toUpperCase().endsWith('HC-')
       ? normalized.slice(3).trim()
       : normalized;
killedBy: HistoriaClinicaIdValueObject camino feliz elimina prefijo HC- y devuelve UUID limpio
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] MethodExpression
hc/domain/hcDomain.js:34:9
       throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
     }
     const cleaned = normalized.toUpperCase().startsWith('HC-')
-      ? normalized.slice(3).trim()
+      ? normalized.trim()
       : normalized;
     if (!UUID_V4_REGEX.test(cleaned)) {
killedBy: HistoriaClinicaIdValueObject camino feliz elimina prefijo HC- y devuelve UUID limpio
statusReason: id_historia debe ser un UUIDv4 válido

[Survived] MethodExpression
hc/domain/hcDomain.js:34:9
       throw new DomainError(`${label} debe ser una cadena UUIDv4 válida`);
     }
     const cleaned = normalized.toUpperCase().startsWith('HC-')
-      ? normalized.slice(3).trim()
+      ? normalized.slice(3)
       : normalized;
     if (!UUID_V4_REGEX.test(cleaned)) {

[Killed] ConditionalExpression
hc/domain/hcDomain.js:36:9
     const cleaned = normalized.toUpperCase().startsWith('HC-')
       ? normalized.slice(3).trim()
       : normalized;
-    if (!UUID_V4_REGEX.test(cleaned)) {
+    if (true) {
       throw new DomainError(`${label} debe ser un UUIDv4 válido`);
     }
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] BooleanLiteral
hc/domain/hcDomain.js:36:9
     const cleaned = normalized.toUpperCase().startsWith('HC-')
       ? normalized.slice(3).trim()
       : normalized;
-    if (!UUID_V4_REGEX.test(cleaned)) {
+    if (UUID_V4_REGEX.test(cleaned)) {
       throw new DomainError(`${label} debe ser un UUIDv4 válido`);
     }
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: id_historia debe ser un UUIDv4 válido

[Killed] StringLiteral
hc/domain/hcDomain.js:37:29
       ? normalized.slice(3).trim()
       : normalized;
     if (!UUID_V4_REGEX.test(cleaned)) {
-      throw new DomainError(`${label} debe ser un UUIDv4 válido`);
+      throw new DomainError(``);
     }
     return cleaned.toLowerCase();
killedBy: HistoriaClinicaIdValueObject — mensajes exactos (mata StringLiteral) cadena no-UUID → mensaje "debe ser un UUIDv4 válido"
statusReason: expected [Function] to throw error including 'id_historia debe ser un UUIDv4 válido' but got ''

[Killed] MethodExpression
hc/domain/hcDomain.js:39:12
     if (!UUID_V4_REGEX.test(cleaned)) {
       throw new DomainError(`${label} debe ser un UUIDv4 válido`);
     }
-    return cleaned.toLowerCase();
+    return cleaned.toUpperCase();
   }
 }
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: expected '550E8400-E29B-41D4-A716-446655440000' to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] BlockStatement
hc/domain/hcDomain.js:44:45
 }
 
 export class HistoriaClinicaIdValueObject extends HcAggregateBase {
-  constructor(value, label = 'id_historia') {
-    super();
-    this.value = HcAggregateBase._normalizeUuid(value, label);
-    Object.freeze(this);
-  }
+  constructor(value, label = 'id_historia') {}
 }
 
killedBy: HistoriaClinicaIdValueObject camino feliz acepta UUID v4 válido en minúsculas
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:52:44
 }
 
 export class UsuarioIdValueObject extends HcAggregateBase {
-  constructor(value, label = 'id_usuario') {
-    super();
-    this.value = HcAggregateBase._normalizeUuid(value, label);
-    Object.freeze(this);
-  }
+  constructor(value, label = 'id_usuario') {}
 }
 
killedBy: UsuarioIdValueObject camino feliz acepta UUID v4 válido
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:60:22
 }
 
 export class EstadoRevisionValueObject extends HcAggregateBase {
-  constructor(value) {
-    super();
-    const normalized = HcAggregateBase._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
-      throw new DomainError('El estado de la revisión es obligatorio');
-    }
-    if (normalized.length > 80) {
-      throw new DomainError('El estado de la revisión es demasiado largo');
-    }
-    this.value = normalized;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: EstadoRevisionValueObject camino feliz acepta estado válido
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:63:41
   constructor(value) {
     super();
     const normalized = HcAggregateBase._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
-      throw new DomainError('El estado de la revisión es obligatorio');
-    }
+    if (typeof normalized !== 'string') {}
     if (normalized.length > 80) {
       throw new DomainError('El estado de la revisión es demasiado largo');
killedBy: EstadoRevisionValueObject invariantes — BVA longitud máxima 80 null → lanza "El estado de la revisión es obligatorio"
statusReason: expected [Function] to throw error including 'El estado de la revisión es obligator…' but got 'Cannot read properties of null (readi…'

[Killed] EqualityOperator
hc/domain/hcDomain.js:63:9
   constructor(value) {
     super();
     const normalized = HcAggregateBase._normalizePrimitive(value);
-    if (typeof normalized !== 'string') {
+    if (typeof normalized === 'string') {
       throw new DomainError('El estado de la revisión es obligatorio');
     }
killedBy: EstadoRevisionValueObject camino feliz acepta estado válido
statusReason: El estado de la revisión es obligatorio

[Killed] ConditionalExpression
hc/domain/hcDomain.js:66:9
     if (typeof normalized !== 'string') {
       throw new DomainError('El estado de la revisión es obligatorio');
     }
-    if (normalized.length > 80) {
+    if (true) {
       throw new DomainError('El estado de la revisión es demasiado largo');
     }
killedBy: EstadoRevisionValueObject camino feliz acepta estado válido
statusReason: El estado de la revisión es demasiado largo

[Killed] ConditionalExpression
hc/domain/hcDomain.js:66:9
     if (typeof normalized !== 'string') {
       throw new DomainError('El estado de la revisión es obligatorio');
     }
-    if (normalized.length > 80) {
+    if (false) {
       throw new DomainError('El estado de la revisión es demasiado largo');
     }
killedBy: EstadoRevisionValueObject invariantes — BVA longitud máxima 80 estado de 81 caracteres → lanza "El estado de la revisión es demasiado largo"
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
hc/domain/hcDomain.js:75:27
 }
 
 export class RevisionHistoriaClinicaAggregate extends HcAggregateBase {
-  constructor(datos = {}) {
-    super();
-    const { idHistory, idTeacher, state, observations } = datos;
-    this._idHistory = new HistoriaClinicaIdValueObject(
-      idHistory,
-      'id_historia'
-    );
-    this._idTeacher = new UsuarioIdValueObject(idTeacher, 'id_docente');
-    this._state = new EstadoRevisionValueObject(state);
-    this._observations = HcAggregateBase._normalizePrimitive(observations);
-    Object.freeze(this);
-  }
+  constructor(datos = {}) {}
 
   obtenerParametros() {
killedBy: RevisionHistoriaClinicaAggregate construcción válida construye con todos los campos
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:88:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [
-      this._idHistory.value,
-      this._idTeacher.value,
-      this._state.value,
-      this._observations,
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: RevisionHistoriaClinicaAggregate obtenerParametros() — 4 parámetros devuelve [idHistory, idTeacher, state, observations]
statusReason: expected undefined to deeply equal [ …(4) ]

[Killed] BlockStatement
hc/domain/hcDomain.js:99:27
 }
 
 export class RegistroHistoriaClinicaAggregate extends HcAggregateBase {
-  constructor(datos = {}) {
-    super();
-    const { idStudent } = datos;
-    this._idStudent = new UsuarioIdValueObject(idStudent, 'id_estudiante');
-    Object.freeze(this);
-  }
+  constructor(datos = {}) {}
 
   obtenerParametros() {
killedBy: RegistroHistoriaClinicaAggregate construcción válida construye con idStudent válido
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Survived] StringLiteral
hc/domain/hcDomain.js:102:59
   constructor(datos = {}) {
     super();
     const { idStudent } = datos;
-    this._idStudent = new UsuarioIdValueObject(idStudent, 'id_estudiante');
+    this._idStudent = new UsuarioIdValueObject(idStudent, "");
     Object.freeze(this);
   }

[Killed] BlockStatement
hc/domain/hcDomain.js:106:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [this._idStudent.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: RegistroHistoriaClinicaAggregate obtenerParametros() — 1 parámetro devuelve [idStudent]
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] BlockStatement
hc/domain/hcDomain.js:112:27
 }
 
 export class AsignacionPacienteAggregate extends HcAggregateBase {
-  constructor(datos = {}) {
-    super();
-    const { idHistory, idPatient } = datos;
-    this._idHistory = new HistoriaClinicaIdValueObject(
-      idHistory,
-      'id_historia'
-    );
-    this._idPatient = new HistoriaClinicaIdValueObject(
-      idPatient,
-      'id_paciente'
-    );
-    Object.freeze(this);
-  }
+  constructor(datos = {}) {}
 
   obtenerParametros() {
killedBy: AsignacionPacienteAggregate construcción válida construye con idHistory y idPatient válidos
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] BlockStatement
hc/domain/hcDomain.js:126:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [this._idHistory.value, this._idPatient.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: AsignacionPacienteAggregate obtenerParametros() — 2 parámetros devuelve [idHistory, idPatient]
statusReason: expected undefined to deeply equal [ …(2) ]

[Killed] BlockStatement
hc/domain/hcDomain.js:132:27
 }
 
 export class ConsultaPacienteHistoriaClinicaAggregate extends HcAggregateBase {
-  constructor(datos = {}) {
-    super();
-    const { idHistory, id, id_historia } = datos;
-    this._idHistory = new HistoriaClinicaIdValueObject(
-      idHistory ?? id_historia ?? id,
-      'id_historia'
-    );
-    Object.freeze(this);
-  }
+  constructor(datos = {}) {}
 
   obtenerParametros() {
killedBy: ConsultaPacienteHistoriaClinicaAggregate aliases de id_historia acepta idHistory
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
hc/domain/hcDomain.js:136:7
     super();
     const { idHistory, id, id_historia } = datos;
     this._idHistory = new HistoriaClinicaIdValueObject(
-      idHistory ?? id_historia ?? id,
+      idHistory && id_historia ?? id,
       'id_historia'
     );
killedBy: ConsultaPacienteHistoriaClinicaAggregate aliases de id_historia acepta idHistory
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Killed] LogicalOperator
hc/domain/hcDomain.js:136:7
     super();
     const { idHistory, id, id_historia } = datos;
     this._idHistory = new HistoriaClinicaIdValueObject(
-      idHistory ?? id_historia ?? id,
+      (idHistory ?? id_historia) && id,
       'id_historia'
     );
killedBy: ConsultaPacienteHistoriaClinicaAggregate aliases de id_historia acepta idHistory
statusReason: id_historia debe ser una cadena UUIDv4 válida

[Survived] StringLiteral
hc/domain/hcDomain.js:137:7
     const { idHistory, id, id_historia } = datos;
     this._idHistory = new HistoriaClinicaIdValueObject(
       idHistory ?? id_historia ?? id,
-      'id_historia'
+      ""
     );
     Object.freeze(this);

[Killed] BlockStatement
hc/domain/hcDomain.js:142:23
     Object.freeze(this);
   }
 
-  obtenerParametros() {
-    return [this._idHistory.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: ConsultaPacienteHistoriaClinicaAggregate aliases de id_historia acepta idHistory
statusReason: expected undefined to deeply equal [ Array(1) ]

[Killed] ArrayDeclaration
hc/domain/hcDomain.js:143:12
   }
 
   obtenerParametros() {
-    return [this._idHistory.value];
+    return [];
   }
 }
killedBy: ConsultaPacienteHistoriaClinicaAggregate aliases de id_historia acepta idHistory
statusReason: expected [] to deeply equal [ Array(1) ]

[Killed] BlockStatement
hc/domain/hcDomain.js:148:27
 }
 
 export class ConsultaHistoriasEstudianteAggregate extends HcAggregateBase {
-  constructor(datos = {}) {
-    super();
-    const { idStudent, id } = datos;
-    this._idStudent = new UsuarioIdValueObject(
-      idStudent ?? id,
-      'id_estudiante'
-    );
-    Object.freeze(this);
-  }
+  constructor(datos = {}) {}
 
   obtenerParametros() {
killedBy: ConsultaHistoriasEstudianteAggregate aliases de idStudent acepta idStudent
statusReason: Must call super constructor in derived class before accessing 'this' or returning from derived constructor

[Killed] LogicalOperator
hc/domain/hcDomain.js:152:7
     super();
     const { idStudent, id } = datos;
     this._idStudent = new UsuarioIdValueObject(
-      idStudent ?? id,
+      idStudent && id,
       'id_estudiante'
     );
killedBy: ConsultaHistoriasEstudianteAggregate aliases de idStudent acepta idStudent
statusReason: id_estudiante debe ser una cadena UUIDv4 válida

[Survived] StringLiteral
hc/domain/hcDomain.js:153:7
     const { idStudent, id } = datos;
     this._idStudent = new UsuarioIdValueObject(
       idStudent ?? id,
-      'id_estudiante'
+      ""
     );
     Object.freeze(this);

[Killed] ArrayDeclaration
hc/domain/hcDomain.js:159:12
   }
 
   obtenerParametros() {
-    return [this._idStudent.value];
+    return [];
   }
 }
killedBy: ConsultaHistoriasEstudianteAggregate aliases de idStudent acepta idStudent
statusReason: expected [] to deeply equal [ Array(1) ]

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:177:34
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async crearRevision(_agregado) {
-    throw new Error('IHcRepository.crearRevision() no implementado');
-  }
+  async crearRevision(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:187:41
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async crearHistoriaClinica(_agregado) {
-    throw new Error('IHcRepository.crearHistoriaClinica() no implementado');
-  }
+  async crearHistoriaClinica(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:197:49
    * @returns {Promise<Array>}
    * @abstract
    */
-  async listarHistoriasPorEstudiante(_agregado) {
-    throw new Error('IHcRepository.listarHistoriasPorEstudiante() no implementado');
-  }
+  async listarHistoriasPorEstudiante(_agregado) {}
 
   /**

[NoCoverage] StringLiteral
hc/domain/hcDomain.js:198:21
    * @abstract
    */
   async listarHistoriasPorEstudiante(_agregado) {
-    throw new Error('IHcRepository.listarHistoriasPorEstudiante() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:207:36
    * @returns {Promise<{id_historia: string}>}
    * @abstract
    */
-  async obtenerBorrador(_agregado) {
-    throw new Error('IHcRepository.obtenerBorrador() no implementado');
-  }
+  async obtenerBorrador(_agregado) {}
 
   /**

[NoCoverage] StringLiteral
hc/domain/hcDomain.js:208:21
    * @abstract
    */
   async obtenerBorrador(_agregado) {
-    throw new Error('IHcRepository.obtenerBorrador() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:217:36
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async asignarPaciente(_agregado) {
-    throw new Error('IHcRepository.asignarPaciente() no implementado');
-  }
+  async asignarPaciente(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
hc/domain/hcDomain.js:227:47
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async obtenerPacientePorHistoria(_agregado) {
-    throw new Error('IHcRepository.obtenerPacientePorHistoria() no implementado');
-  }
+  async obtenerPacientePorHistoria(_agregado) {}
 }
 
