[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:9:22
 }
 
 class IdHistoriaValueObject {
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
-    }
-    const text = HigieneBocalAggregate._normalizeHistoryId(value);
-    if (text === '') {
-      throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
-    }
-    const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(text)) {
-      throw new DomainError('id_historia inválido: formato UUIDv4 esperado');
-    }
-    this.value = text;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: HigieneBocalAggregate obtenerParametros() — orden y valores exactos devuelve 3 parámetros: [idHistoria, estadoHigiene, idUsuario]
statusReason: expected [ undefined, 'Buena', …(1) ] to deeply equal [ …(3) ]

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:10:36
 
 class IdHistoriaValueObject {
   constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
-    }
+    if (typeof value !== 'string') {}
     const text = HigieneBocalAggregate._normalizeHistoryId(value);
     if (text === '') {
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idHistory null → lanza (no es string)
statusReason: expected [Function] to throw error including 'id_historia inválido: debe ser una ca…' but got 'id_historia inválido: formato UUIDv4 …'

[Killed] StringLiteral
higieneBocal/domain/higieneBocalDomain.js:11:29
 class IdHistoriaValueObject {
   constructor(value) {
     if (typeof value !== 'string') {
-      throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
+      throw new DomainError("");
     }
     const text = HigieneBocalAggregate._normalizeHistoryId(value);
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idHistory null → lanza (no es string)
statusReason: expected [Function] to throw error including 'id_historia inválido: debe ser una ca…' but got ''

[Killed] EqualityOperator
higieneBocal/domain/higieneBocalDomain.js:14:9
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
     const text = HigieneBocalAggregate._normalizeHistoryId(value);
-    if (text === '') {
+    if (text !== '') {
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: debe ser una cadena UUIDv4

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:14:9
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
     const text = HigieneBocalAggregate._normalizeHistoryId(value);
-    if (text === '') {
+    if (true) {
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: debe ser una cadena UUIDv4

[Killed] Regex
higieneBocal/domain/higieneBocalDomain.js:18:7
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]$/i;
     if (!re.test(text)) {
       throw new DomainError('id_historia inválido: formato UUIDv4 esperado');
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: formato UUIDv4 esperado

[Killed] Regex
higieneBocal/domain/higieneBocalDomain.js:18:7
       throw new DomainError('id_historia inválido: debe ser una cadena UUIDv4');
     }
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(text)) {
       throw new DomainError('id_historia inválido: formato UUIDv4 esperado');
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: formato UUIDv4 esperado

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:19:9
     }
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(text)) {
+    if (false) {
       throw new DomainError('id_historia inválido: formato UUIDv4 esperado');
     }
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idHistory formato inválido → lanza
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:19:25
     }
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(text)) {
-      throw new DomainError('id_historia inválido: formato UUIDv4 esperado');
-    }
+    if (!re.test(text)) {}
     this.value = text;
     Object.freeze(this);
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idHistory formato inválido → lanza
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:28:22
 }
 
 class EstadoHigieneValueObject {
-  constructor(value) {
-    if (value === null || value === undefined) {
-      throw new DomainError('estadoHigiene inválido: no puede estar vacío');
-    }
-    const text = String(value).trim();
-    if (text === '') {
-      throw new DomainError('estadoHigiene inválido: no puede estar vacío');
-    }
-    this.value = text;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: expected undefined to be 'Buena' // Object.is equality

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:29:48
 
 class EstadoHigieneValueObject {
   constructor(value) {
-    if (value === null || value === undefined) {
-      throw new DomainError('estadoHigiene inválido: no puede estar vacío');
-    }
+    if (value === null || value === undefined) {}
     const text = String(value).trim();
     if (text === '') {
killedBy: HigieneBocalAggregate invariantes — lanza DomainError estadoHigiene null → lanza
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
higieneBocal/domain/higieneBocalDomain.js:30:29
 class EstadoHigieneValueObject {
   constructor(value) {
     if (value === null || value === undefined) {
-      throw new DomainError('estadoHigiene inválido: no puede estar vacío');
+      throw new DomainError("");
     }
     const text = String(value).trim();
killedBy: HigieneBocalAggregate invariantes — lanza DomainError estadoHigiene null → lanza
statusReason: expected [Function] to throw error including 'estadoHigiene inválido: no puede esta…' but got ''

[Killed] MethodExpression
higieneBocal/domain/higieneBocalDomain.js:32:18
     if (value === null || value === undefined) {
       throw new DomainError('estadoHigiene inválido: no puede estar vacío');
     }
-    const text = String(value).trim();
+    const text = String(value);
     if (text === '') {
       throw new DomainError('estadoHigiene inválido: no puede estar vacío');
killedBy: HigieneBocalAggregate invariantes — lanza DomainError estadoHigiene solo espacios → lanza
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:33:9
       throw new DomainError('estadoHigiene inválido: no puede estar vacío');
     }
     const text = String(value).trim();
-    if (text === '') {
+    if (true) {
       throw new DomainError('estadoHigiene inválido: no puede estar vacío');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: estadoHigiene inválido: no puede estar vacío

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:33:22
       throw new DomainError('estadoHigiene inválido: no puede estar vacío');
     }
     const text = String(value).trim();
-    if (text === '') {
-      throw new DomainError('estadoHigiene inválido: no puede estar vacío');
-    }
+    if (text === '') {}
     this.value = text;
     Object.freeze(this);
killedBy: HigieneBocalAggregate invariantes — lanza DomainError estadoHigiene cadena vacía → lanza
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:42:57
 }
 
 class HigieneBocalAggregate {
-  constructor({ idHistory, body = {}, idUsuario } = {}) {
-    this._idHistory = new IdHistoriaValueObject(idHistory);
-    this._estadoHigiene = new EstadoHigieneValueObject(
-      body.estadoHigiene ?? body.estado_higiene
-    );
-    this._idUsuario = HigieneBocalAggregate._normalizeIdUsuario(
-      idUsuario ?? body.idUsuario ?? body.id_usuario
-    );
-  }
+  constructor({ idHistory, body = {}, idUsuario } = {}) {}
 
   static _normalizeHistoryId(value) {
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] LogicalOperator
higieneBocal/domain/higieneBocalDomain.js:45:7
   constructor({ idHistory, body = {}, idUsuario } = {}) {
     this._idHistory = new IdHistoriaValueObject(idHistory);
     this._estadoHigiene = new EstadoHigieneValueObject(
-      body.estadoHigiene ?? body.estado_higiene
+      body.estadoHigiene && body.estado_higiene
     );
     this._idUsuario = HigieneBocalAggregate._normalizeIdUsuario(
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: estadoHigiene inválido: no puede estar vacío

[Killed] LogicalOperator
higieneBocal/domain/higieneBocalDomain.js:48:7
       body.estadoHigiene ?? body.estado_higiene
     );
     this._idUsuario = HigieneBocalAggregate._normalizeIdUsuario(
-      idUsuario ?? body.idUsuario ?? body.id_usuario
+      idUsuario && body.idUsuario ?? body.id_usuario
     );
   }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: debe ser una cadena UUIDv4

[Killed] LogicalOperator
higieneBocal/domain/higieneBocalDomain.js:48:7
       body.estadoHigiene ?? body.estado_higiene
     );
     this._idUsuario = HigieneBocalAggregate._normalizeIdUsuario(
-      idUsuario ?? body.idUsuario ?? body.id_usuario
+      (idUsuario ?? body.idUsuario) && body.id_usuario
     );
   }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: debe ser una cadena UUIDv4

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:52:37
     );
   }
 
-  static _normalizeHistoryId(value) {
-    const text = String(value).trim();
-    if (text.toUpperCase().startsWith('HC-')) {
-      return text.slice(3).trim();
-    }
-    return text;
-  }
+  static _normalizeHistoryId(value) {}
 
   static _normalizeIdUsuario(value) {
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: formato UUIDv4 esperado

[Survived] MethodExpression
higieneBocal/domain/higieneBocalDomain.js:53:18
   }
 
   static _normalizeHistoryId(value) {
-    const text = String(value).trim();
+    const text = String(value);
     if (text.toUpperCase().startsWith('HC-')) {
       return text.slice(3).trim();

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:54:9
 
   static _normalizeHistoryId(value) {
     const text = String(value).trim();
-    if (text.toUpperCase().startsWith('HC-')) {
+    if (true) {
       return text.slice(3).trim();
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: id_historia inválido: formato UUIDv4 esperado

[Killed] MethodExpression
higieneBocal/domain/higieneBocalDomain.js:54:9
 
   static _normalizeHistoryId(value) {
     const text = String(value).trim();
-    if (text.toUpperCase().startsWith('HC-')) {
+    if (text.toLowerCase().startsWith('HC-')) {
       return text.slice(3).trim();
     }
killedBy: HigieneBocalAggregate construcción válida construye con prefijo HC- en idHistory
statusReason: id_historia inválido: formato UUIDv4 esperado

[Killed] MethodExpression
higieneBocal/domain/higieneBocalDomain.js:55:14
   static _normalizeHistoryId(value) {
     const text = String(value).trim();
     if (text.toUpperCase().startsWith('HC-')) {
-      return text.slice(3).trim();
+      return text.trim();
     }
     return text;
killedBy: HigieneBocalAggregate construcción válida construye con prefijo HC- en idHistory
statusReason: id_historia inválido: formato UUIDv4 esperado

[Survived] MethodExpression
higieneBocal/domain/higieneBocalDomain.js:55:14
   static _normalizeHistoryId(value) {
     const text = String(value).trim();
     if (text.toUpperCase().startsWith('HC-')) {
-      return text.slice(3).trim();
+      return text.slice(3);
     }
     return text;

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:60:37
     return text;
   }
 
-  static _normalizeIdUsuario(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
-    }
-    const text = value.trim();
-    if (text === '') {
-      throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
-    }
-    const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(text)) {
-      throw new DomainError('idUsuario inválido: formato UUIDv4 esperado');
-    }
-    return text;
-  }
+  static _normalizeIdUsuario(value) {}
 
   obtenerParametros() {
killedBy: HigieneBocalAggregate obtenerParametros() — orden y valores exactos devuelve 3 parámetros: [idHistoria, estadoHigiene, idUsuario]
statusReason: expected [ …(3) ] to deeply equal [ …(3) ]

[Killed] EqualityOperator
higieneBocal/domain/higieneBocalDomain.js:61:9
   }
 
   static _normalizeIdUsuario(value) {
-    if (typeof value !== 'string') {
+    if (typeof value === 'string') {
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: debe ser una cadena UUIDv4

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:61:9
   }
 
   static _normalizeIdUsuario(value) {
-    if (typeof value !== 'string') {
+    if (true) {
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalController.actualizarHigieneBucal returns 200 on success
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] ConditionalExpression
higieneBocal/domain/higieneBocalDomain.js:65:9
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
     const text = value.trim();
-    if (text === '') {
+    if (true) {
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: debe ser una cadena UUIDv4

[Killed] EqualityOperator
higieneBocal/domain/higieneBocalDomain.js:65:9
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
     const text = value.trim();
-    if (text === '') {
+    if (text !== '') {
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: debe ser una cadena UUIDv4

[Killed] Regex
higieneBocal/domain/higieneBocalDomain.js:69:7
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(text)) {
       throw new DomainError('idUsuario inválido: formato UUIDv4 esperado');
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: idUsuario inválido: formato UUIDv4 esperado

[Killed] Regex
higieneBocal/domain/higieneBocalDomain.js:69:7
       throw new DomainError('idUsuario inválido: debe ser una cadena UUIDv4');
     }
     const re =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(text)) {
       throw new DomainError('idUsuario inválido: formato UUIDv4 esperado');
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idUsuario UUID con carácter extra al inicio → lanza
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:70:25
     }
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-    if (!re.test(text)) {
-      throw new DomainError('idUsuario inválido: formato UUIDv4 esperado');
-    }
+    if (!re.test(text)) {}
     return text;
   }
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idUsuario con formato inválido → lanza
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
higieneBocal/domain/higieneBocalDomain.js:71:29
     const re =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
     if (!re.test(text)) {
-      throw new DomainError('idUsuario inválido: formato UUIDv4 esperado');
+      throw new DomainError("");
     }
     return text;
killedBy: HigieneBocalAggregate invariantes — lanza DomainError idUsuario con formato inválido → lanza
statusReason: expected [Function] to throw error including 'idUsuario inválido: formato UUIDv4 es…' but got ''

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:76:23
     return text;
   }
 
-  obtenerParametros() {
-    return [this._idHistory.value, this._estadoHigiene.value, this._idUsuario];
-  }
+  obtenerParametros() {}
 
   get estadoHigiene() {
killedBy: HigieneBocalAggregate obtenerParametros() — orden y valores exactos devuelve 3 parámetros: [idHistoria, estadoHigiene, idUsuario]
statusReason: expected undefined to deeply equal [ …(3) ]

[Killed] ArrayDeclaration
higieneBocal/domain/higieneBocalDomain.js:77:12
   }
 
   obtenerParametros() {
-    return [this._idHistory.value, this._estadoHigiene.value, this._idUsuario];
+    return [];
   }
 
killedBy: HigieneBocalAggregate obtenerParametros() — orden y valores exactos devuelve 3 parámetros: [idHistoria, estadoHigiene, idUsuario]
statusReason: expected [] to deeply equal [ …(3) ]

[Killed] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:80:23
     return [this._idHistory.value, this._estadoHigiene.value, this._idUsuario];
   }
 
-  get estadoHigiene() {
-    return this._estadoHigiene.value;
-  }
+  get estadoHigiene() {}
 }
 
killedBy: HigieneBocalAggregate construcción válida construye con estadoHigiene camelCase
statusReason: expected undefined to be 'Buena' // Object.is equality

[NoCoverage] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:99:42
    * @returns {Promise<{estadoHigiene: string}|null>}
    * @abstract
    */
-  async consultarPorHistoria(_idHistory) {
-    throw new Error('IHigieneBocalRepository.consultarPorHistoria() no implementado');
-  }
+  async consultarPorHistoria(_idHistory) {}
 
   /**

[NoCoverage] BlockStatement
higieneBocal/domain/higieneBocalDomain.js:109:50
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async actualizarHigieneBocal(_dataOrAggregate) {
-    throw new Error('IHigieneBocalRepository.actualizarHigieneBocal() no implementado');
-  }
+  async actualizarHigieneBocal(_dataOrAggregate) {}
 }
 

[NoCoverage] StringLiteral
higieneBocal/domain/higieneBocalDomain.js:110:21
    * @abstract
    */
   async actualizarHigieneBocal(_dataOrAggregate) {
-    throw new Error('IHigieneBocalRepository.actualizarHigieneBocal() no implementado');
+    throw new Error("");
   }
 }
