[Killed] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:11:24
  * Error de dominio para validar entradas
  */
 class DomainError extends Error {
-  constructor(message) {
-    super(message);
-    this.name = 'DomainError';
-    Object.freeze(this);
-  }
+  constructor(message) {}
 }
 
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 400 on DomainError (invalid UUID)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] Regex
listaHcAdultos/domain/listaHcAdultosDomain.js:22:3
  * Expresión regular para UUID v4 (case-insensitive)
  */
 const UUID_V4_REGEX =
-  /^[0-9a-f]{8}-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+  /^[0-9a-f]-[0-9a-f]{4}-[1-5][0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
 /**
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 200 with list
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:32:22
   /**
    * @param {string} value UUID v4
    */
-  constructor(value) {
-    if (typeof value !== 'string' || !UUID_V4_REGEX.test(value)) {
-      throw new DomainError('ID de estudiante inválido. Debe ser un UUID v4.');
-    }
-    this.value = value;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 400 on DomainError (invalid UUID)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:33:66
    * @param {string} value UUID v4
    */
   constructor(value) {
-    if (typeof value !== 'string' || !UUID_V4_REGEX.test(value)) {
-      throw new DomainError('ID de estudiante inválido. Debe ser un UUID v4.');
-    }
+    if (typeof value !== 'string' || !UUID_V4_REGEX.test(value)) {}
     this.value = value;
     Object.freeze(this);
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 400 on DomainError (invalid UUID)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
listaHcAdultos/domain/listaHcAdultosDomain.js:33:9
    * @param {string} value UUID v4
    */
   constructor(value) {
-    if (typeof value !== 'string' || !UUID_V4_REGEX.test(value)) {
+    if (false) {
       throw new DomainError('ID de estudiante inválido. Debe ser un UUID v4.');
     }
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 400 on DomainError (invalid UUID)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] StringLiteral
listaHcAdultos/domain/listaHcAdultosDomain.js:34:29
    */
   constructor(value) {
     if (typeof value !== 'string' || !UUID_V4_REGEX.test(value)) {
-      throw new DomainError('ID de estudiante inválido. Debe ser un UUID v4.');
+      throw new DomainError("");
     }
     this.value = value;
killedBy: IdUuidValueObject (listaHcAdultos) invariantes — lanza DomainError null → lanza (no es string)
statusReason: expected [Function] to throw error including 'ID de estudiante inválido. Debe ser u…' but got ''

[Killed] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:48:40
   /**
    * @param {{idEstudianteVO: IdUuidValueObject}} param0
    */
-  constructor({ idEstudianteVO } = {}) {
-    if (!(idEstudianteVO instanceof IdUuidValueObject)) {
-      throw new DomainError(
-        'idEstudianteVO es requerido y debe ser IdUuidValueObject'
-      );
-    }
-    this._idEstudiante = idEstudianteVO;
-    Object.freeze(this);
-  }
+  constructor({ idEstudianteVO } = {}) {}
 
   /**
killedBy: ListaHcAdultosAggregate obtenerParametros() — orden y valores exactos devuelve [uuid] — 1 parámetro
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BooleanLiteral
listaHcAdultos/domain/listaHcAdultosDomain.js:49:9
    * @param {{idEstudianteVO: IdUuidValueObject}} param0
    */
   constructor({ idEstudianteVO } = {}) {
-    if (!(idEstudianteVO instanceof IdUuidValueObject)) {
+    if (idEstudianteVO instanceof IdUuidValueObject) {
       throw new DomainError(
         'idEstudianteVO es requerido y debe ser IdUuidValueObject'
killedBy: ListaHcAdultosController.listarHistoriasClinicasAdultasDeEstudiante returns 200 with list
statusReason: expected "vi.fn()" to be called with arguments: [ 200 ]

Received: 

  1st vi.fn() call:

  [
-   200,

[Killed] ConditionalExpression
listaHcAdultos/domain/listaHcAdultosDomain.js:49:9
    * @param {{idEstudianteVO: IdUuidValueObject}} param0
    */
   constructor({ idEstudianteVO } = {}) {
-    if (!(idEstudianteVO instanceof IdUuidValueObject)) {
+    if (true) {
       throw new DomainError(
         'idEstudianteVO es requerido y debe ser IdUuidValueObject'
killedBy: ListaHcAdultosAggregate construcción válida construye con idEstudianteVO válido
statusReason: idEstudianteVO es requerido y debe ser IdUuidValueObject

[Killed] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:62:23
    * Retorna parámetros posicionales para llamadas a repositorio / BD
    * @returns {Array}
    */
-  obtenerParametros() {
-    return [this._idEstudiante.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: ListaHcAdultosAggregate obtenerParametros() — orden y valores exactos devuelve [uuid] — 1 parámetro
statusReason: expected undefined to deeply equal [ Array(1) ]

[NoCoverage] BlockStatement
listaHcAdultos/domain/listaHcAdultosDomain.js:81:41
    * @returns {Promise<Array>}
    * @abstract
    */
-  async listarPorEstudiante(_aggregate) {
-    throw new Error('IListaHcAdultosRepository.listarPorEstudiante() no implementado');
-  }
+  async listarPorEstudiante(_aggregate) {}
 }
 
