[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:22:22
   /**
    * @param {string} value UUID v4 de la historia clinica.
    */
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('id_historia debe ser un UUID valido');
-    }
-
-    const normalizedValue = value.trim().toLowerCase();
-    const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
-
-    if (!uuidV4Pattern.test(normalizedValue)) {
-      throw new DomainError('id_historia debe ser un UUID valido');
-    }
-
-    this.value = normalizedValue;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdHistoriaClinicaVO (motivoConsulta) camino feliz acepta UUID v4 en minúsculas
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] Regex
motivoConsulta/domain/motivoConsultaDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[^0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO (motivoConsulta) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia debe ser un UUID valido

[Killed] Regex
motivoConsulta/domain/motivoConsultaDomain.js:29:7
 
     const normalizedValue = value.trim().toLowerCase();
     const uuidV4Pattern =
-      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
+      /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]-[0-9a-f]{12}$/i;
 
     if (!uuidV4Pattern.test(normalizedValue)) {
killedBy: IdHistoriaClinicaVO (motivoConsulta) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia debe ser un UUID valido

[Killed] ConditionalExpression
motivoConsulta/domain/motivoConsultaDomain.js:31:9
     const uuidV4Pattern =
       /^[0-9a-f]{8}-[0-9a-f]{4}-4[0-9a-f]{3}-[89ab][0-9a-f]{3}-[0-9a-f]{12}$/i;
 
-    if (!uuidV4Pattern.test(normalizedValue)) {
+    if (true) {
       throw new DomainError('id_historia debe ser un UUID valido');
     }
killedBy: IdHistoriaClinicaVO (motivoConsulta) camino feliz acepta UUID v4 en minúsculas
statusReason: id_historia debe ser un UUID valido

[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:47:22
   /**
    * @param {unknown} value Texto de motivo.
    */
-  constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('motivo debe ser una cadena de texto');
-    }
-
-    const trimmed = value.trim();
-    if (trimmed.length === 0) {
-      throw new DomainError('motivo no puede estar vacio');
-    }
-
-    this.value = trimmed;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: MotivoConsultaVO camino feliz acepta texto y lo trimea
statusReason: expected undefined to be 'dolor' // Object.is equality

[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:48:36
    * @param {unknown} value Texto de motivo.
    */
   constructor(value) {
-    if (typeof value !== 'string') {
-      throw new DomainError('motivo debe ser una cadena de texto');
-    }
+    if (typeof value !== 'string') {}
 
     const trimmed = value.trim();
killedBy: MotivoConsultaVO invariante 1: no es string → MSG_TIPO null → lanza MSG_TIPO
statusReason: expected [Function] to throw error including 'motivo debe ser una cadena de texto' but got 'Cannot read properties of null (readi…'

[Killed] MethodExpression
motivoConsulta/domain/motivoConsultaDomain.js:52:21
       throw new DomainError('motivo debe ser una cadena de texto');
     }
 
-    const trimmed = value.trim();
+    const trimmed = value;
     if (trimmed.length === 0) {
       throw new DomainError('motivo no puede estar vacio');
killedBy: MotivoConsultaVO camino feliz acepta texto y lo trimea
statusReason: expected '  dolor  ' to be 'dolor' // Object.is equality

[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:73:45
   /**
    * @param {Object} input Datos para el agregado de motivo de consulta.
    */
-  constructor({ id_historia, motivo } = {}) {
-    this.#idHistoria = new IdHistoriaClinicaVO(id_historia);
-    this.#motivo = new MotivoConsultaVO(motivo);
-
-    Object.freeze(this);
-  }
+  constructor({ id_historia, motivo } = {}) {}
 
   /**
killedBy: MotivoConsultaAggregate construcción válida construye con id_historia y motivo
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:84:23
    * Devuelve los parametros en orden posicional para procedimientos SQL.
    * @returns {Array<unknown>}
    */
-  obtenerParametros() {
-    return [this.#idHistoria.value, this.#motivo.value];
-  }
+  obtenerParametros() {}
 
   /**
killedBy: MotivoConsultaAggregate obtenerParametros() — orden y valores exactos devuelve [id_historia, motivo] en ese orden exacto
statusReason: expected undefined to deeply equal [ …(2) ]

[Killed] ArrayDeclaration
motivoConsulta/domain/motivoConsultaDomain.js:85:12
    * @returns {Array<unknown>}
    */
   obtenerParametros() {
-    return [this.#idHistoria.value, this.#motivo.value];
+    return [];
   }
 
killedBy: MotivoConsultaAggregate obtenerParametros() — orden y valores exactos devuelve [id_historia, motivo] en ese orden exacto
statusReason: expected [] to deeply equal [ …(2) ]

[Killed] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:98:16
   /**
    * @returns {string}
    */
-  get motivo() {
-    return this.#motivo.value;
-  }
+  get motivo() {}
 }
 
killedBy: MotivoConsultaAggregate construcción válida construye con id_historia y motivo
statusReason: expected undefined to be 'Caries dental' // Object.is equality

[NoCoverage] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:117:27
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async create(_agregado) {
-    throw new Error('IMotivoConsultaRepository.create() no implementado');
-  }
+  async create(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:127:37
    * @returns {Promise<Object|undefined>}
    * @abstract
    */
-  async getByHistoria(_id_historia) {
-    throw new Error('IMotivoConsultaRepository.getByHistoria() no implementado');
-  }
+  async getByHistoria(_id_historia) {}
 
   /**

[NoCoverage] StringLiteral
motivoConsulta/domain/motivoConsultaDomain.js:128:21
    * @abstract
    */
   async getByHistoria(_id_historia) {
-    throw new Error('IMotivoConsultaRepository.getByHistoria() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
motivoConsulta/domain/motivoConsultaDomain.js:137:27
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async update(_agregado) {
-    throw new Error('IMotivoConsultaRepository.update() no implementado');
-  }
+  async update(_agregado) {}
 }
 

[NoCoverage] StringLiteral
motivoConsulta/domain/motivoConsultaDomain.js:138:21
    * @abstract
    */
   async update(_agregado) {
-    throw new Error('IMotivoConsultaRepository.update() no implementado');
+    throw new Error("");
   }
 }
