[Killed] BlockStatement
patient/domain/patientDomain.js:19:22
  * NombreValueObject
  */
 class NombreValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('nombre es requerido');
-    }
-    this.value = value.trim();
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: NombreValueObject camino feliz acepta nombre válido
statusReason: expected undefined to be 'Juan' // Object.is equality

[Killed] BlockStatement
patient/domain/patientDomain.js:20:65
  */
 class NombreValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('nombre es requerido');
-    }
+    if (typeof value !== 'string' || value.trim().length === 0) {}
     this.value = value.trim();
     Object.freeze(this);
killedBy: NombreValueObject invariantes — lanza DomainError null → lanza "nombre es requerido"
statusReason: expected [Function] to throw error including 'nombre es requerido' but got 'Cannot read properties of null (readi…'

[Killed] EqualityOperator
patient/domain/patientDomain.js:20:9
  */
 class NombreValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (typeof value === 'string' || value.trim().length === 0) {
       throw new DomainError('nombre es requerido');
     }
killedBy: PatientController.registrarPaciente returns 201 with id on success
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] MethodExpression
patient/domain/patientDomain.js:23:18
     if (typeof value !== 'string' || value.trim().length === 0) {
       throw new DomainError('nombre es requerido');
     }
-    this.value = value.trim();
+    this.value = value;
     Object.freeze(this);
   }
killedBy: NombreValueObject camino feliz trimea espacios
statusReason: expected '  María  ' to be 'María' // Object.is equality

[Killed] BlockStatement
patient/domain/patientDomain.js:32:22
  * ApellidoValueObject
  */
 class ApellidoValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('apellido es requerido');
-    }
-    this.value = value.trim();
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: PatientController.registrarPaciente returns 400 on DomainError (empty apellido)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] StringLiteral
patient/domain/patientDomain.js:34:29
 class ApellidoValueObject {
   constructor(value) {
     if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('apellido es requerido');
+      throw new DomainError("");
     }
     this.value = value.trim();
killedBy: ApellidoValueObject invariantes — lanza DomainError null → lanza "apellido es requerido"
statusReason: expected [Function] to throw error including 'apellido es requerido' but got ''

[Killed] BlockStatement
patient/domain/patientDomain.js:45:22
  * FechaNacimientoValueObject — acepta null o fecha válida
  */
 class FechaNacimientoValueObject {
-  constructor(value) {
-    if (!value) {
-      this.value = null;
-      Object.freeze(this);
-      return;
-    }
-    const d = new Date(value);
-    if (Number.isNaN(d.getTime())) {
-      throw new DomainError('fechaNacimiento inválida');
-    }
-    this.value = d.toISOString().split('T')[0];
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: FechaNacimientoValueObject camino feliz acepta fecha válida y devuelve formato YYYY-MM-DD
statusReason: expected undefined to be '1990-05-15' // Object.is equality

[Killed] ConditionalExpression
patient/domain/patientDomain.js:46:9
  */
 class FechaNacimientoValueObject {
   constructor(value) {
-    if (!value) {
+    if (false) {
       this.value = null;
       Object.freeze(this);
killedBy: FechaNacimientoValueObject camino feliz null → value = null (campo opcional)
statusReason: expected '1970-01-01' to be null

[Killed] StringLiteral
patient/domain/patientDomain.js:53:29
     }
     const d = new Date(value);
     if (Number.isNaN(d.getTime())) {
-      throw new DomainError('fechaNacimiento inválida');
+      throw new DomainError("");
     }
     this.value = d.toISOString().split('T')[0];
killedBy: FechaNacimientoValueObject invariantes — lanza DomainError fecha inválida → lanza "fechaNacimiento inválida"
statusReason: expected [Function] to throw error including 'fechaNacimiento inválida' but got ''

[Killed] BlockStatement
patient/domain/patientDomain.js:64:22
  * IdUuidValueObject — valida longitud y formato básico de UUID
  */
 class IdUuidValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.length !== 36) {
-      throw new DomainError('ID de paciente inválido');
-    }
-    this.value = value;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: IdUuidValueObject (patient) camino feliz acepta string de exactamente 36 caracteres
statusReason: expected undefined to be '550e8400-e29b-41d4-a716-446655440000' // Object.is equality

[Killed] LogicalOperator
patient/domain/patientDomain.js:65:9
  */
 class IdUuidValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.length !== 36) {
+    if (typeof value !== 'string' && value.length !== 36) {
       throw new DomainError('ID de paciente inválido');
     }
killedBy: PatientController.actualizarPaciente returns 400 on DomainError (invalid UUID)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] BlockStatement
patient/domain/patientDomain.js:65:59
  */
 class IdUuidValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.length !== 36) {
-      throw new DomainError('ID de paciente inválido');
-    }
+    if (typeof value !== 'string' || value.length !== 36) {}
     this.value = value;
     Object.freeze(this);
killedBy: IdUuidValueObject (patient) invariantes — BVA en longitud string de 35 caracteres → lanza "ID de paciente inválido"
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
patient/domain/patientDomain.js:66:29
 class IdUuidValueObject {
   constructor(value) {
     if (typeof value !== 'string' || value.length !== 36) {
-      throw new DomainError('ID de paciente inválido');
+      throw new DomainError("");
     }
     this.value = value;
killedBy: IdUuidValueObject (patient) invariantes — BVA en longitud string de 35 caracteres → lanza "ID de paciente inválido"
statusReason: expected [Function] to throw error including 'ID de paciente inválido' but got ''

[Killed] BlockStatement
patient/domain/patientDomain.js:85:11
     sexo,
     telefono,
     email,
-  } = {}) {
-    if (!(nombreVO instanceof NombreValueObject)) {
-      throw new DomainError('nombreVO inválido');
-    }
-    if (!(apellidoVO instanceof ApellidoValueObject)) {
-      throw new DomainError('apellidoVO inválido');
-    }
-    this._nombre = nombreVO;
-    this._apellido = apellidoVO;
-    this._dni = dni || null;
-    this._fechaNacimiento = fechaNacimientoVO || null;
-    this._sexo = sexo || null;
-    this._telefono = telefono || null;
-    this._email = email || null;
-    Object.freeze(this);
-  }
+  } = {}) {}
 
   obtenerParametrosParaCrear() {
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
patient/domain/patientDomain.js:86:9
     telefono,
     email,
   } = {}) {
-    if (!(nombreVO instanceof NombreValueObject)) {
+    if (false) {
       throw new DomainError('nombreVO inválido');
     }
killedBy: PatientAggregate propagación de errores lanza DomainError si nombreVO no es instancia de NombreValueObject
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
patient/domain/patientDomain.js:86:51
     telefono,
     email,
   } = {}) {
-    if (!(nombreVO instanceof NombreValueObject)) {
-      throw new DomainError('nombreVO inválido');
-    }
+    if (!(nombreVO instanceof NombreValueObject)) {}
     if (!(apellidoVO instanceof ApellidoValueObject)) {
       throw new DomainError('apellidoVO inválido');
killedBy: PatientAggregate propagación de errores lanza DomainError si nombreVO no es instancia de NombreValueObject
statusReason: expected function to throw an error, but it didn't

[Survived] StringLiteral
patient/domain/patientDomain.js:87:29
     email,
   } = {}) {
     if (!(nombreVO instanceof NombreValueObject)) {
-      throw new DomainError('nombreVO inválido');
+      throw new DomainError("");
     }
     if (!(apellidoVO instanceof ApellidoValueObject)) {

[Killed] ConditionalExpression
patient/domain/patientDomain.js:89:9
     if (!(nombreVO instanceof NombreValueObject)) {
       throw new DomainError('nombreVO inválido');
     }
-    if (!(apellidoVO instanceof ApellidoValueObject)) {
+    if (false) {
       throw new DomainError('apellidoVO inválido');
     }
killedBy: PatientAggregate propagación de errores lanza DomainError si apellidoVO no es instancia de ApellidoValueObject
statusReason: expected function to throw an error, but it didn't

[Killed] BlockStatement
patient/domain/patientDomain.js:89:55
     if (!(nombreVO instanceof NombreValueObject)) {
       throw new DomainError('nombreVO inválido');
     }
-    if (!(apellidoVO instanceof ApellidoValueObject)) {
-      throw new DomainError('apellidoVO inválido');
-    }
+    if (!(apellidoVO instanceof ApellidoValueObject)) {}
     this._nombre = nombreVO;
     this._apellido = apellidoVO;
killedBy: PatientAggregate propagación de errores lanza DomainError si apellidoVO no es instancia de ApellidoValueObject
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
patient/domain/patientDomain.js:94:17
     }
     this._nombre = nombreVO;
     this._apellido = apellidoVO;
-    this._dni = dni || null;
+    this._dni = false;
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', null, …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:94:17
     }
     this._nombre = nombreVO;
     this._apellido = apellidoVO;
-    this._dni = dni || null;
+    this._dni = true;
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', true, …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:95:29
     this._nombre = nombreVO;
     this._apellido = apellidoVO;
     this._dni = dni || null;
-    this._fechaNacimiento = fechaNacimientoVO || null;
+    this._fechaNacimiento = fechaNacimientoVO && null;
     this._sexo = sexo || null;
     this._telefono = telefono || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:95:29
     this._nombre = nombreVO;
     this._apellido = apellidoVO;
     this._dni = dni || null;
-    this._fechaNacimiento = fechaNacimientoVO || null;
+    this._fechaNacimiento = true;
     this._sexo = sexo || null;
     this._telefono = telefono || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:96:18
     this._apellido = apellidoVO;
     this._dni = dni || null;
     this._fechaNacimiento = fechaNacimientoVO || null;
-    this._sexo = sexo || null;
+    this._sexo = sexo && null;
     this._telefono = telefono || null;
     this._email = email || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:96:18
     this._apellido = apellidoVO;
     this._dni = dni || null;
     this._fechaNacimiento = fechaNacimientoVO || null;
-    this._sexo = sexo || null;
+    this._sexo = true;
     this._telefono = telefono || null;
     this._email = email || null;
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:97:22
     this._dni = dni || null;
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
-    this._telefono = telefono || null;
+    this._telefono = telefono && null;
     this._email = email || null;
     Object.freeze(this);
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:97:22
     this._dni = dni || null;
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
-    this._telefono = telefono || null;
+    this._telefono = false;
     this._email = email || null;
     Object.freeze(this);
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:98:19
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
     this._telefono = telefono || null;
-    this._email = email || null;
+    this._email = email && null;
     Object.freeze(this);
   }
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:98:19
     this._fechaNacimiento = fechaNacimientoVO || null;
     this._sexo = sexo || null;
     this._telefono = telefono || null;
-    this._email = email || null;
+    this._email = true;
     Object.freeze(this);
   }
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] BlockStatement
patient/domain/patientDomain.js:102:32
     Object.freeze(this);
   }
 
-  obtenerParametrosParaCrear() {
-    return [
-      this._nombre.value,
-      this._apellido.value,
-      this._dni || null,
-      this._fechaNacimiento ? this._fechaNacimiento.value : null,
-      this._sexo || null,
-      this._telefono || null,
-      this._email || null,
-    ];
-  }
+  obtenerParametrosParaCrear() {}
 
   obtenerParametrosParaActualizar() {
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected undefined to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:106:7
     return [
       this._nombre.value,
       this._apellido.value,
-      this._dni || null,
+      true,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', true, …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:106:7
     return [
       this._nombre.value,
       this._apellido.value,
-      this._dni || null,
+      this._dni && null,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', null, …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:108:7
       this._apellido.value,
       this._dni || null,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
-      this._sexo || null,
+      this._sexo && null,
       this._telefono || null,
       this._email || null,
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:108:7
       this._apellido.value,
       this._dni || null,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
-      this._sexo || null,
+      false,
       this._telefono || null,
       this._email || null,
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:109:7
       this._dni || null,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
-      this._telefono || null,
+      this._telefono && null,
       this._email || null,
     ];
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:109:7
       this._dni || null,
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
-      this._telefono || null,
+      true,
       this._email || null,
     ];
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:110:7
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
       this._telefono || null,
-      this._email || null,
+      this._email && null,
     ];
   }
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:110:7
       this._fechaNacimiento ? this._fechaNacimiento.value : null,
       this._sexo || null,
       this._telefono || null,
-      this._email || null,
+      true,
     ];
   }
killedBy: PatientAggregate obtenerParametrosParaCrear() — 7 parámetros devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '12345678', …(4) ] to deeply equal [ 'Juan', 'Pérez', '12345678', …(4) ]

[Killed] BlockStatement
patient/domain/patientDomain.js:114:37
     ];
   }
 
-  obtenerParametrosParaActualizar() {
-    return [
-      this._nombre ? this._nombre.value : null,
-      this._apellido ? this._apellido.value : null,
-      this._telefono || null,
-      this._email || null,
-    ];
-  }
+  obtenerParametrosParaActualizar() {}
 }
 
killedBy: PatientAggregate obtenerParametrosParaActualizar() — 4 parámetros devuelve 4 parámetros en el orden correcto
statusReason: expected undefined to deeply equal [ 'Juan', 'Pérez', '987654321', …(1) ]

[Killed] LogicalOperator
patient/domain/patientDomain.js:118:7
     return [
       this._nombre ? this._nombre.value : null,
       this._apellido ? this._apellido.value : null,
-      this._telefono || null,
+      this._telefono && null,
       this._email || null,
     ];
killedBy: PatientAggregate obtenerParametrosParaActualizar() — 4 parámetros devuelve 4 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', null, …(1) ] to deeply equal [ 'Juan', 'Pérez', '987654321', …(1) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:118:7
     return [
       this._nombre ? this._nombre.value : null,
       this._apellido ? this._apellido.value : null,
-      this._telefono || null,
+      true,
       this._email || null,
     ];
killedBy: PatientAggregate obtenerParametrosParaActualizar() — 4 parámetros devuelve 4 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', true, …(1) ] to deeply equal [ 'Juan', 'Pérez', '987654321', …(1) ]

[Killed] ConditionalExpression
patient/domain/patientDomain.js:119:7
       this._nombre ? this._nombre.value : null,
       this._apellido ? this._apellido.value : null,
       this._telefono || null,
-      this._email || null,
+      false,
     ];
   }
killedBy: PatientAggregate obtenerParametrosParaActualizar() — 4 parámetros devuelve 4 parámetros en el orden correcto
statusReason: expected [ 'Juan', 'Pérez', '987654321', false ] to deeply equal [ 'Juan', 'Pérez', '987654321', …(1) ]

[NoCoverage] BlockStatement
patient/domain/patientDomain.js:138:35
    * @returns {Promise<{id: string}>}
    * @abstract
    */
-  async crearPaciente(_aggregate) {
-    throw new Error('IPatientRepository.crearPaciente() no implementado');
-  }
+  async crearPaciente(_aggregate) {}
 
   /**

[NoCoverage] StringLiteral
patient/domain/patientDomain.js:139:21
    * @abstract
    */
   async crearPaciente(_aggregate) {
-    throw new Error('IPatientRepository.crearPaciente() no implementado');
+    throw new Error("");
   }
 

[NoCoverage] BlockStatement
patient/domain/patientDomain.js:149:45
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async actualizarPaciente(_id, _aggregate) {
-    throw new Error('IPatientRepository.actualizarPaciente() no implementado');
-  }
+  async actualizarPaciente(_id, _aggregate) {}
 }
 

[NoCoverage] StringLiteral
patient/domain/patientDomain.js:150:21
    * @abstract
    */
   async actualizarPaciente(_id, _aggregate) {
-    throw new Error('IPatientRepository.actualizarPaciente() no implementado');
+    throw new Error("");
   }
 }
