[Killed] BlockStatement
studentUsers/domain/studentUsersDomain.js:23:22
  * Value Object: Role (se espera 'estudiante')
  */
 class RoleValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('role es requerido');
-    }
-    const v = value.trim().toLowerCase();
-    if (v !== 'estudiante') {
-      throw new DomainError('role inválido — se espera "estudiante"');
-    }
-    this.value = v;
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: RoleValueObject camino feliz acepta "estudiante" en minúsculas
statusReason: expected undefined to be 'estudiante' // Object.is equality

[Killed] EqualityOperator
studentUsers/domain/studentUsersDomain.js:24:38
  */
 class RoleValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (typeof value !== 'string' || value.trim().length !== 0) {
       throw new DomainError('role es requerido');
     }
killedBy: main router should mount /student-users route
statusReason: expected [ 404, 401, 200, 500 ] to include 400

[Killed] StringLiteral
studentUsers/domain/studentUsersDomain.js:25:29
 class RoleValueObject {
   constructor(value) {
     if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('role es requerido');
+      throw new DomainError("");
     }
     const v = value.trim().toLowerCase();
killedBy: RoleValueObject invariantes — lanza DomainError null → lanza "role es requerido"
statusReason: expected [Function] to throw error including 'role es requerido' but got ''

[Killed] MethodExpression
studentUsers/domain/studentUsersDomain.js:27:15
     if (typeof value !== 'string' || value.trim().length === 0) {
       throw new DomainError('role es requerido');
     }
-    const v = value.trim().toLowerCase();
+    const v = value.trim().toUpperCase();
     if (v !== 'estudiante') {
       throw new DomainError('role inválido — se espera "estudiante"');
killedBy: main router should mount /student-users route
statusReason: expected [ 404, 401, 200, 500 ] to include 400

[Killed] MethodExpression
studentUsers/domain/studentUsersDomain.js:27:15
     if (typeof value !== 'string' || value.trim().length === 0) {
       throw new DomainError('role es requerido');
     }
-    const v = value.trim().toLowerCase();
+    const v = value.toLowerCase();
     if (v !== 'estudiante') {
       throw new DomainError('role inválido — se espera "estudiante"');
killedBy: RoleValueObject camino feliz trimea espacios antes de normalizar
statusReason: role inválido — se espera "estudiante"

[Killed] EqualityOperator
studentUsers/domain/studentUsersDomain.js:28:9
       throw new DomainError('role es requerido');
     }
     const v = value.trim().toLowerCase();
-    if (v !== 'estudiante') {
+    if (v === 'estudiante') {
       throw new DomainError('role inválido — se espera "estudiante"');
     }
killedBy: main router should mount /student-users route
statusReason: expected [ 404, 401, 200, 500 ] to include 400

[Killed] ConditionalExpression
studentUsers/domain/studentUsersDomain.js:28:9
       throw new DomainError('role es requerido');
     }
     const v = value.trim().toLowerCase();
-    if (v !== 'estudiante') {
+    if (false) {
       throw new DomainError('role inválido — se espera "estudiante"');
     }
killedBy: RoleValueObject invariantes — lanza DomainError "docente" → lanza "role inválido — se espera estudiante"
statusReason: expected [Function] to throw an error

[Killed] StringLiteral
studentUsers/domain/studentUsersDomain.js:29:29
     }
     const v = value.trim().toLowerCase();
     if (v !== 'estudiante') {
-      throw new DomainError('role inválido — se espera "estudiante"');
+      throw new DomainError("");
     }
     this.value = v;
killedBy: RoleValueObject invariantes — lanza DomainError "docente" → lanza "role inválido — se espera estudiante"
statusReason: expected [Function] to throw error including 'role inválido — se espera "estudiante"' but got ''

[Killed] BlockStatement
studentUsers/domain/studentUsersDomain.js:41:32
  * Protege invariantes y expone parámetros posicionales para la capa de infraestructura.
  */
 class StudentUsersAggregate {
-  constructor({ roleVO } = {}) {
-    if (!(roleVO instanceof RoleValueObject)) {
-      throw new DomainError('roleVO inválido');
-    }
-    this._role = roleVO;
-    Object.freeze(this);
-  }
+  constructor({ roleVO } = {}) {}
 
   /**
killedBy: StudentUsersAggregate obtenerParametros() — orden y valores exactos devuelve ["estudiante"] — 1 parámetro
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
studentUsers/domain/studentUsersDomain.js:42:9
  */
 class StudentUsersAggregate {
   constructor({ roleVO } = {}) {
-    if (!(roleVO instanceof RoleValueObject)) {
+    if (true) {
       throw new DomainError('roleVO inválido');
     }
killedBy: StudentUsersAggregate construcción válida construye con roleVO válido
statusReason: roleVO inválido

[Killed] BooleanLiteral
studentUsers/domain/studentUsersDomain.js:42:9
  */
 class StudentUsersAggregate {
   constructor({ roleVO } = {}) {
-    if (!(roleVO instanceof RoleValueObject)) {
+    if (roleVO instanceof RoleValueObject) {
       throw new DomainError('roleVO inválido');
     }
killedBy: StudentUsersAggregate construcción válida construye con roleVO válido
statusReason: roleVO inválido

[Survived] StringLiteral
studentUsers/domain/studentUsersDomain.js:43:29
 class StudentUsersAggregate {
   constructor({ roleVO } = {}) {
     if (!(roleVO instanceof RoleValueObject)) {
-      throw new DomainError('roleVO inválido');
+      throw new DomainError("");
     }
     this._role = roleVO;

[Killed] BlockStatement
studentUsers/domain/studentUsersDomain.js:53:23
    * Devuelve parámetros posicionales para la consulta SQL.
    * @returns {Array}
    */
-  obtenerParametros() {
-    return [this._role.value];
-  }
+  obtenerParametros() {}
 }
 
killedBy: StudentUsersAggregate obtenerParametros() — orden y valores exactos devuelve ["estudiante"] — 1 parámetro
statusReason: expected undefined to deeply equal [ 'estudiante' ]

[NoCoverage] BlockStatement
studentUsers/domain/studentUsersDomain.js:72:38
    * @returns {Promise<Array>}
    * @abstract
    */
-  async listarEstudiantes(_agregado) {
-    throw new Error('IStudentUsersRepository.listarEstudiantes() no implementado');
-  }
+  async listarEstudiantes(_agregado) {}
 }
 
