[Killed] BlockStatement
user/domain/userDomain.js:23:22
  * Value Object: UserCode (no vacío)
  */
 class UserCodeValueObject {
-  constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('userCode es requerido');
-    }
-    this.value = value.trim();
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: UserCodeValueObject (user) camino feliz acepta código de usuario válido
statusReason: expected undefined to be 'USR001' // Object.is equality

[Killed] MethodExpression
user/domain/userDomain.js:24:38
  */
 class UserCodeValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
+    if (typeof value !== 'string' || value.length === 0) {
       throw new DomainError('userCode es requerido');
     }
killedBy: UserCodeValueObject (user) invariantes — lanza DomainError solo espacios → lanza
statusReason: expected [Function] to throw an error

[Killed] BlockStatement
user/domain/userDomain.js:24:65
  */
 class UserCodeValueObject {
   constructor(value) {
-    if (typeof value !== 'string' || value.trim().length === 0) {
-      throw new DomainError('userCode es requerido');
-    }
+    if (typeof value !== 'string' || value.trim().length === 0) {}
     this.value = value.trim();
     Object.freeze(this);
killedBy: UserCodeValueObject (user) invariantes — lanza DomainError null → lanza "userCode es requerido"
statusReason: expected [Function] to throw error including 'userCode es requerido' but got 'Cannot read properties of null (readi…'

[Killed] BlockStatement
user/domain/userDomain.js:36:22
  * Value Object: Email (formato básico)
  */
 class EmailValueObject {
-  constructor(value) {
-    if (
-      typeof value !== 'string' ||
-      !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
-    ) {
-      throw new DomainError('email inválido');
-    }
-    this.value = value.trim();
-    Object.freeze(this);
-  }
+  constructor(value) {}
 }
 
killedBy: UserController.registrarUsuario returns 400 on DomainError (invalid email)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] ConditionalExpression
user/domain/userDomain.js:38:7
 class EmailValueObject {
   constructor(value) {
     if (
-      typeof value !== 'string' ||
-      !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
+      true
     ) {
       throw new DomainError('email inválido');
killedBy: UserController.registrarUsuario returns 201 with created user info
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] ConditionalExpression
user/domain/userDomain.js:38:7
 class EmailValueObject {
   constructor(value) {
     if (
-      typeof value !== 'string' ||
-      !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
+      false
     ) {
       throw new DomainError('email inválido');
killedBy: EmailValueObject invariantes — lanza DomainError null → lanza "email inválido"
statusReason: expected [Function] to throw error including 'email inválido' but got 'Cannot read properties of null (readi…'

[Killed] BooleanLiteral
user/domain/userDomain.js:39:7
   constructor(value) {
     if (
       typeof value !== 'string' ||
-      !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
+      /^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
     ) {
       throw new DomainError('email inválido');
killedBy: UserController.registrarUsuario returns 201 with created user info
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] Regex
user/domain/userDomain.js:39:8
   constructor(value) {
     if (
       typeof value !== 'string' ||
-      !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
+      !/^[^@\s]+@[^@\s]\.[^@\s]+$/.test(value)
     ) {
       throw new DomainError('email inválido');
killedBy: UserController.registrarUsuario returns 201 with created user info
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] BlockStatement
user/domain/userDomain.js:40:7
     if (
       typeof value !== 'string' ||
       !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
-    ) {
-      throw new DomainError('email inválido');
-    }
+    ) {}
     this.value = value.trim();
     Object.freeze(this);
killedBy: UserController.registrarUsuario returns 400 on DomainError (invalid email)
statusReason: expected "vi.fn()" to be called with arguments: [ 400 ]

Received: 

  1st vi.fn() call:

  [
-   400,

[Killed] StringLiteral
user/domain/userDomain.js:41:29
       typeof value !== 'string' ||
       !/^[^@\s]+@[^@\s]+\.[^@\s]+$/.test(value)
     ) {
-      throw new DomainError('email inválido');
+      throw new DomainError("");
     }
     this.value = value.trim();
killedBy: EmailValueObject invariantes — lanza DomainError null → lanza "email inválido"
statusReason: expected [Function] to throw error including 'email inválido' but got ''

[Killed] BlockStatement
user/domain/userDomain.js:61:11
     emailVO,
     role,
     hashedPassword,
-  } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
-      throw new DomainError('userCodeVO inválido');
-    }
-    if (!(emailVO instanceof EmailValueObject)) {
-      throw new DomainError('emailVO inválido');
-    }
-
-    this._userCode = userCodeVO;
-    this._firstName = firstName;
-    this._lastName = lastName;
-    this._dni = dni || null;
-    this._email = emailVO;
-    this._role = role || null;
-    this._hashedPassword = hashedPassword || null;
-    Object.freeze(this);
-  }
+  } = {}) {}
 
   /**
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: Cannot read properties of undefined (reading 'value')

[Killed] ConditionalExpression
user/domain/userDomain.js:62:9
     role,
     hashedPassword,
   } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
+    if (true) {
       throw new DomainError('userCodeVO inválido');
     }
killedBy: UserController.registrarUsuario returns 201 with created user info
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] BooleanLiteral
user/domain/userDomain.js:62:9
     role,
     hashedPassword,
   } = {}) {
-    if (!(userCodeVO instanceof UserCodeValueObject)) {
+    if (userCodeVO instanceof UserCodeValueObject) {
       throw new DomainError('userCodeVO inválido');
     }
killedBy: UserAggregate construcción válida construye con todos los campos
statusReason: userCodeVO inválido

[Killed] BooleanLiteral
user/domain/userDomain.js:65:9
     if (!(userCodeVO instanceof UserCodeValueObject)) {
       throw new DomainError('userCodeVO inválido');
     }
-    if (!(emailVO instanceof EmailValueObject)) {
+    if (emailVO instanceof EmailValueObject) {
       throw new DomainError('emailVO inválido');
     }
killedBy: UserController.registrarUsuario returns 201 with created user info
statusReason: expected "vi.fn()" to be called with arguments: [ 201 ]

Received: 

  1st vi.fn() call:

  [
-   201,

[Killed] ConditionalExpression
user/domain/userDomain.js:65:9
     if (!(userCodeVO instanceof UserCodeValueObject)) {
       throw new DomainError('userCodeVO inválido');
     }
-    if (!(emailVO instanceof EmailValueObject)) {
+    if (false) {
       throw new DomainError('emailVO inválido');
     }
killedBy: UserAggregate propagación de errores lanza DomainError si emailVO no es instancia de EmailValueObject
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
user/domain/userDomain.js:72:17
     this._userCode = userCodeVO;
     this._firstName = firstName;
     this._lastName = lastName;
-    this._dni = dni || null;
+    this._dni = true;
     this._email = emailVO;
     this._role = role || null;
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] ConditionalExpression
user/domain/userDomain.js:72:17
     this._userCode = userCodeVO;
     this._firstName = firstName;
     this._lastName = lastName;
-    this._dni = dni || null;
+    this._dni = false;
     this._email = emailVO;
     this._role = role || null;
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] LogicalOperator
user/domain/userDomain.js:74:18
     this._lastName = lastName;
     this._dni = dni || null;
     this._email = emailVO;
-    this._role = role || null;
+    this._role = role && null;
     this._hashedPassword = hashedPassword || null;
     Object.freeze(this);
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] ConditionalExpression
user/domain/userDomain.js:74:18
     this._lastName = lastName;
     this._dni = dni || null;
     this._email = emailVO;
-    this._role = role || null;
+    this._role = true;
     this._hashedPassword = hashedPassword || null;
     Object.freeze(this);
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] ConditionalExpression
user/domain/userDomain.js:75:28
     this._dni = dni || null;
     this._email = emailVO;
     this._role = role || null;
-    this._hashedPassword = hashedPassword || null;
+    this._hashedPassword = true;
     Object.freeze(this);
   }
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] ConditionalExpression
user/domain/userDomain.js:75:28
     this._dni = dni || null;
     this._email = emailVO;
     this._role = role || null;
-    this._hashedPassword = hashedPassword || null;
+    this._hashedPassword = false;
     Object.freeze(this);
   }
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [ 'USR001', 'Juan', 'Pérez', …(4) ] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] BlockStatement
user/domain/userDomain.js:83:23
    * Devuelve parámetros posicionales para registrar usuario en la BD.
    * @returns {Array}
    */
-  obtenerParametros() {
-    return [
-      this._userCode.value,
-      this._firstName,
-      this._lastName,
-      this._dni,
-      this._email.value,
-      this._role,
-      this._hashedPassword,
-    ];
-  }
+  obtenerParametros() {}
 }
 
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected undefined to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[Killed] ArrayDeclaration
user/domain/userDomain.js:84:12
    * @returns {Array}
    */
   obtenerParametros() {
-    return [
-      this._userCode.value,
-      this._firstName,
-      this._lastName,
-      this._dni,
-      this._email.value,
-      this._role,
-      this._hashedPassword,
-    ];
+    return [];
   }
 }
killedBy: UserAggregate obtenerParametros() — orden y valores exactos devuelve 7 parámetros en el orden correcto
statusReason: expected [] to deeply equal [ 'USR001', 'Juan', 'Pérez', …(4) ]

[NoCoverage] BlockStatement
user/domain/userDomain.js:109:26
    * @returns {Promise<Array>}
    * @abstract
    */
-  async listarUsuarios() {
-    throw new Error('IUserRepository.listarUsuarios() no implementado');
-  }
+  async listarUsuarios() {}
 
   /**

[NoCoverage] BlockStatement
user/domain/userDomain.js:119:37
    * @returns {Promise<boolean>}
    * @abstract
    */
-  async registrarUsuario(_agregado) {
-    throw new Error('IUserRepository.registrarUsuario() no implementado');
-  }
+  async registrarUsuario(_agregado) {}
 
   /**

[NoCoverage] BlockStatement
user/domain/userDomain.js:129:34
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async obtenerUsuarioPorId(_id) {
-    throw new Error('IUserRepository.obtenerUsuarioPorId() no implementado');
-  }
+  async obtenerUsuarioPorId(_id) {}
 
   /**

[NoCoverage] BlockStatement
user/domain/userDomain.js:139:40
    * @returns {Promise<Object|null>}
    * @abstract
    */
-  async obtenerUsuarioLogin(_userCode) {
-    throw new Error('IUserRepository.obtenerUsuarioLogin() no implementado');
-  }
+  async obtenerUsuarioLogin(_userCode) {}
 }
 

[NoCoverage] StringLiteral
user/domain/userDomain.js:140:21
    * @abstract
    */
   async obtenerUsuarioLogin(_userCode) {
-    throw new Error('IUserRepository.obtenerUsuarioLogin() no implementado');
+    throw new Error("");
   }
 }
